{
  "years": [
    2017,
    2018,
    2019,
    2020
  ],
  "minYear": 2017,
  "maxYear": 2020,
  "events": [
    "An attack on a nightclub in Istanbul, Turkey, during New Year's celebrations, kills at least 39 people and injures more than 60 others.",
    "Five people are killed and six others injured in a mass shooting at Fort Lauderdale-Hollywood International Airport in Broward County, Florida.",
    "A naming ceremony for the chemical element tennessine takes place in the United States.",
    "North Korea test fires a ballistic missile across the Sea of Japan.",
    "Kim Jong-nam, brother of North Korean dictator Kim Jong-Un, is assassinated at Kuala Lumpur International Airport.",
    "The Turkish-backed Free Syrian Army captures Al-Bab from ISIL.",
    "The elements Moscovium, Tennessine, and Oganesson are officially added to the periodic table at a conference in Moscow, Russia.",
    "For the first time in history all five major storm surge gates in the Netherlands are closed simultaneously in the wake of a storm.",
    "A false emergency alert warning of an impending missile strike in Hawaii causes widespread panic in the state.",
    "British multinational construction and facilities management services company Carillion went into liquidation – officially, \"the largest ever trading liquidation in the UK\"",
    "A bus catches fire on the Samara-Shymkent road in Yrgyz District, Aktobe, Kazakhstan. The fire kills 52 passengers, with three passengers and two drivers escaping.",
    "A group of four or five gunmen attack The Inter-Continental Hotel in Kabul, Afghanistan, sparking a 12-hour battle. The attack kills 40 people and injures many others.",
    "Syrian civil war: The Government of Turkey announces the initiation of the Afrin offensive and begins shelling Syrian Democratic Forces (SDF) positions in Afrin Region.",
    "Rocket Lab's Electron becomes the first rocket to reach orbit using an electric pump-fed engine and deploys three CubeSats.",
    "A 7.9 Mw  earthquake occurs in the Gulf of Alaska. It is tied as the sixth-largest earthquake ever recorded in the United States, but there are no reports of significant damage or fatalities.",
    "Chang'e 4 makes the first soft landing on the far side of the Moon, deploying the Yutu-2 lunar rover.",
    "Forty people are killed in a gold mine collapse in Badakhshan province, in northern Afghanistan.",
    "Muhammad V of Kelantan resigns as the Yang di-Pertuan Agong of Malaysia, becoming the first monarch to do so.",
    "A 13-year-old American girl, Jayme Closs, is found alive in Gordon, Wisconsin, having been kidnapped 88 days earlier from her parents' home whilst they were murdered.",
    "Abdullah of Pahang is sworn in as the 16th Yang di-Pertuan Agong of Malaysia.",
    "Iranian General Qasem Soleimani is killed by an American airstrike near Baghdad International Airport, igniting global concerns of a potential armed conflict.",
    "COVID-19 pandemic in Hubei: Municipal health officials in Wuhan announce the first recorded death from COVID-19.",
    "Taal Volcano in the Philippines erupts, and kills 39 people.",
    "The Thai Ministry of Public Health confirms the first case of COVID-19 outside China."
  ]
}