{
  "years": [
    1216,
    1217,
    1203,
    1204,
    1205,
    1206,
    1207,
    1208,
    1209,
    1210,
    1211,
    1212,
    1213,
    1214,
    1215
  ],
  "minYear": 1203,
  "maxYear": 1217,
  "events": [
    "The Fourth Crusade assaults Constantinople. The Byzantine emperor Alexios III Angelos flees from his capital into exile.",
    "Isaac II Angelos, restored Byzantine Emperor, declares his son Alexios IV Angelos co-emperor after pressure from the forces of the Fourth Crusade.",
    "The Siege of Château Gaillard ends in a French victory over King John of England, who loses control of Normandy to King Philip II Augustus.",
    "The Crusaders of the Fourth Crusade breach the walls of Constantinople and enter the city, which they completely occupy the following day.",
    "Constantinople falls to the Crusaders of the Fourth Crusade, temporarily ending the Byzantine Empire.",
    "Having been elected on May 9, Baldwin IX, Count of Flanders is crowned as the first Emperor of the Latin Empire.",
    "Philip of Swabia undergoes a second coronation as King of the Romans.",
    "Michael IV Autoreianos is appointed Ecumenical Patriarch of Constantinople.",
    "Terra Mariana, eventually comprising present-day Latvia and Estonia, is established.",
    "King John of England expels Canterbury monks for supporting Archbishop Stephen Langton.",
    "The Battle of Lena takes place between King Sverker II of Sweden and his rival, Prince Eric, whose victory puts him on the throne as King Eric X of Sweden.",
    "Massacre at Béziers: The first major military action of the Albigensian Crusade.",
    "Otto IV is crowned Emperor of the Holy Roman Empire by Pope Innocent III.",
    "Pope Innocent III excommunicates Holy Roman Emperor Otto IV.",
    "Battle of the Rhyndacus: The Latin emperor Henry of Flanders defeats the Nicaean emperor Theodore I Laskaris.",
    "The most severe of several early fires of London burns most of the city to the ground.",
    "The Golden Bull of Sicily is issued to confirm the hereditary royal title in Bohemia for the Přemyslid dynasty.",
    "Albigensian Crusade: Simon de Montfort, 5th Earl of Leicester, defeats Peter II of Aragon at the Battle of Muret.",
    "The port city of Sinope surrenders to the Seljuq Turks.",
    "Rebel barons renounce their allegiance to King John of England — part of a chain of events leading to the signing of the Magna Carta.",
    "Zhongdu (now Beijing), then under the control of the Jurchen ruler Emperor Xuanzong of Jin, is captured by the Mongols under Genghis Khan, ending the Battle of Zhongdu.",
    "First Barons' War: Prince Louis of France takes the city of Winchester, abandoned by John, King of England, and soon conquers over half of the kingdom.",
    "Pope Honorius III approves the Dominican Order through the papal bull of confirmation Religiosam vitam.",
    "The Second Battle of Lincoln is fought near Lincoln, England, resulting in the defeat of Prince Louis of France by William Marshal, 1st Earl of Pembroke."
  ]
}