{
  "years": [
    1880,
    1881,
    1879
  ],
  "minYear": 1879,
  "maxYear": 1881,
  "events": [
    "The Anglo-Zulu War begins.",
    "The Battle of Isandlwana during the Anglo-Zulu War results in a British defeat.",
    "Anglo-Zulu War: The Battle of Rorke's Drift ends.",
    "The Bulgarian National Bank is founded.",
    "Sandford Fleming first proposes adoption of Universal Standard Time at a meeting of the Royal Canadian Institute.",
    "The England cricket team led by Lord Harris is attacked in a riot during a match in Sydney.",
    "The War of the Pacific breaks out when the Chilean Army occupies the Bolivian port city of Antofagasta.",
    "Women's rights: US President Rutherford B. Hayes signs a bill allowing female attorneys to argue cases before the Supreme Court of the United States.",
    "In Utica, New York, Frank Woolworth opens the first of many of five-and-dime Woolworth stores.",
    "Thomas Edison receives a patent for his incandescent lamp.",
    "Seven people are killed in the Mussel Slough Tragedy, a gun battle in California.",
    "War of the Pacific: The Battle of Arica, the assault and capture of Morro de Arica (Arica Cape), ends the Campaña del Desierto (Desert Campaign).",
    "First performance of O Canada at the Congrès national des Canadiens-Français. The song would later become the national anthem of Canada.",
    "Australian bushranger Ned Kelly is captured at Glenrowan.",
    "France annexes Tahiti, renaming the independent Kingdom of Tahiti as \"Etablissements de français de l'Océanie\".",
    "Second Anglo-Afghan War: Battle of Maiwand: Afghan forces led by Mohammad Ayub Khan defeat the British Army in battle near Maiwand, Afghanistan.",
    "Construction of Cologne Cathedral, the most famous landmark in Cologne, Germany, is completed.",
    "The army of Mohammad Ayub Khan is routed by the British at the Battle of Kandahar, ending the Second Anglo-Afghan War.",
    "The sentences of the trial of the warlocks of Chiloé are imparted.",
    "The Canadian Pacific Railway is incorporated by Act of Parliament at Ottawa (44th Vic., c.1).",
    "China and Russia sign the Sino-Russian Ili Treaty.",
    "First Boer War: The Battle of Majuba Hill takes place.",
    "Spelman College is founded in Atlanta, Georgia as the Atlanta Baptist Female Seminary, an institute of higher education for African-American women.",
    "The Four Dead in Five Seconds Gunfight is fought in El Paso, Texas."
  ]
}