{
  "years": [
    1549,
    1551,
    1552,
    1553,
    1554,
    1555,
    1556
  ],
  "minYear": 1549,
  "maxYear": 1556,
  "events": [
    "The city of Salvador da Bahia, the first capital of Brazil, is founded.",
    "The Jesuit priest Francis Xavier's ship reaches Japan.",
    "Battle of Sampford Courtenay: The Prayer Book Rebellion is quashed in England.",
    "National University of San Marcos, the oldest university in the Americas, is founded in Lima, Peru.",
    "A coup by the military establishment of Japan's Ōuchi clan forces their lord to commit suicide, and their city is burned.",
    "Guru Amar Das becomes the Third Sikh guru.",
    "Russo-Kazan Wars: Russian troops enter Kazan.",
    "Lady Jane Grey takes the throne of England.",
    "The attempt to install Lady Jane Grey as Queen of England   collapses after only nine days.",
    "Michael Servetus is arrested by John Calvin in Geneva, Switzerland as a heretic.",
    "Coronation of Queen Mary I of England.",
    "Condemned as a heretic, Michael Servetus is burned at the stake just outside Geneva.",
    "Bayinnaung, who would go on to assemble the largest empire in the history of Southeast Asia, is crowned King of Burma.",
    "São Paulo, Brazil, is founded by Jesuit priests.",
    "Queen Mary I grants a royal charter to Derby School, as a grammar school for boys in Derby, England.",
    "Mary I marries Philip II of Spain at Winchester Cathedral.",
    "The Ava Kingdom falls to the Taungoo Dynasty in what is now Myanmar.",
    "John Rogers is burned at the stake, becoming the first English Protestant martyr under Mary I of England.",
    "Bishop of Gloucester John Hooper is burned at the stake.",
    "Ottoman Admiral Turgut Reis sacks the Italian city of Paola.",
    "The College of Arms is reincorporated by Royal charter signed by Queen Mary I of England and King Philip II of Spain.",
    "The Peace of Augsburg is signed by Emperor Charles V and the princes of the Schmalkaldic League.",
    "French Huguenots establish the France Antarctique colony in present-day Rio de Janeiro, Brazil.",
    "Philip II becomes King of Spain."
  ]
}