{
  "years": [
    1793,
    1794,
    1795,
    1796
  ],
  "minYear": 1793,
  "maxYear": 1796,
  "events": [
    "Jean-Pierre Blanchard becomes the first person to fly in a balloon in the United States.",
    "Nicolas Jean Hugon de Bassville, representative of Revolutionary France, is lynched by a mob in Rome.",
    "After being found guilty of treason by the French National Convention, Louis XVI of France is executed by guillotine.",
    "Second Partition of Poland.",
    "French Revolutionary Wars: France declares war on the United Kingdom and the Netherlands.",
    "The first modern republic in Germany, the Republic of Mainz, is declared by Andreas Joseph Hofmann.",
    "Flanders Campaign of the French Revolution, Battle of Neerwinden.",
    "During the French Revolution, the Committee of Public Safety becomes the executive organ of the republic.",
    "French revolutionary Jean-Paul Marat is acquitted by the Revolutionary Tribunal of charges brought by the Girondin in Paris.",
    "Battle of Famars during the Flanders Campaign of the War of the First Coalition.",
    "First session of United States Senate opens to the public.",
    "The 11th Amendment to the U.S. Constitution is passed by the U.S. Congress.",
    "Eli Whitney is granted a patent for the cotton gin.",
    "In Kraków, Tadeusz Kościuszko announces a general uprising against Imperial Russia and the Kingdom of Prussia, and assumes the powers of the Commander in Chief of all of the Polish forces.",
    "The United States Government establishes a permanent navy and authorizes the building of six frigates.",
    "Sardinians, headed by Giovanni Maria Angioy, start a revolution against the Savoy domination, expelling Viceroy Balbiano and his officials from Cagliari, the capital and largest city of the island.",
    "The Batavian Republic is proclaimed in the Netherlands, replacing the Dutch Republic.",
    "The Battle of Kharda is fought between the Maratha Confederacy and the Nizam of Hyderabad, resulting in Maratha victory.",
    "Partitions of Poland: The Duchy of Courland and Semigallia, a northern fief of the Polish-Lithuanian Commonwealth, ceases to exist and becomes part of Imperial Russia.",
    "Peace of Basel between France and Prussia is made.",
    "The French First Republic adopts the kilogram and gram as its primary unit of mass.",
    "The burghers of Swellendam expel the Dutch East India Company magistrate and declare a republic.",
    "The capital of Upper Canada is moved from Newark to York.",
    "Colombo in Ceylon (now Sri Lanka) falls to the British, completing their invasion of Ceylon."
  ]
}