{
  "years": [
    1184,
    1185,
    1186,
    1187,
    1189,
    1190,
    1177,
    1178,
    1179,
    1180,
    1183
  ],
  "minYear": 1177,
  "maxYear": 1190,
  "events": [
    "Baldwin IV of Jerusalem and Raynald of Châtillon defeat Saladin at the Battle of Montgisard.",
    "Five Canterbury monks see an event believed to have been the formation of the Giordano Bruno crater on the moon. It is believed that the current oscillations of the Moon's distance from the Earth (on the order of meters) are a result of this collision.",
    "The Battle of Kalvskinnet takes place outside Nidaros (now Trondheim), Norway. Earl Erling Skakke is killed, and the battle changes the tide of the civil wars.",
    "Philip II is crowned as 'King of France'.",
    "Emperor Antoku accedes to the throne of Japan.",
    "First Battle of Uji, starting the Genpei War in Japan.",
    "Genpei War: Battle of Ishibashiyama in Japan.",
    "Philip Augustus becomes king of France at the age of fifteen.",
    "Taira no Munemori and the Taira clan take the young Emperor Antoku and the three sacred treasures and flee to western Japan to escape pursuit by the Minamoto clan.",
    "The naval Battle of Fimreite is won by the Birkebeiner pretender Sverre Sigurdsson. Sigurdsson takes the Norwegian throne and King Magnus V of Norway is killed.",
    "Battle of Yashima: the Japanese forces of the Taira clan are defeated by the Minamoto clan.",
    "The cave city of Vardzia is consecrated by Queen Tamar of Georgia.",
    "Sack of Thessalonica by the Normans.",
    "Isaac II Angelos kills Stephen Hagiochristophorites and then appeals to the people, resulting in the revolt that deposes Andronikos I Komnenos and places Isaac on the throne of the Byzantine Empire.",
    "The Uprising of Asen and Peter begins on the feast day of St. Demetrius of Thessaloniki and ends with the creation of the Second Bulgarian Empire.",
    "Henry VI, the son and heir of the Holy Roman Emperor Frederick I, marries Constance of Sicily.",
    "Georgenberg Pact: Ottokar IV, Duke of Styria and Leopold V, Duke of Austria sign a heritage agreement in which Ottokar gives his duchy to Leopold and to his son Frederick under the stipulation that Austria and Styria would henceforth remain undivided.",
    "The Crusades: Battle of Hattin: Saladin defeats Guy of Lusignan, King of Jerusalem.",
    "Saladin begins the Siege of Jerusalem.",
    "Pope Clement III is elected.",
    "Richard I of England officially invested as Duke of Normandy.",
    "Friedrich Barbarossa arrives at Niš, the capital of Serbian King Stefan Nemanja, during the Third Crusade.",
    "Third Crusade: The Crusaders begin the Siege of Acre under Guy of Lusignan.",
    "Massacre of Jews at Clifford's Tower, York."
  ]
}