{
  "years": [
    1257,
    1258,
    1259,
    1260,
    1261,
    1262,
    1263,
    1264
  ],
  "minYear": 1257,
  "maxYear": 1264,
  "events": [
    "Richard of Cornwall, and his wife, Sanchia of Provence, are crowned King and Queen of the Germans at Aachen Cathedral.",
    "Kraków, in Poland, receives city rights.",
    "First Mongol invasion of Đại Việt: Đại Việt defeats the Mongols at the battle of Đông Bộ Đầu, forcing the Mongols to withdraw from the country.",
    "Mongol invasions: Baghdad falls to the Mongols, bringing the Islamic Golden Age to an end.",
    "War of Saint Sabas: In the Battle of Acre, the Venetians defeat a larger Genoese fleet sailing to relieve Acre.",
    "Regent George Mouzalon and his brothers are killed during a coup headed by the aristocratic faction under Michael VIII Palaiologos, paving the way for its leader to ultimately usurp the throne of the Empire of Nicaea.",
    "Michael VIII Palaiologos is proclaimed co-emperor of the Empire of Nicaea with his ward John IV Laskaris.",
    "Kings Louis IX of France and Henry III of England agree to the Treaty of Paris, in which Henry renounces his claims to French-controlled territory on continental Europe (including Normandy) in exchange for Louis withdrawing his support for English rebels.",
    "Kublai Khan becomes ruler of the Mongol Empire.",
    "The Livonian Order suffers its greatest defeat in the 13th century in the Battle of Durbe against the Grand Duchy of Lithuania",
    "The Mamluks defeat the Mongols at the Battle of Ain Jalut in Palestine, marking their first decisive defeat and the point of maximum expansion of the Mongol Empire.",
    "The Sienese Ghibellines, supported by the forces of Manfred, King of Sicily, defeat the Florentine Guelphs at Montaperti.",
    "The Great Prussian Uprising among the old Prussians begins against the Teutonic Knights.",
    "Chartres Cathedral is dedicated in the presence of King Louis IX of France.",
    "The city of Constantinople is recaptured by Nicaean forces under the command of Alexios Strategopoulos, re-establishing the Byzantine Empire.",
    "Pope Urban IV succeeds Pope Alexander IV, becoming the 182nd pope.",
    "Eleven-year-old John IV Laskaris of the restored Eastern Roman Empire is deposed and blinded by orders of his co-ruler Michael VIII Palaiologos.",
    "Battle of Hausbergen between bourgeois militias and the army of the bishop of Strasbourg.",
    "The Battle of Largs is fought between Norwegians and Scots.",
    "In the conflict between King Henry III of England and his rebellious barons led by Simon de Montfort, King Louis IX of France issues the Mise of Amiens, a one-sided decision in favour of Henry that later leads to the Second Barons' War.",
    "The Parliament of Ireland meets at Castledermot in County Kildare, the first definitively known meeting of this Irish legislature.",
    "Mudéjar revolt: Muslim rebel forces took the Alcázar of Jerez de la Frontera after defeating the Castilian garrison.",
    "After tricking the Venetian galley fleet into sailing east to the Levant, the Genoese capture an entire Venetian trade convoy at the Battle of Saseno.",
    "The Statute of Kalisz, guaranteeing Jews safety and personal liberties and giving battei din jurisdiction over Jewish matters, is promulgated by Bolesław the Pious, Duke of Greater Poland."
  ]
}