{
  "years": [
    1635,
    1636,
    1637,
    1638,
    1639,
    1640,
    1641
  ],
  "minYear": 1635,
  "maxYear": 1641,
  "events": [
    "The first public school in the United States, Boston Latin School, is founded in Boston.",
    "Thirty Years' War: The Peace of Prague is signed.",
    "Guadeloupe becomes a French colony.",
    "In the Eighty Years' War, the Spanish capture the strategic Dutch fortress of Schenkenschans.",
    "Eighty Years' War: The Siege of Schenkenschans begins; Frederick Henry, Prince of Orange, begins the recapture of the strategically important fortress from the Spanish Army.",
    "Roger Williams is banished from the Massachusetts Bay Colony after religious and policy disagreements.",
    "Dutch colonial forces on Taiwan launch a pacification campaign against native villages, resulting in Dutch control of the middle and south of the island.",
    "Utrecht University is founded in the Netherlands.",
    "The Massachusetts Bay Colony votes to establish a theological college, which would later become Harvard University.",
    "Ferdinand III becomes Holy Roman Emperor.",
    "The Scottish National Covenant is signed in Edinburgh.",
    "Anne Hutchinson is expelled from Massachusetts Bay Colony for religious dissent.",
    "The \"Fundamental Orders\", the first written constitution that created a government, is adopted in Connecticut.",
    "Hämeenlinna (Swedish: Tavastehus) was granted privileges after it separated from the Vanaja parish as its own city in Tavastia.",
    "Harvard College is named after clergyman John Harvard.",
    "Imperial forces are defeated by the Swedes at the Battle of Chemnitz. The Swedish victory prolongs the Thirty Years' War and allows them to advance into Bohemia.",
    "William Coddington founds Newport, Rhode Island.",
    "Madras (now Chennai), India, is founded by the British East India Company on a sliver of land bought from local Nayak rulers.",
    "The Royal Academy of Turku, the first university of Finland, is founded in the city of Turku by Queen Christina of Sweden at the proposal of Count Per Brahe.",
    "King Charles I of England dissolves the Short Parliament.",
    "Second Bishop's War: King Charles I's English army loses to a Scottish Covenanter force at the Battle of Newburn.",
    "The Treaty of Ripon is signed, restoring peace between Covenanter Scotland and King Charles.",
    "End of the Iberian Union: Portugal acclaims as King João IV of Portugal, ending 59 years of personal union of the crowns of Portugal and Spain and the end of the rule of the Philippine Dynasty.",
    "Arauco War: The first Parliament of Quillín is celebrated, putting a temporary hold on hostilities between Mapuches and Spanish in Chile."
  ]
}