{
  "years": [
    640,
    644,
    645,
    619,
    621,
    622,
    624,
    626,
    627,
    628,
    629,
    630,
    632,
    633,
    634,
    636,
    639
  ],
  "minYear": 619,
  "maxYear": 645,
  "events": [
    "A qaghan of the Western Turkic Khaganate is assassinated in a Chinese palace by Eastern Turkic rivals after the approval of Tang emperor Gaozu.",
    "Battle of Hulao: Li Shimin, the son of the Chinese emperor Gaozu, defeats the numerically superior forces of Dou Jiande near the Hulao Pass (Henan). This victory decides the outcome of the civil war that followed the Sui dynasty's collapse in favour of the Tang dynasty.",
    "The beginning of the Islamic calendar.",
    "The Battle of Badr, the first major battle between the Muslims and Quraysh.",
    "Li Shimin, the future Emperor Taizong of Tang, ambushes and kills his rival brothers Li Yuanji and Li Jiancheng in the Xuanwu Gate Incident.",
    "The Avar and Slav armies leave the siege of Constantinople.",
    "King Edwin of Northumbria is converted to Christianity by Paulinus, bishop of York.",
    "Khosrow II, last Sasanian shah of Iran, is overthrown.",
    "Emperor Heraclius enters Constantinople in triumph after his victory over the Persian Empire.",
    "Dagobert I is crowned King of the Franks.",
    "Conquest of Mecca: The prophet Muhammad and his followers conquer the city, Quraysh surrender.",
    "The Farewell Sermon (Khutbah, Khutbatul Wada') of the Islamic prophet Muhammad.",
    "Yazdegerd III ascends the throne as king (shah) of the Persian Empire. He becomes the last ruler of the Sasanian dynasty (modern Iran).",
    "Fatimah, daughter of the Islamic prophet Muhammad, dies, with her cause of death being a controversial topic among the Sunni Muslims and Shia Muslims.",
    " Battle of Hatfield Chase: King Edwin of Northumbria is defeated and killed by an alliance under Penda of Mercia and Cadwallon of Gwynedd.",
    "Fourth Council of Toledo takes place.",
    "Siege of Damascus: The Rashidun Arabs under Khalid ibn al-Walid capture Damascus from the Byzantine Empire.",
    "Arab-Byzantine wars: The Battle of Yarmouk between Byzantine Empire and Rashidun Caliphate begins.",
    "The Rashidun Caliphate defeats the Sasanian Empire at the Battle of al-Qādisiyyah in Iraq.",
    "Ashina Jiesheshuai and his tribesmen assaulted Emperor Taizong at Jiucheng Palace.",
    "Pope John IV is elected, several months after his predecessor's death.",
    "Umar ibn al-Khattab, the second Muslim caliph, is assassinated by a Persian slave in Medina.",
    "Isshi Incident: Prince Naka-no-Ōe and Fujiwara no Kamatari assassinate Soga no Iruka during a coup d'état at the imperial palace.",
    "Chinese forces under general Li Shiji besiege the strategic fortress city of Anshi (Liaoning) during the Goguryeo-Tang War."
  ]
}