{
  "years": [
    1620,
    1621,
    1622,
    1623,
    1624
  ],
  "minYear": 1620,
  "maxYear": 1624,
  "events": [
    "The Battle of Höchst takes place during the  Thirty Years' War.",
    "English crown bans tobacco growing in England, giving the Virginia Company a monopoly in exchange for tax of one shilling per pound.",
    "Speedwell leaves Delfshaven to bring pilgrims to America by way of England.",
    "The Mayflower departs from Southampton, England, carrying would-be settlers, on its first attempt to reach North America; it is forced to dock in Dartmouth when its companion ship, the Speedwell, springs a leak.",
    "The Pilgrims sail from Plymouth, England on the Mayflower to settle in North America. (Old Style date; September 16 per New Style date.)",
    "The town of Kokkola (Swedish: Karleby) was founded by King Gustavus Adolphus of Sweden.",
    "A determined band of 35 religious dissenters - Pilgrims set sail for Virginia from Plymouth, England in the Mayflower, jubilant at the prospect of practicing their unorthodox brand of worship in the New World.",
    "Polish-Ottoman War: The Ottoman Empire defeats the Polish-Lithuanian Commonwealth during the Battle of Cecora.",
    "Pilgrims aboard the Mayflower sight land at Cape Cod, Massachusetts.",
    "Gregory XV becomes Pope, the last Pope elected by acclamation.",
    "Myles Standish is appointed as first military commander of the English Plymouth Colony in North America.",
    "Samoset, a Mohegan, visits the settlers of Plymouth Colony and greets them, \"Welcome, Englishmen! My name is Samoset.\"",
    "The Protestant Union is formally dissolved.",
    "The Dutch West India Company receives a charter for New Netherland.",
    "Execution of 27 Czech noblemen on the Old Town Square in Prague as a consequence of the Battle of White Mountain.",
    "Ignatius of Loyola and Francis Xavier, founders of the Society of Jesus, are canonized by the Roman Catholic Church.",
    "The Capture of Ormuz by the East India Company ends Portuguese control of Hormuz Island.",
    "Battle of Macau: The Dutch make a failed attempt to capture Macau.",
    "Portuguese forces score a military victory over the Kingdom of Kongo at the Battle of Mbumbi in present-day Angola.",
    "The Plymouth Colony establishes the system of trial by 12-men jury in the American colonies.",
    "Sir Thomas Warner founds the first British colony in the Caribbean, on the island of Saint Kitts.",
    "French king Louis XIII names Cardinal Richelieu chief minister of France.",
    "Signing of the Treaty of Compiègne between France and the Netherlands.",
    "Charles de La Vieuville is arrested and replaced by Cardinal Richelieu as the French king's chief advisor."
  ]
}