{
  "years": [
    1648,
    1644,
    1645,
    1647
  ],
  "minYear": 1644,
  "maxYear": 1648,
  "events": [
    "Abel Tasman's second Pacific voyage begins as he leaves Batavia in command of three ships.",
    "The Third Anglo-Powhatan War begins in the Colony of Virginia.",
    "Transition from Ming to Qing: The Chongzhen Emperor, the last Emperor of Ming China, commits suicide during a peasant rebellion led by Li Zicheng.",
    "Ming general Wu Sangui forms an alliance with the invading Manchus and opens the gates of the Great Wall of China at Shanhaiguan pass, letting the Manchus through towards the capital Beijing.",
    "Portuguese Restoration War: Portuguese and Spanish forces both claim victory in the Battle of Montijo.",
    "Manchu regent Dorgon defeats rebel leader Li Zicheng of the Shun dynasty at the Battle of Shanhai Pass, allowing the Manchus to enter and conquer the capital city of Beijing.",
    "English Civil War: Bolton Massacre by Royalist troops under the command of James Stanley, 7th Earl of Derby.",
    "The Qing dynasty Manchu forces led by the Shunzhi Emperor take Beijing during the collapse of the Ming dynasty.",
    "Charles I of England defeats a Parliamentarian detachment at the Battle of Cropredy Bridge.",
    "Archbishop William Laud is beheaded for treason at the Tower of London.",
    "Scotland in the Wars of the Three Kingdoms: Battle of Inverlochy.",
    "Battle of Alford: Wars of the Three Kingdoms.",
    "Qing dynasty regent Dorgon issues an edict ordering all Han Chinese men to shave their forehead and braid the rest of their hair into a queue identical to those of the Manchus.",
    "Thirty Years' War: The Second Battle of Nördlingen sees French forces defeating those of the Holy Roman Empire.",
    "Sweden and Denmark sign Peace of Brömsebro.",
    "Wars of the Three Kingdoms: Scottish Royalists are defeated by Covenanters at the Battle of Philiphaugh.",
    "The Irish Confederate Wars and Wars of the Three Kingdoms: Battle of Dungan's Hill: English Parliamentary forces defeat Irish forces.",
    "England's Long Parliament passes the \"Vote of No Addresses\", breaking off negotiations with King Charles I and thereby setting the scene for the second phase of the English Civil War.",
    "Eighty Years' War: The Treaty of Münster and Osnabrück is signed, ending the conflict between the Netherlands and Spain.",
    "The Peace of Münster is ratified, by which Spain acknowledges Dutch sovereignty.",
    "Emperor Ferdinand III defeats Maximilian I of Bavaria in the Battle of Zusmarshausen.",
    "The Roundheads defeat the Cavaliers at the Battle of Maidstone in the Second English Civil War.",
    "Margaret Jones is hanged in Boston for witchcraft in the first such execution for the Massachusetts Bay Colony.",
    "Second English Civil War: The Siege of Colchester ends when Royalists Forces surrender to the Parliamentary Forces after eleven weeks, during the Second English Civil War."
  ]
}