{
  "years": [
    1768,
    1769,
    1770,
    1767
  ],
  "minYear": 1767,
  "maxYear": 1770,
  "events": [
    "Samuel Wallis, a British sea captain, sights Tahiti and is considered the first European to reach the island.",
    "Pitcairn Island is discovered by Midshipman Robert Pitcairn on an expeditionary voyage commanded by Philip Carteret.",
    "Norway's oldest newspaper still in print, Adresseavisen, is founded and the first edition is published.",
    "Jesuits all over Chile are arrested as the Spanish Empire suppresses the Society of Jesus.",
    "Surveying for the Mason-Dixon line separating Maryland from Pennsylvania is completed.",
    "Polish nobles form the Bar Confederation.",
    "The Royal Academy of Arts hosts its first art opening.",
    "Rioting occurs in London after John Wilkes is imprisoned for writing an article for The North Briton severely criticizing King George III.",
    "James Otis Jr. offends the King and Parliament in a speech to the Massachusetts General Court.",
    "Captain James Cook sets sail from England on board HMS Endeavour.",
    "Unification of Nepal",
    "The former slave ship Fredensborg sinks off Tromøya in Norway.",
    "The first edition of the Encyclopædia Britannica is published.",
    "King Taksin's coronation achieved through conquest as a king of Thailand and established Thonburi as a capital.",
    "An expedition led by Gaspar de Portolá leaves its base in California and sets out to find the Port of Monterey (now Monterey, California).",
    "Father Junípero Serra founds California's first mission, Mission San Diego de Alcalá. Over the following decades, it evolves into the city of San Diego, California.",
    "Dartmouth College is founded by the Reverend Eleazar Wheelock, with a royal charter from King George III, on land donated by Royal governor John Wentworth.",
    "Sino-Burmese War: The war ends with the Qing dynasty withdrawing from Burma forever.",
    "Boston Massacre: Five Americans, including Crispus Attucks, are fatally shot by British troops in an event that would contribute to the outbreak of the American Revolutionary War (also known as the American War of Independence) five years later.",
    "Marie Antoinette marries Louis XVI of France in a proxy wedding.",
    "The Georgian king, Erekle II, abandoned by his Russian ally Count Totleben, wins a victory over Ottoman forces at Aspindza.",
    "James Cook arrives in Australia at Botany Bay, which he names.",
    "The 14-year-old Marie Antoinette marries 15-year-old Louis-Auguste, who later becomes king of France.",
    "British explorer Captain James Cook runs aground on the Great Barrier Reef."
  ]
}