{
  "years": [
    1056,
    1057,
    1058,
    1060,
    1031,
    1032,
    1034,
    1066,
    1038,
    1040,
    1041,
    1042,
    1046,
    1048,
    1051,
    1054,
    1055
  ],
  "minYear": 1031,
  "maxYear": 1066,
  "events": [
    "Olaf II of Norway is canonized as Saint Olaf by Grimketel, the English Bishop of Selsey.",
    "Conrad II, Holy Roman Emperor becomes king of Burgundy.",
    "Máel Coluim mac Cináeda, King of Scots, dies. His grandson, Donnchad, son of Bethóc and Crínán of Dunkeld, inherits the throne.",
    "King Stephen I, the first king of Hungary, dies; his nephew, Peter Orseolo, succeeds him.",
    "King Duncan I is killed in battle against his first cousin and rival Macbeth. The latter succeeds him as King of Scotland.",
    "Michael V, adoptive son of Empress Zoë of Byzantium, is proclaimed emperor of the Eastern Roman Empire.",
    "Edward the Confessor becomes King of England - the country's penultimate Anglo-Saxon king.",
    "Nasir Khusraw begins the seven-year Middle Eastern journey which he will later describe in his book Safarnama.",
    "Henry III is crowned Holy Roman Emperor by Pope Clement II.",
    "Damasus II is elected pope, and dies 23 days later.",
    "Battle of Kapetron between a combined Byzantine-Georgian army and a Seljuq army.",
    "Henry I of France marries the Rus' princess, Anne of Kiev.",
    "Three Roman legates break relations between Western and Eastern Christian Churches through the act of placing an Papal bull (of doubtful validity) of Excommunication on the altar of Hagia Sophia during Saturday afternoon divine liturgy. Historians frequently describe the event as the start of the East-West Schism.",
    "Siward, Earl of Northumbria, invades Scotland and defeats Macbeth, King of Scotland somewhere north of the Firth of Forth.",
    "Theodora is crowned empress of the Byzantine Empire.",
    "After a sudden illness a few days previously, Byzantine Empress Theodora dies childless, thus ending the Macedonian dynasty.",
    "Frederik van Lotharingen elected as first Belgian Pope Stephen IX.",
    "King Macbeth is killed at the Battle of Lumphanan by the forces of Máel Coluim mac Donnchada.",
    "Abdication of Byzantine Emperor Michael VI Bringas after just one year.",
    "Agnes of Poitou and Andrew I of Hungary meet to negotiate about the border territory of Burgenland.",
    "Béla I is crowned king of Hungary.",
    "Following the death of Edward the Confessor on the previous day, the Witan meets to confirm Harold Godwinson as the new King of England; Harold is crowned the same day, sparking a succession crisis that will eventually lead to the Norman conquest of England.",
    "Norwegian king Harald Hardrada lands with Tostig Godwinson at the mouth of the Humber River and begins his invasion of England.",
    "At the Battle of Fulford, Harald Hardrada defeats earls Morcar and Edwin."
  ]
}