{
  "years": [
    1326,
    1327,
    1328,
    1329,
    1330,
    1331,
    1332,
    1333,
    1334,
    1335,
    1336,
    1337,
    1339
  ],
  "minYear": 1326,
  "maxYear": 1339,
  "events": [
    "The Treaty of Novgorod delineates borders between Russia and Norway in Finnmark.",
    "The teenaged Edward III is crowned King of England, but the country is ruled by his mother Queen Isabella and her lover Roger Mortimer.",
    "First War of Scottish Independence: James Douglas leads a raid into Weardale and almost kills Edward III of England.",
    "Wars of Scottish Independence end: By the Treaty of Edinburgh-Northampton, England recognises Scotland as an independent state.",
    "Antipope Nicholas V, a claimant to the papacy, is consecrated in Rome by the Bishop of Venice.",
    "William of Ockham, the Franciscan Minister-General Michael of Cesena, and two other Franciscan leaders secretly leave Avignon, fearing a death sentence from Pope John XXII.",
    "Philip VI is crowned King of France.",
    "Battle of Cassel: French troops stop an uprising of Flemish farmers.",
    "Pope John XXII issues his In Agro Dominico condemning some writings of Meister Eckhart as heretical.",
    "The Battle of Pelekanon results in a Byzantine defeat by the Ottoman Empire.",
    "Quilon, the first Indian Christian Diocese, is erected by Pope John XXII; the French-born Jordanus is appointed the first Bishop.",
    "At the Battle of Posada, Basarab I of Wallachia defeats the Hungarian army of Charles I Robert.",
    "King Stefan Uroš III, after months of anarchy, surrenders to his son and rival Stefan Dušan, who succeeds as King of Serbia.",
    "Stefan Dušan declares himself king of Serbia.",
    "Amda Seyon I, Emperor of Ethiopia begins his campaigns in the southern Muslim provinces.",
    "Rinchinbal Khan becomes the Khagan of the Mongols and Emperor of the Yuan dynasty, reigning for only 53 days.",
    "The River Arno floods causing massive damage in Florence as recorded by the Florentine chronicler Giovanni Villani.",
    "The bishop of Florence blesses the first foundation stone for the new campanile (bell tower) of the Florence Cathedral, designed by the artist Giotto di Bondone.",
    "Cardinal Jacques Fournier, a Cistercian monk, is elected Pope Benedict XII.",
    "At the congress of Visegrád Charles I of Hungary mediates a reconciliation between two neighboring monarchs, John of Bohemia and Casimir III of Poland. ",
    "Four thousand defenders of Pilenai commit mass suicide rather than be taken captive by the Teutonic Knights.",
    "Francesco Petrarca (Petrarch) ascends Mont Ventoux.",
    "Edward, the Black Prince is made Duke of Cornwall, the first Duchy in England.",
    "The Milanese army and the St. George's (San Giorgio) Mercenaries of Lodrisio Visconti clash in the Battle of Parabiago; Visconti is defeated."
  ]
}