{
  "years": [
    706,
    677,
    711,
    680,
    681,
    682,
    683,
    684,
    713,
    686,
    687,
    714,
    715,
    690,
    717,
    694,
    699
  ],
  "minYear": 677,
  "maxYear": 717,
  "events": [
    "Climax of the Siege of Thessalonica by the Slavs in a three-day assault on the city walls.",
    "The Battle of Karbala is won by the Umayyads under Yazid I.",
    "The Sixth Ecumenical Council commences in Constantinople.",
    "Twelfth Council of Toledo: King Erwig of the Visigoths initiates a council in which he implements diverse measures against the Jews in Spain.",
    "Pope Honorius I is posthumously excommunicated by the Sixth Ecumenical Council.",
    "Pope Leo II begins his pontificate.",
    "During the Siege of Mecca, the Kaaba catches fire and is burned down.",
    "Pope Benedict II is chosen.",
    "Battle of Marj Rahit: Umayyad partisans defeat the supporters of Ibn al-Zubayr and cement Umayyad control of Syria.",
    "Maya king Yuknoom Yich'aak K'ahk' assumes the crown of Calakmul.",
    "Pope Sergius I is elected as a compromise between antipopes Paschal and Theodore.",
    "Empress Wu Zetian ascends to the throne of the Tang dynasty and proclaims herself ruler of the Chinese Empire.",
    "At the Seventeenth Council of Toledo, Egica, a king of the Visigoths of Hispania, accuses Jews of aiding Muslims, sentencing all Jews to slavery.",
    "En no Ozuno, a Japanese mystic and apothecary who will later be regarded as the founder of a folk religion Shugendō, is banished to Izu Ōshima.",
    "Byzantine emperor Justinian II has his predecessors Leontios and Tiberios III publicly executed in the Hippodrome of Constantinople.",
    "In China, Emperor Zhongzong of Tang inters the bodies of relatives in the Qianling Mausoleum, located on Mount Liang outside Chang'an.",
    "Dagobert III succeeds his father King Childebert III as King of the Franks.",
    "Islamic conquest of Hispania: Moorish troops led by Tariq ibn Ziyad land at Gibraltar to begin their invasion of the Iberian Peninsula (Al-Andalus).",
    "Umayyad conquest of Hispania: Battle of Guadalete: Umayyad forces under Tariq ibn Ziyad defeat the Visigoths led by King Roderic.",
    "The Byzantine emperor Philippicus is blinded, deposed and sent into exile by conspirators of the Opsikion army in Thrace. He is succeeded by Anastasios II, who begins the reorganization of the Byzantine army.",
    "Pepin of Herstal, mayor of the Merovingian palace, dies at Jupille (modern Belgium). He is succeeded by his infant grandson Theudoald, while his widow Plectrude holds actual power in the Frankish Kingdom.",
    "Pope Gregory II is elected.",
    "Ragenfrid defeats Theudoald at the Battle of Compiègne.",
    "Theodosius III resigns the throne to the Byzantine Empire to enter the clergy."
  ]
}