{
  "years": [
    1283,
    1284,
    1285,
    1287,
    1288,
    1291,
    1292,
    1293,
    1294,
    1295,
    1296,
    1297,
    1298
  ],
  "minYear": 1283,
  "maxYear": 1298,
  "events": [
    "Battle of the Gulf of Naples: Roger of Lauria, admiral to King Peter III of Aragon, destroys the Neapolitan fleet and captures Charles of Salerno.",
    "Roger of Lauria, commanding the Aragonese fleet, defeats an Angevin fleet sent to put down a rebellion on Malta.",
    "The Statute of Rhuddlan incorporates the Principality of Wales into England.",
    "The Republic of Pisa is defeated in the Battle of Meloria by the Republic of Genoa, thus losing its naval dominance in the Mediterranean.",
    "Second Mongol invasion of Vietnam: Forces led by Prince Trần Quang Khải of the Trần dynasty destroy most of the invading Mongol naval fleet in a battle at Chuong Duong.",
    "King Wareru founds the Hanthawaddy Kingdom, and proclaims independence from the Pagan Kingdom.",
    "Kublai Khan defeats the force of Nayan and other traditionalist Borjigin princes in East Mongolia and Manchuria.",
    "Mongol invasions of Vietnam: Yuan forces are defeated by Trần forces in the Battle of Bach Dang in present-day northern Vietnam.",
    "The Battle of Worringen ends the War of the Limburg Succession, with John I, Duke of Brabant, being one of the more important victors.",
    "Scottish nobles recognize the authority of Edward I of England pending the selection of a king.",
    "Fall of Acre, the end of Crusader presence in the Holy Land.",
    "The Old Swiss Confederacy is formed with the signature of the Federal Charter.",
    "John Balliol becomes King of Scotland.",
    "King Sancho IV of Castile creates the Estudio de Escuelas de Generales in Alcalá de Henares.",
    "Raden Wijaya is crowned as the first monarch of Majapahit kingdom of Java, taking the throne name Kertarajasa Jayawardhana.",
    "Temür, grandson of Kublai, is elected Khagan of the Mongols and Emperor of the Yuan dynasty with the reigning titles Oljeitu and Chengzong.",
    "Saint Celestine V resigns the papacy after only five months to return to his previous life as an ascetic hermit.",
    "Pope Boniface VIII is elected, replacing St. Celestine V, who had resigned.",
    "Przemysł II crowned king of Poland, following Ducal period. The white eagle is added to the Polish coat of arms.",
    "The first treaty forming the Auld Alliance between Scotland and France against England is signed in Paris.",
    "Edward I sacks Berwick-upon-Tweed, during armed conflict between Scotland and England.",
    "First War of Scottish Independence: John Balliol's Scottish army is defeated by an English army commanded by John de Warenne, 6th Earl of Surrey at the Battle of Dunbar.",
    "François Grimaldi, disguised as a monk, leads his men to capture the fortress protecting the Rock of Monaco, establishing his family as the rulers of Monaco.",
    "Residents of Riga and Grand Duchy of Lithuania defeated the Livonian Order in the Battle of Turaida."
  ]
}