{
  "years": [
    1422,
    1423,
    1426,
    1429,
    1430,
    1431,
    1432,
    1434,
    1435,
    1436,
    1438,
    1439
  ],
  "minYear": 1422,
  "maxYear": 1439,
  "events": [
    "Battle of Arbedo between the duke of Milan and the Swiss cantons.",
    "King Henry V of England dies of dysentery while in France. His son, Henry VI becomes King of England at the age of nine months.",
    "After the brief Gollub War, the Teutonic Knights sign the Treaty of Melno with Poland and Lithuania.",
    "Hundred Years' War: Battle of Cravant: The French army is defeated by the English at Cravant on the banks of the river Yonne.",
    "Gov. Thado of Mohnyin becomes king of Ava.",
    "Lam Sơn uprising: Lam Sơn rebels emerge victorious against the Ming army in the Battle of Tốt Động - Chúc Động taking place in Đông Quan, in now Hanoi.",
    "English forces under Sir John Fastolf defend a supply convoy carrying rations to the army besieging Orléans in the Battle of the Herrings.",
    "Joan of Arc arrives to relieve the Siege of Orléans.",
    "Armagnac-Burgundian Civil War: Joan of Arc liberates Saint-Pierre-le-Moûtier.",
    "Philip the Good, the Duke of Burgundy, establishes the Order of the Golden Fleece, the most prestigious, exclusive, and expensive order of chivalry in the world.",
    "The Ottoman Empire under Murad II captures Thessalonica from the Republic of Venice.",
    "Francesco Sforza, lord of Milan, conquers Lucca.",
    "The trial of Joan of Arc begins in Rouen.",
    "The Battle of La Higueruela takes place in Granada, leading to a modest advance of the Kingdom of Castile during the Reconquista.",
    "The first battle between the forces of Švitrigaila and Sigismund Kęstutaitis is fought near the town of Oszmiana (Ashmyany), launching the most active phase of the Lithuanian Civil War.",
    "Hussite Wars: Battle of Lipany: Effectively ending the war, Utraquist forces led by Diviš Bořek of Miletínek defeat and almost annihilate Taborite forces led by Prokop the Great.",
    "Sicut Dudum, forbidding the enslavement of the Guanche natives in Canary Islands by the Spanish, is promulgated by Pope Eugene IV.",
    "The Congress of Arras causes Burgundy to switch sides in the Hundred Years' War.",
    "Assassination of the Swedish rebel (later national hero) Engelbrekt Engelbrektsson",
    "Albert II of Habsburg is crowned King of Hungary.",
    "The Council of Basel suspends Pope Eugene IV.",
    "Nine leaders of the Transylvanian peasant revolt are executed at Torda.",
    "A temporary compromise between the rebellious Transylvanian peasants and the noblemen is signed in Kolozsmonostor Abbey.",
    "Plymouth becomes the first town incorporated by the English Parliament."
  ]
}