{
  "years": [
    1800,
    1801,
    1798,
    1799
  ],
  "minYear": 1798,
  "maxYear": 1801,
  "events": [
    "Constantine Hangerli arrives in Bucharest, Wallachia, as its new Prince, invested by the Ottoman Empire.",
    "The Roman Republic is proclaimed after Louis-Alexandre Berthier, a general of Napoleon, had invaded the city of Rome five days earlier.",
    "Louis-Alexandre Berthier removes Pope Pius VI from power.",
    "French Revolutionary Wars: A French force attempting to dislodge a small British garrison on the Îles Saint-Marcouf is  repulsed with heavy losses.",
    "United Irishmen Rebellion: Battle of Carlow begins; executions of suspected rebels at Carnew and at Dunlavin Green take place.",
    "The Battle of Oulart Hill takes place in Wexford, Ireland; Irish rebel leaders defeat and kill a detachment of militia.",
    "British Prime Minister William Pitt the Younger introduces an income tax of two shillings to the pound to raise funds for Great Britain's war effort in the Napoleonic Wars.",
    "Maltese patriot Dun Mikiel Xerri, along with a number of other patriots, is executed.",
    "The Russo-Ottoman siege of Corfu ends with the surrender of the French garrison.",
    "Fourth Anglo-Mysore War: The Battle of Seringapatam: The siege of Seringapatam ends when the city is invaded and Tipu Sultan killed by the besieging British army, under the command of General George Harris.",
    "War of the Second Coalition: Austrian forces defeat the French at Winterthur, Switzerland.",
    "Ranjit Singh conquers Lahore and becomes Maharaja of the Punjab (Sikh Empire).",
    "The Rosetta Stone is found in the Egyptian village of Rosetta by French Captain Pierre-François Bouchard during Napoleon's Egyptian Campaign.",
    "With the church leadership driven out of Rome during an armed conflict, Pius VII is crowned Pope in Venice with a temporary papal tiara made of papier-mâché.",
    "Ludwig van Beethoven leads the premiere of his First Symphony in Vienna.",
    "The Treaty of Constantinople establishes the Septinsular Republic, the first autonomous Greek state since the Fall of the Byzantine Empire. (Under the Old Style calendar then still in use in the Ottoman Empire, the treaty was signed on 21 March.)",
    "The Septinsular Republic is established.",
    "The 6th United States Congress recesses, and the process of moving the Federal government of the United States from Philadelphia to Washington, D.C., begins the following day.",
    "David Thompson reaches the mouth of the Saskatchewan River in Manitoba.",
    "The French Army of First Consul Napoleon Bonaparte defeats the Austrians at the Battle of Marengo in Northern Italy and re-conquers Italy.",
    "The Provisional Army of the United States is dissolved.",
    "The legislative union of Kingdom of Great Britain and Kingdom of Ireland is completed, and the United Kingdom of Great Britain and Ireland is proclaimed.",
    "Ceres, the largest and first known object in the Asteroid belt, is discovered by Giuseppe Piazzi.",
    "John Marshall is sworn in as Chief Justice of the United States."
  ]
}