{
  "years": [
    1904,
    1905,
    1906,
    1903
  ],
  "minYear": 1903,
  "maxYear": 1906,
  "events": [
    "Topsy, an elephant, is electrocuted by the owners of Luna Park, Coney Island. The Edison film company records the film Electrocuting an Elephant of Topsy's death.",
    "Hallam Tennyson, 2nd Baron Tennyson, son of the poet Alfred Tennyson, becomes the second Governor-General of Australia.",
    "El Yunque National Forest in Puerto Rico becomes part of the United States National Forest System as the Luquillo Forest Reserve.",
    "Anton Bruckner's 9th Symphony receives its first performance in Vienna, Austria.",
    "The United States Department of Commerce and Labor is established (later split into the Department of Commerce and the Department of Labor).",
    "Cuba leases Guantánamo Bay to the United States \"in perpetuity\".",
    "In New York City the Martha Washington Hotel opens, becoming the first hotel exclusively for women.",
    "Pelican Island National Wildlife Refuge, the first national wildlife refuge in the US, is established by President Theodore Roosevelt.",
    "The Kishinev pogrom in Kishinev (Bessarabia) begins, forcing tens of thousands of Jews to later seek refuge in Palestine and the Western world.",
    "Atlético Madrid Association football club is founded",
    "The distress signal \"CQD\" is established only to be replaced two years later by \"SOS\".",
    "Anton Chekhov's The Cherry Orchard receives its premiere performance at the Moscow Art Theatre.",
    "Battle of Port Arthur: A surprise torpedo attack by the Japanese at Port Arthur, Japan starts the Russo-Japanese War.",
    "Aceh War: Dutch Colonial Army's Marechaussee regiment led by General G.C.E. van Daalen launch military campaign to capture Gayo Highland, Alas Highland, and Batak Highland in Dutch East Indies' Northern Sumatra region, which ends with genocide to Acehnese and Bataks people.",
    "Russo-Japanese War: Battle of Port Arthur concludes.",
    "The French Third Republic and the United Kingdom of Great Britain and Ireland sign the Entente cordiale.",
    "In Mexico, the General Hospital of Mexico is inaugurated, started with four basic specialties.",
    "The U.S. Supreme Court upholds the constitutionality of Massachusetts's mandatory smallpox vaccination program in Jacobson v. Massachusetts.",
    "Chicago attorney Paul Harris and three other businessmen meet for lunch to form the Rotary Club, the world's first service club.",
    "Eleftherios Venizelos calls for Crete's union with Greece, and begins what is to be known as the Theriso revolt.",
    "Kaiser Wilhelm II of Germany declares his support for Moroccan independence in Tangier, beginning the First Moroccan Crisis.",
    "The Supreme Court of the United States decides Lochner v. New York, which holds that the \"right to free contract\" is implicit in the due process clause of the Fourteenth Amendment to the United States Constitution.",
    "Albert Einstein completes his doctoral thesis at the University of Zurich.",
    "HMS Dreadnought, the first of a revolutionary new breed of battleships, is christened."
  ]
}