{
  "years": [
    1088,
    1091,
    1092,
    1095,
    1096,
    1097,
    1098,
    1099,
    1100,
    1077,
    1080,
    1081,
    1082,
    1083,
    1085,
    1086
  ],
  "minYear": 1077,
  "maxYear": 1100,
  "events": [
    "Walk to Canossa: The excommunication of Henry IV, Holy Roman Emperor, is lifted after he humbles himself before Pope Gregory VII at Canossa in Italy.",
    "The Patriarchate of Friûl, the first Friulian state, is created.",
    "Harald III of Denmark dies and is succeeded by Canute IV, who would later be the first Dane to be canonized.",
    "Alexios I Komnenos overthrows the Byzantine emperor Nikephoros III Botaneiates, and, after his troops spend three days extensively looting Constantinople, is formally crowned on April 4.",
    "The Normans defeat the Byzantine Empire in the Battle of Dyrrhachium.",
    "Ramon Berenguer II, Count of Barcelona is assassinated.",
    "Canonization of the first King of Hungary, Saint Stephen and his son Saint Emeric celebrated as a National Day in Hungary.",
    "Alfonso VI of Castile takes Toledo, Spain, back from the Moors.",
    "King Canute IV of Denmark is killed by rebellious peasants.",
    "Spanish Reconquista: At the Battle of Sagrajas, the Almoravids defeats the Castilians, but are unable to take advantage of their victory.",
    "Election of Urban II as the 159th Pope of the Catholic Church. He is best known for initiating the Crusades.",
    "Battle of Levounion: The Pechenegs are defeated by Byzantine Emperor Alexios I Komnenos.",
    "The Diocese of Pisa is elevated to the rank of metropolitan archdiocese by Pope Urban II",
    "The Council of Clermont begins: called by Pope Urban II, it led to the First Crusade to the Holy Land.",
    "Pope Urban II declares the First Crusade at the Council of Clermont.",
    "Starting date of the First Crusade as set by Pope Urban II.",
    "A Seljuk Turkish army successfully fights off the People's Crusade.",
    "The Siege of Nicaea begins during the First Crusade.",
    "First Crusade: Crusaders led by Godfrey of Bouillon, Bohemund of Taranto, and Raymond IV, Count of Toulouse, begin the Siege of Antioch.",
    "After 5-month siege during the First Crusade, the Crusaders seize Antioch (today's Turkey).",
    "Fighters of the First Crusade defeat Kerbogha of Mosul.",
    "Raniero is elected as Pope Paschal II.",
    "Henry I is crowned King of England in Westminster Abbey.",
    "Baldwin of Boulogne is crowned the first King of Jerusalem in the Church of the Nativity in Bethlehem."
  ]
}