{
  "years": [
    1825,
    1826,
    1827
  ],
  "minYear": 1825,
  "maxYear": 1827,
  "events": [
    "The U.S. Congress approves Indian Territory (in what is present-day Oklahoma), clearing the way for forced relocation of the Eastern Indians on the \"Trail of Tears\".",
    "The Ohio Legislature authorizes the construction of the Ohio and Erie Canal and the Miami and Erie Canal.",
    "The Creek cede the last of their lands in Georgia to the United States government by the Treaty of Indian Springs, and migrate west.",
    "Roberto Cofresí, one of the last successful Caribbean pirates, is defeated in combat and captured by authorities.",
    "General Lafayette, a French officer in the American Revolutionary War, speaks at what would become Lafayette Square, Buffalo, during his visit to the United States.",
    "The first cornerstone is laid for Fort Hamilton in New York City.",
    "The Bolivian Declaration of Independence is proclaimed.",
    "The Thirty-Three Orientals declare the independence of Uruguay from Brazil.",
    "The world's first public railway to use steam locomotives, the Stockton and Darlington Railway, is ceremonially opened.",
    "The Menai Suspension Bridge, considered the world's first modern suspension bridge, connecting the Isle of Anglesey to the north West coast of Wales, is opened.",
    "University College London is founded as University of London.",
    "The signing of the Treaty of Yandabo marks the end of the First Anglo-Burmese War.",
    "Pope Leo XII publishes the apostolic constitution Quo Graviora in which he renewed the prohibition on Catholics joining freemasonry.",
    "HMS Beagle departs on its first voyage.",
    "Maniots defeat Egyptians under Ibrahim Pasha in the Battle of Vergas.",
    "John Adams and Thomas Jefferson, respectively the second and third presidents of the United States, die on the same day, on the fiftieth anniversary of the adoption of the United States Declaration of Independence. Adams' last words were, \"Thomas Jefferson survives,\" not knowing that Jefferson had died hours earlier.",
    "Major Gordon Laing becomes the first non-Muslim to enter Timbuktu.",
    "Brazilian marines unsuccessfully attack the temporary naval base of Carmen de Patagones, Argentina.",
    "Shrigley abduction: Ellen Turner is abducted by Edward Gibbon Wakefield, a future politician in colonial New Zealand.",
    "Slavery is abolished in the State of New York.",
    "Dutch King William I and Pope Leo XII sign concord.",
    "José de la Mar becomes President of Peru.",
    "Russo-Persian War: The Russian army under Ivan Paskevich storms Yerevan, ending a millennium of Muslim domination of Armenia.",
    "Greek War of Independence: In the Battle of Navarino, a combined Turkish and Egyptian fleet is defeated by British, French and Russian naval forces in the last significant battle fought with wooden sailing ships."
  ]
}