{
  "years": [
    392,
    393,
    394,
    363,
    364,
    365,
    366,
    367,
    395,
    401,
    402,
    372,
    378,
    379,
    380,
    381
  ],
  "minYear": 363,
  "maxYear": 402,
  "events": [
    "The Roman emperor Julian defeats the Sasanian army in the Battle of Ctesiphon, under the walls of the Sasanian capital, but is unable to take the city.",
    "Emperor Julian marches back up the Tigris and burns his fleet of supply ships. During the withdrawal, Roman forces suffer several attacks from the Persians.",
    "Valentinian I is proclaimed Roman emperor.",
    "Roman Emperor Valentinian I appoints his brother Flavius Valens co-emperor.",
    "Roman usurper Procopius bribes two legions passing by Constantinople, and proclaims himself emperor.",
    "The Alemanni cross the Rhine and invade Gaul. Emperor Valentinian I moves to Paris to command the army and defend the Gallic cities.",
    "Pope Damasus I is consecrated.",
    "Gratian, son of Roman Emperor Valentinian I, is named co-Augustus at the age of eight by his father.",
    "Sixteen Kingdoms: Jin Xiaowudi, age 10, succeeds his father Jin Jianwendi as Emperor of the Eastern Jin dynasty.",
    "General Siyaj K'ak' conquers Tikal, enlarging the domain of King Spearthrower Owl of Teotihuacán.",
    "Gothic War: Battle of Adrianople: A large Roman army led by Emperor Valens is defeated by the Visigoths. Valens is killed along with over half of his army.",
    "Yax Nuun Ahiin I is crowned as 15th Ajaw of Tikal",
    "Edict of Thessalonica: Emperor Theodosius I and his co-emperors Gratian and Valentinian II declare their wish that all Roman citizens convert to Nicene Christianity.",
    "Theodosius I makes his adventus, or formal entry, into Constantinople.",
    "The end of the First Council of Christian bishops convened in Constantinople by the Roman Emperor Theodosius I.",
    "Arbogast has Eugenius elected Western Roman Emperor.",
    "Roman emperor Theodosius I proclaims his eight-year-old son Honorius co-emperor.",
    "The Graffito of Esmet-Akhom, the latest known inscription in Egyptian hieroglyphs, is written.",
    "Battle of the Frigidus: Roman emperor Theodosius I defeats and kills Eugenius the usurper. His Frankish magister militum Arbogast escapes but commits suicide two days later.",
    "Rufinus, praetorian prefect of the East, is murdered by Gothic mercenaries under Gainas.",
    "Later Yan is defeated by its former vassal Northern Wei at the Battle of Canhe Slope.",
    "The Visigoths, led by king Alaric I, cross the Alps and invade northern Italy.",
    "Pope Innocent I is elected, the only pope to succeed his father in the office.",
    "Stilicho defeats the Visigoths under Alaric in the Battle of Pollentia."
  ]
}