{
  "years": [
    1605,
    1606,
    1607,
    1608,
    1609
  ],
  "minYear": 1605,
  "maxYear": 1609,
  "events": [
    "The first edition of El ingenioso hidalgo Don Quijote de la Mancha (Book One of Don Quixote) by Miguel de Cervantes is published in Madrid, Spain.",
    "The city of Oulu, Finland, is founded by Charles IX of Sweden.",
    "The armies of Sweden are defeated by the Polish-Lithuanian Commonwealth in the Battle of Kircholm.",
    "Gunpowder Plot: Guy Fawkes is arrested.",
    "Robert Catesby, ringleader of the Gunpowder Plotters, is killed.",
    "The Virginia Company of London is established by royal charter by James I of England with the purpose of establishing colonial settlements in North America.",
    "The Union Flag is adopted as the flag of English and Scottish ships.",
    "The ships Susan Constant, Godspeed, and Discovery depart England carrying settlers who founded, at Jamestown, Virginia, the first of the thirteen colonies that became the United States.",
    "San Agustin Church in Manila is officially completed; it is the oldest church still standing in the Philippines.",
    "L'Orfeo by Claudio Monteverdi, one of the first works recognized as an opera, receives its première performance.",
    "Susenyos I defeats the combined armies of Yaqob and Abuna Petros II at the Battle of Gol in Gojjam, making him Emperor of Ethiopia.",
    "Eighty Years' War: The Dutch fleet destroys the anchored Spanish fleet at Gibraltar.",
    "English colonists establish \"James Fort,\" which would become Jamestown, Virginia, the earliest permanent English settlement in the Americas.",
    "One hundred-five English settlers under the leadership of Captain Christopher Newport established the colony called Jamestown at the mouth of the James River on the Virginia coast, the first permanent English colony in America.",
    "Colonists finished building James's Fort, to defend against Spanish and Indian attacks.",
    "The Flight of the Earls takes place in Ireland.",
    "Fire destroys Jamestown, Virginia.",
    "In Ireland: O'Doherty's Rebellion is launched by the Burning of Derry.",
    "A newly nationalized silver mine in Scotland at Hilderston, West Lothian is re-opened by Bevis Bulmer.",
    "The Protestant Union, a coalition of Protestant German states, is founded to defend the rights, land and safety of each member against the Catholic Church and Catholic German states.",
    "London: Virginia gets new charter, extending borders from \"sea to sea\".",
    "Samuel de Champlain lands at Tadoussac, Quebec, in the course of his third voyage to New France, and begins erecting fortifications.",
    "Québec City is founded by Samuel de Champlain.",
    "Moriscos are expelled from the Kingdom of Valencia."
  ]
}