{
  "years": [
    768,
    769,
    771,
    775,
    781,
    783,
    732,
    737,
    747,
    750,
    752,
    755,
    756,
    757,
    758,
    759,
    760,
    762,
    763,
    766
  ],
  "minYear": 732,
  "maxYear": 783,
  "events": [
    "Charles Martel's forces defeat an Umayyad army near Tours, France.",
    "The Turgesh drive back an Umayyad invasion of Khuttal, follow them south of the Oxus, and capture their baggage train.",
    "Abbasid Revolution: Abu Muslim Khorasani begins an open revolt against Umayyad rule, which is carried out under the sign of the Black Standard.",
    "Carloman, mayor of the palace of Austrasia, renounces his position as majordomo and retires to a monastery near Rome. His brother Pepin the Short becomes the sole ruler (de facto) of the Frankish Kingdom.",
    "In the Battle of the Zab, the Abbasid rebels defeat the Umayyad Caliphate, leading to the overthrow of the dynasty.",
    "Mayan king Bird Jaguar IV of Yaxchilan in modern-day Chiapas, Mexico, assumes the throne.",
    "An Lushan revolts against Chancellor Yang Guozhong at Yanjing, initiating the An Lushan Rebellion during the Tang dynasty of China.",
    "Abd al-Rahman I, the founder of the Arab dynasty that ruled the greater part of Iberia for nearly three centuries, becomes emir of Cordova, Spain.",
    "Du Fu returns to Chang'an as a member of Emperor Xuanzong's court, after having escaped the city during the An Lushan Rebellion.",
    "Guangzhou is sacked by Arab and Persian pirates.",
    "Tang dynasty poet Du Fu departs for Chengdu, where he is hosted by fellow poet Pei Di.",
    "Fourteenth recorded perihelion passage of Halley's Comet.",
    "Baghdad is founded.",
    "Led by Muhammad al-Nafs al-Zakiyya, the Hasanid branch of the Alids begins the Alid Revolt against the Abbasid Caliphate.",
    "During the An Shi Rebellion, the Tang dynasty, with the help of Huihe tribe, recaptures Luoyang from the rebels.",
    "Following the Battle of Bakhamra between Alids and Abbasids near Kufa, the Alid rebellion ends with the death of Ibrahim, brother of Isa ibn Musa.",
    "The Byzantine army of emperor Constantine V defeats the Bulgarian forces in the Battle of Anchialus.",
    "Emperor Constantine V humiliates nineteen high-ranking officials, after discovering a plot against him. He executes the leaders, Constantine Podopagouros and his brother Strategios.",
    "Pope Stephen III is elected to office, and quickly seeks Frankish protection against the Lombard threat, since the Byzantine Empire is no longer able to help.",
    "The Lateran Council condemns the Council of Hieria and anathematizes its iconoclastic rulings.",
    "Austrasian king Carloman I dies, leaving his brother Charlemagne king of the now complete Frankish Kingdom.",
    "The Battle of Bagrevand puts an end to an Armenian rebellion against the Abbasid Caliphate. Muslim control over the South Caucasus is solidified and its Islamization begins, while several major Armenian nakharar families lose power and their remnants flee to the Byzantine Empire.",
    "The oldest recorded eruption of Mount Fuji (Traditional Japanese date: Sixth day of the seventh month of the first year of the Ten'o (天応) era).",
    "The Asturian queen Adosinda is held at a monastery to prevent her king from retaking the throne from Mauregatus."
  ]
}