{
  "years": [
    64,
    65,
    96,
    97,
    68,
    69,
    70,
    73,
    79,
    81,
    85
  ],
  "minYear": 64,
  "maxYear": 97,
  "events": [
    "The Great Fire of Rome causes widespread devastation and rages on for six days, destroying half of the city.",
    "The freedman Milichus betrays Piso's plot to kill the Emperor Nero and all the conspirators are arrested.",
    "Nero commits suicide, after quoting Vergil's Aeneid, thus ending the Julio-Claudian dynasty and starting the civil war known as the Year of the Four Emperors.",
    "The Roman legions in Germania Superior refuse to swear loyalty to Galba. They rebel and proclaim Vitellius as emperor.",
    "Lucius Calpurnius Piso Licinianus is appointed by Galba as deputy Roman Emperor.",
    "Otho seizes power in Rome, proclaiming himself Emperor of Rome, beginning a reign of only three months.",
    "Vitellius, commander of the Rhine armies, defeats Emperor Otho in the Battle of Bedriacum to take power over Rome.",
    "Defeated by Vitellius' troops at Bedriacum, Otho commits suicide.",
    "Tiberius Julius Alexander orders his Roman legions in Alexandria to swear allegiance to Vespasian as Emperor.",
    "Batavian rebellion: The Batavians in Germania Inferior (Netherlands) revolt under the leadership of Gaius Julius Civilis.",
    "In the Second Battle of Bedriacum, troops loyal to Vespasian defeat those of Emperor Vitellius.",
    "Antonius Primus enters Rome to claim the title of Emperor for Nero's former general Vespasian.",
    "Siege of Jerusalem: Titus and his Roman legions breach the Second Wall of Jerusalem. Jewish defenders retreat to the First Wall. The Romans build a circumvallation, cutting down all trees within fifteen kilometres.",
    "The armies of Titus attack the walls of Jerusalem after a six-month siege. Three days later they breach the walls, which enables the army to destroy the Second Temple.",
    "First Jewish-Roman War: Titus and his armies breach the walls of Jerusalem. (17th of Tammuz in the Hebrew calendar).",
    "Fires resulting from the destruction of the Second Temple in Jerusalem are extinguished.",
    "Titus ends the siege of Jerusalem after destroying Herod's Temple.",
    "A Roman army under Titus occupies and plunders Jerusalem.",
    "Masada, a Jewish fortress, falls to the Romans after several months of siege, ending the First Jewish-Roman War.",
    "Mount Vesuvius begins stirring, on the feast day of Vulcan, the Roman god of fire.",
    "Domitian becomes Emperor of the Roman Empire upon the death of his brother Titus.",
    "Nerva, suspected of complicity of the death of Domitian, is declared emperor by Senate. The Senate then annuls laws passed by Domitian and orders his statues to be destroyed.",
    "Nerva is proclaimed Roman emperor after Domitian is assassinated.",
    "Roman emperor Nerva is forced by the Praetorian Guard to adopt general Marcus Ulpius Trajanus as his heir and successor."
  ]
}