{
  "years": [
    1649,
    1650,
    1651,
    1652,
    1653
  ],
  "minYear": 1649,
  "maxYear": 1653,
  "events": [
    "English Civil War: The Rump Parliament votes to put Charles I on trial.",
    "The High Court of Justice for the trial of Charles I begins its proceedings.",
    "Charles I of England is executed in Whitehall, London.",
    "The Second Battle of Guararapes takes place, effectively ending Dutch colonization efforts in Brazil.",
    "The Frondeurs and the French sign the Peace of Rueil.",
    "The House of Commons of England passes an act abolishing the House of Lords, declaring it \"useless and dangerous to the people of England\".",
    "An Act of Parliament declaring England a Commonwealth is passed by the Long Parliament. England would be a republic for the next eleven years.",
    "Start of the Sumuroy Revolt: Filipinos in Northern Samar led by Agustin Sumuroy revolt against Spanish colonial authorities.",
    "The Italian city of Castro is completely destroyed by the forces of Pope Innocent X, ending the Wars of Castro.",
    "The Battle of Carbisdale: A Royalist army from Orkney invades mainland Scotland but is defeated by a Covenanter army.",
    "Colonel George Monck of the English Army forms Monck's Regiment of Foot, which will later become the Coldstream Guards.",
    "Victory over the royalists in the Battle of Dunbar opens the way to Edinburgh for the New Model Army in the Third English Civil War.",
    "Silver-loaded Spanish ship San José is pushed south by strong winds, subsequently it wrecks in the coast of southern Chile and its surviving crew is killed by indigenous Cuncos.",
    "The Deluge: Khmelnytsky Uprising: The Battle of Berestechko ends with a Polish victory.",
    "Castle Cornet in Guernsey, the last stronghold which had supported the King in the Third English Civil War, surrenders.",
    "At the Cape of Good Hope, Dutch sailor Jan van Riebeeck establishes a resupply camp that eventually becomes Cape Town.",
    "Slavery in Rhode Island is abolished, although the law is not rigorously enforced.",
    "Tarhoncu Ahmed Pasha is appointed Grand Vizier of the Ottoman Empire.",
    "Battle of Plymouth: Inconclusive naval action between the fleets of Michiel de Ruyter and George Ayscue in the First Anglo-Dutch War.",
    "Defeat at the Battle of Dungeness causes the Commonwealth of England to reform its navy.",
    "By the Coonan Cross Oath, the Eastern Church in India cuts itself off from colonial Portuguese tutelage.",
    "New Amsterdam (later renamed The City of New York) is incorporated.",
    "Oliver Cromwell dissolves the Rump Parliament.",
    "First Anglo-Dutch War: The Battle of the Gabbard begins, lasting until the following day."
  ]
}