{
  "years": [
    1623,
    1624,
    1625,
    1626,
    1627,
    1628,
    1629,
    1630
  ],
  "minYear": 1623,
  "maxYear": 1630,
  "events": [
    "The Plymouth Colony establishes the system of trial by 12-men jury in the American colonies.",
    "Sir Thomas Warner founds the first British colony in the Caribbean, on the island of Saint Kitts.",
    "French king Louis XIII names Cardinal Richelieu chief minister of France.",
    "Signing of the Treaty of Compiègne between France and the Netherlands.",
    "Charles de La Vieuville is arrested and replaced by Cardinal Richelieu as the French king's chief advisor.",
    "The French king Louis XIII appoints Cardinal Richelieu as prime minister.",
    "A combined Spanish and Portuguese fleet of 52 ships commences the recapture of Bahia from the Dutch during the Dutch-Portuguese War.",
    "Afonso Mendes, appointed by Pope Gregory XV as Latin Patriarch of Ethiopia, arrives at Beilul from Goa.",
    "King Charles I of England marries Catholic princess Henrietta Maria of France and Navarre, at Canterbury.",
    "Yuan Chonghuan is appointed Governor of Liaodong, after leading the Chinese into a great victory against the Manchurians under Nurhaci.",
    "Dutch explorer Peter Minuit arrives in New Netherland (present day Manhattan Island) aboard the See Meeuw.",
    "Peter Minuit buys Manhattan.",
    "The new St Peter's Basilica is consecrated.",
    "The Polish-Lithuanian Commonwealth Navy has its greatest and last victory in the Battle of Oliwa.",
    "Writs issued in February by Charles I of England mandate that every county in England (not just seaport towns) pay ship tax by this date.",
    "The Massachusetts Bay Colony is granted a Royal charter.",
    "The Petition of Right, a major English constitutional document, is granted the Royal Assent by Charles I and becomes law.",
    "The Swedish warship Vasa sinks in the Stockholm harbour after only about 20 minutes of her maiden voyage.",
    "George Villiers, the first Duke of Buckingham, is assassinated by John Felton.",
    "Puritans settle Salem, which became part of Massachusetts Bay Colony.",
    "French Wars of Religion: The Siege of La Rochelle ends with the surrender of the Huguenots after fourteen months.",
    "Holy Roman Emperor Ferdinand II and Danish King Christian IV sign the Treaty of Lübeck ending Danish intervention in the Thirty Years' War.",
    "Dutch forces led by Hendrick Lonck capture Olinda in what was to become part of Dutch Brazil.",
    "Thirty Years' War: Four thousand Swedish troops under Gustavus Adolphus land in Pomerania, Germany."
  ]
}