{
  "years": [
    1412,
    1415,
    1416,
    1418,
    1419,
    1420,
    1422,
    1426,
    1429,
    1430
  ],
  "minYear": 1412,
  "maxYear": 1430,
  "events": [
    "Behnam Hadloyo becomes Syriac Orthodox Patriarch of Mardin.",
    "Religious reformers John Wycliffe and Jan Hus are condemned as heretics at the Council of Constance.",
    "Jan Hus is condemned by the assembly of the council in the Konstanz Cathedral as a heretic and sentenced to be burned at the stake. (See Deaths section.)",
    "Thomas Grey is executed for participating in the Southampton Plot.",
    "Henry the Navigator leads Portuguese forces to victory over the Marinids at the Conquest of Ceuta.",
    "Hundred Years' War: Henry V of England, with his lightly armoured infantry and archers, defeats the heavily armoured French cavalry in the Battle of Agincourt.",
    "Battle of Gallipoli: The Venetians under Pietro Loredan defeat a much larger Ottoman fleet off Gallipoli.",
    "The Council of Constance, called by Emperor Sigismund, a supporter of Antipope John XXIII, burns Jerome of Prague following a trial for heresy.",
    "Armagnac-Burgundian Civil War: Parisians slaughter sympathizers of Bernard VII, Count of Armagnac, along with all prisoners, foreign bankers, and students and faculty of the College of Navarre.",
    "First Defenestration of Prague: A crowd of radical Hussites kill seven members of the Prague city council.",
    "John the Fearless, Duke of Burgundy is assassinated by adherents of the Dauphin, the future Charles VII of France.",
    "Troops of the Republic of Venice capture Udine, ending the independence of the Patria del Friuli.",
    "A 9.4 MS-strong earthquake shakes Chile's Atacama Region causing tsunamis in Chile as well as Hawaii and Japan.",
    "Beijing is officially designated the capital of the Ming dynasty when the Forbidden City is completed.",
    "Henry V of England enters Paris alongside his father-in-law King Charles VI of France.",
    "King Henry V of England dies of dysentery while in France. His son, Henry VI becomes King of England at the age of nine months.",
    "After the brief Gollub War, the Teutonic Knights sign the Treaty of Melno with Poland and Lithuania.",
    "Gov. Thado of Mohnyin becomes king of Ava.",
    "Lam Sơn uprising: Lam Sơn rebels emerge victorious against the Ming army in the Battle of Tốt Động - Chúc Động taking place in Đông Quan, in now Hanoi.",
    "English forces under Sir John Fastolf defend a supply convoy carrying rations to the army besieging Orléans in the Battle of the Herrings.",
    "Joan of Arc arrives to relieve the Siege of Orléans.",
    "Philip the Good, the Duke of Burgundy, establishes the Order of the Golden Fleece, the most prestigious, exclusive, and expensive order of chivalry in the world.",
    "The Ottoman Empire under Murad II captures Thessalonica from the Republic of Venice.",
    "Francesco Sforza, lord of Milan, conquers Lucca."
  ]
}