{
  "years": [
    1819,
    1820,
    1821,
    1822
  ],
  "minYear": 1819,
  "maxYear": 1822,
  "events": [
    "University of Virginia chartered by Commonwealth of Virginia, with Thomas Jefferson one of its founders.",
    "Stamford Raffles lands on the island of Singapore.",
    "Sir Thomas Stamford Raffles founds Singapore.",
    "The United States House of Representatives passes the Missouri Compromise for the first time.",
    "British explorer William Smith discovers the South Shetland Islands and claims them in the name of King George III.",
    "By the Adams-Onís Treaty, Spain sells Florida to the United States for five million U.S. dollars.",
    "SS Savannah leaves port at Savannah, Georgia, United States, on a voyage to become the first steamship to cross the Atlantic Ocean.",
    "A Russian expedition led by Fabian Gottlieb von Bellingshausen and Mikhail Petrovich Lazarev discovers the Antarctic continent, approaching the Antarctic coast.",
    "Edward Bransfield sights the Trinity Peninsula and claims the discovery of Antarctica.",
    "The first 86 African American immigrants sponsored by the American Colonization Society depart New York to start a settlement in present-day Liberia.",
    "Cato Street Conspiracy: A plot to murder all the British cabinet ministers is exposed and the conspirators arrested.",
    "The U.S. Congress passes the Missouri Compromise.",
    "The Missouri Compromise is signed into law by President James Monroe. The compromise allows Missouri to enter the Union as a slave state, brings Maine into the Union as a free state, and makes the rest of the northern part of the Louisiana Purchase territory slavery-free.",
    "The Venus de Milo is discovered on the Aegean island of Milos.",
    "Alexander Ypsilantis is declared leader of Filiki Eteria, a secret organization to overthrow Ottoman rule over Greece.",
    "Execution of the Cato Street Conspirators, who plotted to kill the British Cabinet and Prime Minister Lord Liverpool.",
    "Final stage of the Mexican War of Independence from Spain with Plan of Iguala.",
    "Greek War of Independence: Battle and fall of city of Kalamata.",
    "Patriarch Gregory V of Constantinople is hanged by the Ottoman government from the main gate of the Patriarchate and his body is thrown into the Bosphorus.",
    "Benderli Ali Pasha arrives in Constantinople as the new Grand Vizier of the Ottoman Empire; he remains in power for only nine days before being sent into exile.",
    "Emperor Napoleon dies in exile on the island of Saint Helena in the South Atlantic Ocean.",
    "Establishment of the Peloponnesian Senate by the Greek rebels.",
    "The Portuguese prince Pedro I of Brazil decides to stay in Brazil against the orders of the Portuguese King João VI, beginning the Brazilian independence process.",
    "The design of the Greek flag is adopted by the First National Assembly at Epidaurus."
  ]
}