{
  "years": [
    1216,
    1217,
    1218,
    1219,
    1220,
    1223,
    1225,
    1226,
    1212,
    1213,
    1214,
    1215
  ],
  "minYear": 1212,
  "maxYear": 1226,
  "events": [
    "The most severe of several early fires of London burns most of the city to the ground.",
    "Battle of Las Navas de Tolosa: After Pope Innocent III calls European knights to a crusade, forces of Kings Alfonso VIII of Castile, Sancho VII of Navarre, Peter II of Aragon and Afonso II of Portugal defeat those of the Berber Muslim leader Almohad, thus marking a significant turning point in the Reconquista and in the medieval history of Spain.",
    "The Golden Bull of Sicily is issued to confirm the hereditary royal title in Bohemia for the Přemyslid dynasty.",
    "Albigensian Crusade: Simon de Montfort, 5th Earl of Leicester, defeats Peter II of Aragon at the Battle of Muret.",
    "The port city of Sinope surrenders to the Seljuq Turks.",
    "Rebel barons renounce their allegiance to King John of England — part of a chain of events leading to the signing of the Magna Carta.",
    "Zhongdu (now Beijing), then under the control of the Jurchen ruler Emperor Xuanzong of Jin, is captured by the Mongols under Genghis Khan, ending the Battle of Zhongdu.",
    "King John of England puts his seal to Magna Carta.",
    "Pope Innocent III issues a bull declaring Magna Carta invalid.",
    "The Fourth Council of the Lateran meets, defining the doctrine of transubstantiation, the process by which bread and wine are, by that doctrine, said to transform into the body and blood of Christ.",
    "First Barons' War: Prince Louis of France takes the city of Winchester, abandoned by John, King of England, and soon conquers over half of the kingdom.",
    "Pope Honorius III approves the Dominican Order through the papal bull of confirmation Religiosam vitam.",
    "The Second Battle of Lincoln is fought near Lincoln, England, resulting in the defeat of Prince Louis of France by William Marshal, 1st Earl of Pembroke.",
    "Livonian Crusade: The Estonian leader Lembitu and Livonian leader Kaupo the Accursed are killed in the Battle of St. Matthew's Day.",
    "The Charter of the Forest is sealed at St Paul's Cathedral, London by King Henry III, acting under the regency of William Marshall, 1st Earl of Pembroke which re-establishes for free men rights of access to the royal forest that had been eroded by William the Conqueror and his heirs.",
    "The Fifth Crusade leaves Acre for Egypt.",
    "Al-Kamil becomes sultan of the Ayyubid dynasty.",
    "Northern Crusades: Danish victory at the Battle of Lindanise (modern-day Tallinn) establishes the Danish Duchy of Estonia.",
    "Sweden is defeated by Estonian tribes in the Battle of Lihula.",
    "Mongol invasion of the Cumans: Battle of the Kalka River: Mongol armies of Genghis Khan led by Subutai defeat Kievan Rus' and Cumans.",
    "Louis VIII becomes King of France upon the death of his father, Philip II.",
    "Treaty of San Germano is signed at San Germano between Holy Roman Emperor Frederick II and Pope Gregory IX. A Dominican named Guala is responsible for the negotiations.",
    "Khwarazmian sultan Jalal ad-Din conquers the Georgian capital of Tbilisi.",
    "The first recorded instance of the Catholic practice of perpetual Eucharistic adoration formally begins in Avignon, France."
  ]
}