{
  "years": [
    1575,
    1576,
    1577,
    1578,
    1579
  ],
  "minYear": 1575,
  "maxYear": 1579,
  "events": [
    "Luanda, the capital of Angola, is founded by the Portuguese navigator Paulo Dias de Novais.",
    "Leiden University is founded, and given the motto Praesidium Libertatis.",
    "Mughal Emperor Akbar defeats Sultan of Bengal Daud Khan Karrani's army at the Battle of Tukaroi.",
    "Sengoku period of Japan: The combined forces of Oda Nobunaga and Tokugawa Ieyasu are victorious in the Battle of Nagashino.",
    "The Raid of the Redeswire is the last major battle between England and Scotland.",
    "Roman Catholic forces under Henry I, Duke of Guise, defeat the Protestants, capturing Philippe de Mornay among others.",
    "An earthquake with an estimated magnitude of 8.5Mw  strikes Valdivia, Chile.",
    "The Mexican city of León is founded by order of the viceroy Don Martín Enríquez de Almanza.",
    "Henry of Navarre abjures Catholicism at Tours and rejoins the Protestant forces in the French Wars of Religion.",
    "Jerome Savage takes out a sub-lease to start the Newington Butts Theatre outside London.",
    "While exploring the North Atlantic Ocean in an attempt to find the Northwest Passage, Martin Frobisher sights Greenland, mistaking it for the hypothesized (but non-existent) island of \"Frisland\".",
    "The cornerstone for Tycho Brahe's Uraniborg observatory is laid on the island of Hven.",
    "Eighty Years' War: In Flanders, Spain captures Antwerp (which is nearly destroyed after three days).",
    "The Treaty of Bergerac is signed between King Henry III of France and the Huguenots.",
    "Courtiers Christopher Hatton and Thomas Heneage are knighted by Queen Elizabeth I of England.",
    "Sir Francis Drake sets sail from Plymouth, England, on his round-the-world voyage.",
    "King Henry III lays the first stone of the Pont Neuf (New Bridge), the oldest bridge of Paris, France.",
    "Battle of Al Kasr al Kebir: The Moroccans defeat the Portuguese. King Sebastian of Portugal is killed in the battle, leaving his elderly uncle, Cardinal Henry, as his heir. This initiates a succession crisis in Portugal.",
    "Spanish colonization of the Americas: Tegucigalpa, capital city of Honduras, is claimed by the Spaniards.",
    "The Union of Arras unites the southern Netherlands under the Duke of Parma (Ottavio Farnese), governor in the name of King Philip II of Spain.",
    "The Archdiocese of Manila is made a diocese by a papal bull with Domingo de Salazar being its first bishop.",
    "Start of the Siege of Maastricht, part of the Eighty Years' War.",
    "Livonian campaign of Stephen Báthory begins.",
    "Our Lady of Kazan, a holy icon of the Russian Orthodox Church, is discovered underground in the city of Kazan, Tatarstan."
  ]
}