{
  "years": [
    452,
    484,
    455,
    456,
    457,
    461,
    467,
    472,
    473,
    474,
    475,
    476
  ],
  "minYear": 452,
  "maxYear": 484,
  "events": [
    "Severianus, Bishop of Scythopolis, is martyred in Palestine.",
    "Attila leads a Hun army in the invasion of Italy, devastating the northern provinces as he heads for Rome.",
    "Sack of Aquileia: After an earlier defeat on the Catalaunian Plains, Attila lays siege to the metropolis of Aquileia and eventually destroys it.",
    "Petronius Maximus becomes, with support of the Roman Senate, emperor of the Western Roman Empire; he forces Licinia Eudoxia, the widow of his predecessor, Valentinian III, to marry him.",
    "Emperor Petronius Maximus is stoned to death by an angry mob while fleeing Rome.",
    "Ricimer defeats Avitus at Piacenza and becomes master of the Western Roman Empire.",
    "Leo I becomes the Eastern Roman emperor.",
    "Majorian is acclaimed as Western Roman emperor.",
    "Roman Emperor Majorian is beheaded near the river Iria in north-west Italy following his arrest and deposition by the magister militum Ricimer.",
    "Libius Severus is declared emperor of the Western Roman Empire. The real power is in the hands of the magister militum Ricimer.",
    "Anthemius is elevated to Emperor of the Western Roman Empire.",
    "After being besieged in Rome by his own generals, Western Roman Emperor Anthemius is captured in St. Peter's Basilica and put to death.",
    "Gundobad (nephew of Ricimer) nominates Glycerius as emperor of the Western Roman Empire.",
    "Seven-year-old Leo II succeeds his maternal grandfather Leo I as Byzantine emperor. He dies ten months later.",
    "Zeno is crowned as co-emperor of the Byzantine Empire.",
    "Julius Nepos forces Roman usurper Glycerius to abdicate the throne and proclaims himself Emperor of the Western Roman Empire.",
    "Byzantine Emperor Zeno is forced to flee his capital at Constantinople, and his general, Basiliscus gains control of the empire.",
    "The Roman general Orestes forces western Roman Emperor Julius Nepos to flee his capital city, Ravenna.",
    "Romulus Augustulus is proclaimed Western Roman Emperor.",
    "Odoacer, chieftain of the Germanic tribes (Herulic - Scirian foederati), is proclaimed rex Italiae (\"King of Italy\") by his troops.",
    "King Huneric of the Vandals replaces Nicene bishops with Arian ones, and banishes some to Corsica.",
    "Leontius, Roman usurper, is crowned Eastern emperor at Tarsus (modern Turkey). He is recognized in Antioch and makes it his capital.",
    "The Arian Vandal Kingdom ceases its persecution of Nicene Christianity.",
    "Alaric II succeeds his father Euric and becomes king of the Visigoths. He establishes his capital at Aire-sur-l'Adour (Southern Gaul)."
  ]
}