{
  "years": [
    1449,
    1450,
    1451,
    1452,
    1453,
    1454,
    1455,
    1456
  ],
  "minYear": 1449,
  "maxYear": 1456,
  "events": [
    "Constantine XI is crowned Byzantine Emperor at Mystras.",
    "Felix V abdicates his claim to the papacy, ending the reign of the final Antipope.",
    "The Battle of Alfarrobeira is fought, establishing the House of Braganza as a principal royal family of Portugal.",
    "Tumu Crisis: The Mongols capture the Emperor of China.",
    "Christian I is crowned king of Denmark.",
    "Battle of Formigny: Toward the end of the Hundred Years' War, the French attack and nearly annihilate English forces, ending English domination in Northern France.",
    "Kentishmen revolt against King Henry VI.",
    "'Abd al-Latif (Timurid monarch) is assassinated.",
    "Louis IX, Duke of Bavaria expels Jews from his jurisdiction.",
    "Sultan Mehmed II inherits the throne of the Ottoman Empire.",
    "Jacques Cœur is arrested by order of Charles VII of France.",
    "Frederick III of Habsburg is the last Holy Roman Emperor crowned by medieval tradition in Rome by Pope Nicholas V",
    "Mehmed II begins his siege of Constantinople. The city falls on May 29, and is renamed Istanbul.",
    "Three Genoese galleys and a Byzantine blockade runner fight their way through an Ottoman blockading fleet a few weeks before the fall of Constantinople.",
    "Fall of Constantinople: Ottoman armies under Sultan Mehmed II Fatih capture Constantinople after a 53-day siege, ending the Byzantine Empire.",
    "Hundred Years' War: Three months after the Battle of Castillon, England loses its last possessions in southern France.",
    "Ladislaus the Posthumous is crowned king of Bohemia in Prague.",
    "The papal bull Romanus Pontifex awards the Kingdom of Portugal exclusive trade and colonization rights to all of Africa south of Cape Bojador.",
    "Thirteen Years' War: The Secret Council of the Prussian Confederation sends a formal act of disobedience to the Grand Master of the Teutonic Knights, sparking the Thirteen Years' War.",
    "The Treaty of Lodi is signed, establishing a balance of power among northern Italian city-states for almost 50 years.",
    "Traditionally the date of publication of the Gutenberg Bible, the first Western book printed with movable type.",
    "Start of the Wars of the Roses: At the First Battle of St Albans, Richard, Duke of York, defeats and captures King Henry VI of England.",
    "Ottoman-Hungarian wars: The Siege of Nándorfehérvár (Belgrade) begins.",
    "A retrial verdict acquits Joan of Arc of heresy 25 years after her death."
  ]
}