{
  "years": [
    1652,
    1653,
    1654,
    1655,
    1656
  ],
  "minYear": 1652,
  "maxYear": 1656,
  "events": [
    "At the Cape of Good Hope, Dutch sailor Jan van Riebeeck establishes a resupply camp that eventually becomes Cape Town.",
    "Slavery in Rhode Island is abolished, although the law is not rigorously enforced.",
    "Tarhoncu Ahmed Pasha is appointed Grand Vizier of the Ottoman Empire.",
    "Battle of Plymouth: Inconclusive naval action between the fleets of Michiel de Ruyter and George Ayscue in the First Anglo-Dutch War.",
    "Defeat at the Battle of Dungeness causes the Commonwealth of England to reform its navy.",
    "By the Coonan Cross Oath, the Eastern Church in India cuts itself off from colonial Portuguese tutelage.",
    "New Amsterdam (later renamed The City of New York) is incorporated.",
    "Oliver Cromwell dissolves the Rump Parliament.",
    "First Anglo-Dutch War: The Battle of the Gabbard begins, lasting until the following day.",
    "English Interregnum: The Protectorate: Oliver Cromwell becomes Lord Protector of the Commonwealth of England, Scotland and Ireland.",
    "Arauco War: A Spanish army is defeated by local Mapuche-Huilliches as it tries to cross Bueno River in Southern Chile.",
    "The Capture of Fort Rocher takes place during the Anglo-Spanish War.",
    "Cromwell's Act of Grace, aimed at reconciliation with the Scots, proclaimed in Edinburgh.",
    "Venetian fleet under Admiral Cort Adeler beats Turkish.",
    "Swedish Queen Christina abdicated her throne in favour of her cousin Charles Gustav and converted to Catholicism.",
    "Louis XIV is crowned King of France.",
    "Jacob Barsimson arrives in New Amsterdam. He is the first known Jewish immigrant to America.",
    "Saturn's largest moon, Titan, is discovered by Christiaan Huygens.",
    "The Siege of Santo Domingo begins during the Anglo-Spanish War, and fails seven days later.",
    "The Invasion of Jamaica begins during the Anglo-Spanish War.",
    "Warsaw falls without resistance to a small force under the command of Charles X Gustav of Sweden during The Deluge, making it the first time the city is captured by a foreign army.",
    "Second Northern War/the Deluge: Monks at the Jasna Góra Monastery in Częstochowa are successful in fending off a month-long siege.",
    "Blaise Pascal publishes the first of his Lettres provinciales.",
    "The Raid on Málaga takes place during the Anglo-Spanish War."
  ]
}