{
  "years": [
    1298,
    1299,
    1300,
    1301,
    1302,
    1303,
    1305,
    1306,
    1307
  ],
  "minYear": 1298,
  "maxYear": 1307,
  "events": [
    "Residents of Riga and Grand Duchy of Lithuania defeated the Livonian Order in the Battle of Turaida.",
    "The Battle of Göllheim is fought between Albert I of Habsburg and Adolf of Nassau-Weilburg.",
    "Wars of Scottish Independence: Battle of Falkirk: King Edward I of England and his longbowmen defeat William Wallace and his Scottish schiltrons outside the town of Falkirk.",
    "According to Edward Gibbon, Osman I invades the territory of Nicomedia for the first time, usually considered to be the founding day of the Ottoman state.",
    "The city of Bilbao is founded.",
    "Andrew III of Hungary dies, ending the Árpád dynasty in Hungary.",
    "Edward of Caernarvon (later king Edward II of England) becomes the first English Prince of Wales.",
    "Dante Alighieri is condemned in absentia and exiled from Florence.",
    "Bruges Matins, the nocturnal massacre of the French garrison in Bruges by members of the local Flemish militia.",
    "Battle of the Golden Spurs (Guldensporenslag in Dutch): A coalition around the Flemish cities defeats the king of France's royal army.",
    "The Byzantine-Venetian War comes to an end.",
    "Pope Boniface VIII issues the Papal bull Unam sanctam, claiming spiritual supremacy for the papacy.",
    "The English are defeated at the Battle of Roslin, in the First War of Scottish Independence.",
    "The Sapienza University of Rome is instituted by a bull of Pope Boniface VIII.",
    "Chittorgarh falls to the Delhi Sultanate, after which thirty thousand Hindu inhabitants are killed.",
    "Guillaume de Nogaret takes Pope Boniface VIII prisoner on behalf of Philip IV of France.",
    "A peace treaty between the Flemish and the French is signed at Athis-sur-Orge.",
    "Sir William Wallace is executed for high treason at Smithfield, London.",
    "In front of the high altar of Greyfriars Church in Dumfries, Robert the Bruce murders John Comyn, sparking the revolution in the Wars of Scottish Independence.",
    "Robert the Bruce becomes King of Scots (Scotland).",
    "The Earl of Pembroke's army defeats Bruce's Scottish army at the Battle of Methven.",
    "Külüg Khan is enthroned as Khagan of the Mongols and Wuzong of the Yuan.",
    "Hundreds of the Knights Templar in France are arrested at dawn by King Philip the Fair, and later confess under torture to heresy.",
    "Pope Clement V issues the papal bull Pastoralis Praeeminentiae which instructed all Christian monarchs in Europe to arrest all Templars and seize their assets."
  ]
}