{
  "years": [
    1916,
    1917,
    1918,
    1919
  ],
  "minYear": 1916,
  "maxYear": 1919,
  "events": [
    "World War I: The Battle of Gallipoli concludes with an Ottoman Empire victory when the last Allied forces are evacuated from the peninsula.",
    "Both Oswald Boelcke and Max Immelmann, for achieving eight aerial victories each over Allied aircraft, receive the German Empire's highest military award, the Pour le Mérite as the first German aviators to earn it.",
    "In Brushaber v. Union Pacific Railroad Co., the Supreme Court of the United States declares the federal income tax constitutional.",
    "The Canadian province of Manitoba grants women the right to vote and run for office in provincial elections (although still excluding women of Indigenous or Asian heritage), marking the first time women in Canada are granted voting rights.",
    "The Centre Block of the Parliament buildings in Ottawa, Ontario, Canada burns down with the loss of seven lives.",
    "The Governor-General of Korea establishes a clinic called Jahyewon in Sorokdo to segregate Hansen's disease patients.",
    "In the Battle of Verdun, a German unit captures Fort Douaumont, keystone of the French defences, without a fight.",
    "The Kingsland munitions factory explosion occurs as a result of sabotage.",
    "The United States pays Denmark $25 million for the Virgin Islands.",
    "American entry into World War I: President Woodrow Wilson of the still-neutral United States calls for \"peace without victory\" in Europe.",
    "Sinking of the SS Laurentic after hitting two German mines off the coast of Northern Ireland.",
    "The current constitution of Mexico is adopted, establishing a federal republic with powers separated into independent executive, legislative, and judicial branches.",
    "The Finnish Declaration of Independence is recognized by Russia, Sweden, Germany and France.",
    "U.S. President Woodrow Wilson announces his \"Fourteen Points\" for the aftermath of World War I.",
    "Battle of Bear Valley: The last battle of the American Indian Wars.",
    "Finnish Civil War: The first serious battles take place between the Red Guards and the White Guard.",
    "The Gregorian calendar is introduced in Russia by decree of the Council of People's Commissars effective February 14 (New Style).",
    "The Ukrainian People's Republic declares independence from Soviet Russia.",
    "Beginning of the Finnish Civil War.",
    "The German Workers' Party, which would become the Nazi Party, is founded in Munich.",
    "Montenegrin guerrilla fighters rebel against the planned annexation of Montenegro by Serbia, but fail.",
    "Rosa Luxemburg and Karl Liebknecht, two of the most prominent socialists in Germany, are tortured and murdered by the Freikorps at the end of the Spartacist uprising.",
    "Nebraska becomes the 36th state to approve the Eighteenth Amendment to the United States Constitution. With the necessary three-quarters of the states approving the amendment, Prohibition is constitutionally mandated in the United States one year later.",
    "Ignacy Jan Paderewski becomes Prime Minister of the newly independent Poland."
  ]
}