{
  "years": [
    1483,
    1484,
    1485,
    1486,
    1487,
    1488,
    1489,
    1490,
    1491,
    1492
  ],
  "minYear": 1483,
  "maxYear": 1492,
  "events": [
    "Gran Canaria, the main island of the Canary Islands, is conquered by the Kingdom of Castile.",
    "Richard III becomes King of England.",
    "Pope Sixtus IV consecrates the Sistine Chapel.",
    "The College of Arms is formally incorporated by Royal Charter signed by King Richard III of England.",
    "William Caxton prints his translation of Aesop's Fables.",
    "Portuguese sea captain Diogo Cão finds the mouth of the Congo River.",
    "Pope Innocent VIII succeeds Pope Sixtus IV.",
    "The Battle of Bosworth Field, the death of Richard III and the end of the House of Plantagenet.",
    "King Henry VII of England marries Elizabeth of York, daughter of Edward IV, uniting the House of Lancaster and the House of York.",
    "Christopher Columbus presents his plans discovering a western route to the Indies to the Spanish Queen Isabella I of Castile.",
    "The Siege of Málaga commences during the Spanish Reconquista.",
    "The ten-year-old Lambert Simnel is crowned in Christ Church Cathedral, Dublin, Ireland, with the name of Edward VI in a bid to threaten King Henry VII's reign.",
    "Battle of Stoke Field: King Henry VII of England defeats the leaders of a Yorkist rebellion in the final engagement of the Wars of the Roses.",
    "Citizens of Leeuwarden, Netherlands, strike against a ban on foreign beer.",
    "Elizabeth of York is crowned Queen of England.",
    "Bartolomeu Dias of Portugal lands in Mossel Bay after rounding the Cape of Good Hope, becoming the first known European to travel so far south.",
    "Anne becomes sovereign Duchess of Brittany, becoming a central figure in the struggle for influence that leads to the union of Brittany and France.",
    "The forces of the Catholic Monarchs, Ferdinand and Isabella, take control of Almería from the Nasrid ruler of Granada, Muhammad XIII.",
    "Anne, Duchess of Brittany, is married to Maximilian I, Holy Roman Emperor by proxy.",
    "Kongo monarch Nkuwu Nzinga is baptised by Portuguese missionaries, adopting the baptismal name of João I.",
    "An auto-da-fé, held in the Brasero de la Dehesa outside of Ávila, concludes the case of the Holy Child of La Guardia with the public execution of several Jewish and converso suspects.",
    "The siege of Granada, the last Moorish stronghold in Spain, ends with the Treaty of Granada.",
    "Reconquista: The Emirate of Granada, the last Moorish stronghold in Spain, surrenders.",
    "The Catholic Monarchs Ferdinand and Isabella enter Granada at the conclusion of the Granada War."
  ]
}