{
  "years": [
    1281,
    1282,
    1283,
    1284,
    1285,
    1287,
    1288,
    1291,
    1277,
    1278,
    1279
  ],
  "minYear": 1277,
  "maxYear": 1291,
  "events": [
    "The University of Paris issues the last in a series of condemnations of various philosophical and theological theses.",
    "The Treaty of Aberconwy, a humiliating settlement forced on Llywelyn ap Gruffudd by King Edward I of England, brings a temporary end to the Welsh Wars.",
    "The naval Battle of Algeciras takes place in the context of the Spanish Reconquista resulting in a victory for the Emirate of Granada and the Maranid Dynasty over the Kingdom of Castile.",
    "Spanish Reconquista: the forces of the Kingdom of Castile initiate the ultimately futile Siege of Algeciras against the Emirate of Granada.",
    "Ladislaus IV of Hungary and Rudolf I of Germany defeat Ottokar II of Bohemia in the Battle on the Marchfeld near Dürnkrut in (then) Moravia.",
    "Trần Thánh Tông, the second emperor of the Trần dynasty, decides to pass the throne to his crown prince Trần Khâm and take up the post of Retired Emperor.",
    "The Livonian Order is defeated in the Battle of Aizkraukle by the Grand Duchy of Lithuania.",
    "A Mongol victory at the Battle of Yamen ends the Song dynasty in China.",
    "The Nichiren Shōshū branch of Buddhism is founded in Japan.",
    "Mongol invasion of Japan: The Mongolian fleet of Kublai Khan is destroyed by a \"divine wind\" for the second time in the Battle of Kōan.",
    "The people of Sicily rebel against the Angevin king Charles I, in what becomes known as the Sicilian Vespers.",
    "Peter III of Aragon lands at Trapani to intervene in the War of the Sicilian Vespers.",
    "Pope Martin IV excommunicates King Peter III of Aragon.",
    "Battle of Orewin Bridge: Llywelyn ap Gruffudd, the last native Prince of Wales, is killed at Cilmeri, near Builth Wells, in mid-Wales.",
    "Roger of Lauria, commanding the Aragonese fleet, defeats an Angevin fleet sent to put down a rebellion on Malta.",
    "The Statute of Rhuddlan incorporates the Principality of Wales into England.",
    "The Republic of Pisa is defeated in the Battle of Meloria by the Republic of Genoa, thus losing its naval dominance in the Mediterranean.",
    "Second Mongol invasion of Vietnam: Forces led by Prince Trần Quang Khải of the Trần dynasty destroy most of the invading Mongol naval fleet in a battle at Chuong Duong.",
    "King Wareru founds the Hanthawaddy Kingdom, and proclaims independence from the Pagan Kingdom.",
    "Kublai Khan defeats the force of Nayan and other traditionalist Borjigin princes in East Mongolia and Manchuria.",
    "The Battle of Worringen ends the War of the Limburg Succession, with John I, Duke of Brabant, being one of the more important victors.",
    "Scottish nobles recognize the authority of Edward I of England pending the selection of a king.",
    "Fall of Acre, the end of Crusader presence in the Holy Land.",
    "The Old Swiss Confederacy is formed with the signature of the Federal Charter."
  ]
}