{
  "years": [
    1356,
    1357,
    1358,
    1359,
    1360,
    1361,
    1362,
    1363,
    1364,
    1365,
    1367,
    1368,
    1370,
    1371
  ],
  "minYear": 1356,
  "maxYear": 1371,
  "events": [
    "Edward Balliol surrenders his claim to the Scottish throne to Edward III in exchange for an English pension.",
    "Battle of Poitiers: An English army under the command of Edward, the Black Prince defeats a French army and captures King John II.",
    "Basel earthquake, the most significant historic seismological event north of the Alps, destroys the town of Basel, Switzerland.",
    "Emperor Charles IV assists in laying the foundation stone of Charles Bridge in Prague.",
    "The Republic of Ragusa is founded.",
    "Francesco II Ordelaffi of Forlì surrenders to the Papal commander Gil de Albornoz.",
    "Peter I of Cyprus ascends the throne of Cyprus after his father, Hugh IV of Cyprus, abdicates.",
    "Treaty of Brétigny drafted between King Edward III of England and King John II of France (the Good).",
    "The Treaty of Brétigny is ratified, marking the end of the first phase of the Hundred Years' War.",
    "The Battle of Linuesa is fought in the context of the Spanish Reconquista between the forces of the Emirate of Granada and the combined army of the Kingdom of Castile and of Jaén resulting in a Castilian victory.",
    "Kaunas Castle falls to the Teutonic Order after a month-long siege.",
    "The five-week Battle of Lake Poyang begins, in which the forces of two Chinese rebel leaders (Chen Youliang and Zhu Yuanzhang) meet to decide who will supplant the Yuan dynasty.",
    "Jagiellonian University, the oldest university in Poland, is founded in Kraków.",
    "Troops of the Republic of Pisa and the Republic of Florence clash in the Battle of Cascina.",
    "Hundred Years' War: English forces defeat the French in Brittany, ending the War of the Breton Succession.",
    "Albert III of Mecklenburg (King Albert of Sweden) grants city rights to Ulvila (Swedish: Ulvsby).",
    "The Ava Kingdom and the royal city of Ava (Inwa) founded by King Thado Minbya.",
    "Swa Saw Ke becomes king of Ava",
    "In a coronation ceremony, Zhu Yuanzhang ascends the throne of China as the Hongwu Emperor, initiating Ming dynasty rule over China that would last for three centuries.",
    "Northern Crusades: Grand Duchy of Lithuania and the Teutonic Knights meet in the Battle of Rudau.",
    "Brussels massacre: Between six and twenty Jews are murdered and the rest of the Jewish community is banished from Brussels, Belgium, for allegedly desecrating consecrated Host.",
    "Charles IV, Holy Roman Emperor, grants city privileges to Karlovy Vary.",
    "Robert II becomes King of Scotland, beginning the Stuart dynasty.",
    "Serbian-Turkish wars: Ottoman Turks fought against a Serbian army at the Battle of Maritsa."
  ]
}