{
  "years": [
    2001,
    2002,
    2003,
    2004,
    2005
  ],
  "minYear": 2001,
  "maxYear": 2005,
  "events": [
    "Downtown Disney opens to the public as part of the Disneyland Resort in Anaheim, California.",
    "Wikipedia, a free wiki content encyclopedia, goes online.",
    "Second Congo War: Congolese President Laurent-Désiré Kabila is assassinated by one of his own bodyguards in Kinshasa.",
    "US President Bill Clinton awards former President Theodore Roosevelt a posthumous Medal of Honor for his service in the Spanish-American War.",
    "President of the Philippines Joseph Estrada is ousted in a nonviolent four-day revolution, and is succeeded by Gloria Macapagal Arroyo.",
    "Five people attempt to set themselves on fire in Beijing's Tiananmen Square, an act that many people later claim is staged by the Communist Party of China to frame Falun Gong and thus escalate their persecution.",
    "Thousands of student protesters in Indonesia storm parliament and demand that President Abdurrahman Wahid resign due to alleged involvement in corruption scandals.",
    "Israeli-Palestinian conflict: Israeli forces seize the Palestinian freighter Karine A in the Red Sea, finding 50 tons of weapons.",
    "War in Afghanistan: The UN Security Council unanimously establishes an arms embargo and the freezing of assets of Osama bin Laden, al-Qaeda, and the remaining members of the Taliban.",
    "The Sierra Leone Civil War is declared over.",
    "Kmart becomes the largest retailer in United States history to file for Chapter 11 bankruptcy protection.",
    "U.S. journalist Daniel Pearl is kidnapped in Karachi, Pakistan and subsequently murdered.",
    "In his State of the Union address, President George W. Bush describes \"regimes that sponsor terror\" as an Axis of evil, in which he includes Iraq, Iran and North Korea.",
    "A very weak signal from Pioneer 10 is detected for the last time, but no usable data can be extracted.",
    "The United States Department of Homeland Security officially begins operation.",
    "Invasion of Iraq: A group of people leave London, England, for Baghdad, Iraq, to serve as human shields, intending to prevent the U.S.-led coalition troops from bombing certain locations.",
    "The first selections for the National Recording Registry are announced by the Library of Congress.",
    "Stardust successfully flies past Comet Wild 2, collecting samples that are returned to Earth.",
    "Spirit, a NASA Mars rover, lands successfully on Mars at 04:35 UTC.",
    "The RMS Queen Mary 2, then the largest ocean liner ever built, is christened by her namesake's granddaughter, Queen Elizabeth II.",
    "The world's largest ocean liner, RMS Queen Mary 2, makes its maiden voyage.",
    "NASA's MER-A (the Mars Rover Spirit) ceases communication with mission control. The problem lies in the management of its flash memory and is fixed remotely from Earth on February 6.",
    "The dwarf planet Eris is discovered by Palomar Observatory-based astronomers, later motivating the International Astronomical Union (IAU) to define the term planet for the first time.",
    "A train collision in Graniteville, South Carolina, United States, releases about 60 tons of chlorine gas."
  ]
}