{
  "years": [
    1690,
    1691,
    1692,
    1693,
    1694,
    1695
  ],
  "minYear": 1690,
  "maxYear": 1695,
  "events": [
    "The colony of Massachusetts issues the first paper money in the Americas.",
    "Constantin Cantemir, Prince of Moldavia, and the Holy Roman Empire sign a secret treaty in Sibiu, stipulating that Moldavia would support the actions led by the House of Habsburg against the Ottoman Empire.",
    "King William III of England (William of Orange) lands in Ireland to confront the former King James II.",
    "Glorious Revolution: Battle of the Boyne in Ireland (as reckoned under the Julian calendar).",
    "Publick Occurrences Both Forreign and Domestick, the first newspaper to appear in the Americas, is published for the first and only time.",
    "Battle of Aughrim (Julian calendar): The decisive victory of William III of England's forces in Ireland.",
    "The charter for the Province of Massachusetts Bay is issued.",
    "Massacre of Glencoe: Almost 80 Macdonalds at Glen Coe, Scotland are killed early in the morning for not promptly pledging allegiance to the new king, William of Orange.",
    "Sarah Good, Sarah Osborne and Tituba are brought before local magistrates in Salem Village, Massachusetts, beginning what would become known as the Salem witch trials.",
    "Bridget Bishop is the first person to be tried for witchcraft in Salem, Massachusetts; she was found guilty and later hanged.",
    "Salem witch trials: Bridget Bishop is hanged at Gallows Hill near Salem, Massachusetts, for \"certaine Detestable Arts called Witchcraft and Sorceries\".",
    "The last hanging of those convicted of witchcraft in the Salem witch trials; others are all eventually released.",
    "The Salem witch trials are ended by a letter from Province of Massachusetts Bay Governor William Phips.",
    "A powerful earthquake destroys parts of Sicily and Malta.",
    "The College of William & Mary in Williamsburg, Virginia, America, is granted a charter by King William III and Queen Mary II.",
    "Ignacio de Maya founds the Real Santiago de las Sabinas, now known as Sabinas Hidalgo, Nuevo León, Mexico.",
    "War of the Grand Alliance: Battle of Landen: France wins a Pyrrhic victory over Allied forces in the Netherlands.",
    "Date traditionally ascribed to Dom Perignon's invention of champagne; it is not clear whether he actually invented champagne, however he has been credited as an innovator who developed the techniques used to perfect sparkling wine.",
    "Nine Years' War: Piedmontese troops are defeated by the French.",
    "The warrior queen Dandara, leader of the runaway slaves in Quilombo dos Palmares, Brazil, is captured and commits suicide rather than be returned to a life of slavery.",
    "A Royal charter is granted to the Bank of England.",
    "French forces end the bombardment of Brussels.",
    "Henry Every perpetrates one of the most profitable pirate raids in history with the capture of the Grand Mughal ship Ganj-i-Sawai. In response, Emperor Aurangzeb threatens to end all English trading in India.",
    "Zumbi, the last of the leaders of Quilombo dos Palmares in early Brazil, is executed by the forces of Portuguese bandeirante Domingos Jorge Velho."
  ]
}