{
  "years": [
    1931,
    1932,
    1933,
    1934
  ],
  "minYear": 1931,
  "maxYear": 1934,
  "events": [
    "Guy Menzies flies the first solo non-stop trans-Tasman flight (from Australia to New Zealand) in 11 hours and 45 minutes, crash-landing on New Zealand's west coast.",
    "Sir Isaac Isaacs is sworn in as the first Australian-born Governor-General of Australia.",
    "The British Raj completes its transfer from Calcutta to New Delhi.",
    "The U.S. Congress approves the construction of the San Francisco-Oakland Bay Bridge by the state of California.",
    "An anarchist uprising in Encarnación briefly transforms the city into a revolutionary commune.",
    "The United States adopts The Star-Spangled Banner as its national anthem.",
    "The Parliament House of Finland was officially inaugurated in Helsinki, Finland.",
    "Alam Ara, India's first talking film, is released.",
    "Hattie Caraway becomes the first woman elected to the United States Senate.",
    "Finland and the Soviet Union sign a non-aggression treaty.",
    "Second Sino-Japanese War: The Chinese National Revolutionary Army begins the defense of Harbin.",
    "Japanese forces attack Shanghai.",
    "Prohibition law is abolished in Finland after a national referendum, where 70% voted for a repeal of the law.",
    "The Empire of Japan creates the independent state of Manzhouguo (the obsolete Chinese name for Manchuria) free from the Republic of China and installed former Chinese Emperor Aisin Gioro Puyi as Chief Executive of the State.",
    "Aviator Charles Lindbergh's 20-month-old son Charles Jr is kidnapped from his home in East Amwell, New Jersey. His body would not be found until May 12.",
    "Minnie D. Craig becomes the first woman elected as Speaker of the North Dakota House of Representatives, the first woman to hold a Speaker position anywhere in the United States.",
    "Construction of the Golden Gate Bridge begins in San Francisco Bay.",
    "The 20th Amendment to the United States Constitution is ratified, changing the beginning and end of terms for all elected federal offices.",
    "The name Pakistan is coined by Choudhry Rahmat Ali Khan and is accepted by Indian Muslims who then thereby adopted it further for the Pakistan Movement seeking independence.",
    "Adolf Hitler's rise to power: Hitler takes office as the Chancellor of Germany.",
    "Mutiny on Royal Netherlands Navy warship HNLMS De Zeven Provinciën off the coast of Sumatra, Dutch East Indies.",
    "In round 13 of a boxing match at New York City's Madison Square Garden, Primo Carnera knocks out Ernie Schaaf. Schaaf dies four days later.",
    "In Miami, Giuseppe Zangara attempts to assassinate US President-elect Franklin D. Roosevelt, but instead shoots Chicago mayor Anton J. Cermak, who dies of his wounds on March 6.",
    "Alcatraz Island in San Francisco Bay becomes a United States federal prison."
  ]
}