{
  "years": [
    993,
    994,
    963,
    995,
    965,
    966,
    996,
    998,
    969,
    1000,
    971,
    972,
    980,
    982,
    986,
    987,
    988
  ],
  "minYear": 963,
  "maxYear": 1000,
  "events": [
    "The Byzantine army proclaims Nikephoros II Phokas Emperor of the Romans on the plains outside Cappadocian Caesarea.",
    "Nikephoros II Phokas is crowned emperor of the Byzantine Empire.",
    "Synod of Rome: Emperor Otto I calls a council at St. Peter's Basilica in Rome. Pope John XII is deposed on charges of an armed rebellion against Otto.",
    "Pope Leo VIII is appointed to the office of Protonotary and begins his papacy as antipope of Rome.",
    "Pope John XIII is consecrated.",
    "After his marriage to the Christian Doubravka of Bohemia, the pagan ruler of the Polans, Mieszko I, converts to Christianity, an event considered to be the founding of the Polish state.",
    "The Fatimid general Jawhar leads the Friday prayer in Fustat in the name of Caliph al-Mu'izz li-Din Allah, thereby symbolically completing the Fatimid conquest of Egypt.",
    "Byzantine Emperor Nikephoros II Phokas is assassinated by his wife Theophano and her lover, the later Emperor John I Tzimiskes.",
    "Using crossbows, Song dynasty troops soundly defeat a war elephant corps of the Southern Han at Shao.",
    "Co-Emperor Otto II, a son of Otto I (the Great), marries the Byzantine princess Theophanu. She is crowned empress by Pope John XIII at Rome.",
    "Battle of Cedynia, the first documented victory of Polish forces, takes place.",
    "Vladimir the Great consolidates the Kievan realm from Ukraine to the Baltic Sea. He is proclaimed ruler (knyaz) of all Kievan Rus'.",
    "King Otto II and his Frankish army were defeated by the Muslim army of al-Qasim at Cape Colonna, Southern Italy.",
    "Holy Roman Emperor Otto II is defeated by the Saracens in the Battle of Capo Colonna, in Calabria.",
    "Louis V becomes the last Carolingian king of West Francia after the death of his father, Lothaire.",
    "Bardas Phokas the Younger and Bardas Skleros, Byzantine generals of the military elite, begin a wide-scale rebellion against Emperor Basil II.",
    "The Norse King Glúniairn recognises Máel Sechnaill mac Domnaill, High King of Ireland, and agrees to pay taxes and accept Brehon Law; the event is considered to be the founding of the city of Dublin.",
    "Ulrich of Augsburg is canonized as a saint.",
    "Major Fatimid victory over the Byzantine Empire at the Battle of the Orontes.",
    "Boleslaus II, Duke of Bohemia, kills most members of the rival Slavník dynasty.",
    "Sixteen-year-old Otto III is crowned Holy Roman Emperor.",
    "Emperor Otto III issues a deed to Gottschalk, Bishop of Freising, which is the oldest known document using the name Ostarrîchi (Austria in Old High German).",
    "Arab-Byzantine wars: Battle of Apamea: Fatimids defeat a Byzantine army near Apamea.",
    "Fatimid caliph al-Hakim bi-Amr Allah assassinates the eunuch chief minister Barjawan and assumes control of the government."
  ]
}