{
  "years": [
    1621,
    1622,
    1623,
    1624,
    1625,
    1626
  ],
  "minYear": 1621,
  "maxYear": 1626,
  "events": [
    "Gregory XV becomes Pope, the last Pope elected by acclamation.",
    "Myles Standish is appointed as first military commander of the English Plymouth Colony in North America.",
    "Samoset, a Mohegan, visits the settlers of Plymouth Colony and greets them, \"Welcome, Englishmen! My name is Samoset.\"",
    "The Pilgrims of Plymouth Colony sign a peace treaty with Massasoit of the Wampanoags.",
    "The Mayflower sets sail from Plymouth, Massachusetts on a return trip to England.",
    "The Protestant Union is formally dissolved.",
    "The Dutch West India Company receives a charter for New Netherland.",
    "Execution of 27 Czech noblemen on the Old Town Square in Prague as a consequence of the Battle of White Mountain.",
    "Ignatius of Loyola and Francis Xavier, founders of the Society of Jesus, are canonized by the Roman Catholic Church.",
    "The Capture of Ormuz by the East India Company ends Portuguese control of Hormuz Island.",
    "Battle of Macau: The Dutch make a failed attempt to capture Macau.",
    "Portuguese forces score a military victory over the Kingdom of Kongo at the Battle of Mbumbi in present-day Angola.",
    "The Plymouth Colony establishes the system of trial by 12-men jury in the American colonies.",
    "Sir Thomas Warner founds the first British colony in the Caribbean, on the island of Saint Kitts.",
    "French king Louis XIII names Cardinal Richelieu chief minister of France.",
    "Signing of the Treaty of Compiègne between France and the Netherlands.",
    "Charles de La Vieuville is arrested and replaced by Cardinal Richelieu as the French king's chief advisor.",
    "The French king Louis XIII appoints Cardinal Richelieu as prime minister.",
    "A combined Spanish and Portuguese fleet of 52 ships commences the recapture of Bahia from the Dutch during the Dutch-Portuguese War.",
    "Afonso Mendes, appointed by Pope Gregory XV as Latin Patriarch of Ethiopia, arrives at Beilul from Goa.",
    "King Charles I of England marries Catholic princess Henrietta Maria of France and Navarre, at Canterbury.",
    "Yuan Chonghuan is appointed Governor of Liaodong, after leading the Chinese into a great victory against the Manchurians under Nurhaci.",
    "Dutch explorer Peter Minuit arrives in New Netherland (present day Manhattan Island) aboard the See Meeuw.",
    "Peter Minuit buys Manhattan."
  ]
}