{
  "years": [
    1755,
    1756,
    1757,
    1758,
    1759
  ],
  "minYear": 1755,
  "maxYear": 1759,
  "events": [
    "Moscow University is established on Tatiana Day.",
    "Treaty of Giyanti signed by VOC, Pakubuwono III and Prince Mangkubumi. The treaty divides the Javanese kingdom of Mataram into two: Sunanate of Surakarta and Sultanate of Yogyakarta.",
    "Commodore William James captures the Maratha fortress of Suvarnadurg on the west coast of India.",
    "Samuel Johnson's A Dictionary of the English Language is published in London.",
    "French and Indian War: The French surrender Fort Beauséjour to the British, leading to the expulsion of the Acadians.",
    "The Braddock Expedition is soundly defeated by a smaller French and Native American force in its attempt to capture Fort Duquesne in what is now downtown Pittsburgh.",
    "British governor Charles Lawrence and the Nova Scotia Council order the deportation of the Acadians.",
    "Under the direction of Charles Lawrence, the British begin to forcibly deport the Acadians from Nova Scotia to the Thirteen Colonies and France.",
    "Guaraní War: The leader of the Guaraní rebels, Sepé Tiaraju, is killed in a skirmish with Spanish and Portuguese troops.",
    "Seven Years' War formally begins when Great Britain declares war on France",
    "The Seven Years' War begins when Great Britain declares war on France.",
    "A British garrison is imprisoned in the Black Hole of Calcutta.",
    "In Saint Petersburg, Bartolomeo Rastrelli presents the newly built Catherine Palace to Empress Elizabeth and her courtiers.",
    "Frederick the Great attacks Saxony, beginning the Seven Years' War in Europe.",
    "Louis XV of France survives an assassination attempt by Robert-François Damiens, the last person to be executed in France by drawing and quartering, the traditional form of capital punishment used for regicides.",
    "Admiral Sir John Byng is executed by firing squad aboard HMS Monarch for breach of the Articles of War.",
    "Battle of Prague: A Prussian army fights an Austrian army in Prague during the Seven Years' War.",
    "English poet Christopher Smart is admitted into St Luke's Hospital for Lunatics in London, beginning his six-year confinement to mental asylums.",
    "The city of Macapá in Brazil is founded by Sebastião Veiga Cabral.",
    "The Marathas defeat the Afghans in the Battle of Attock and capture the city.",
    "Ten-year-old Mary Campbell is abducted in Pennsylvania by Lenape during the French and Indian War. She is returned six and a half years later.",
    "French forces hold Fort Carillon against the British at Ticonderoga, New York.",
    "The first American life insurance company, the Corporation for Relief of Poor and Distressed Presbyterian Ministers and of the Poor and Distressed Widows and Children of the Presbyterian Ministers (now part of Unum Group), is incorporated in Philadelphia, Pennsylvania.",
    "The British Museum opens to the public."
  ]
}