{
  "years": [
    1152,
    1153,
    1154,
    1140,
    1141,
    1142,
    1143,
    1144,
    1145,
    1146,
    1147,
    1148,
    1149
  ],
  "minYear": 1140,
  "maxYear": 1154,
  "events": [
    "The French scholar Peter Abelard is found guilty of heresy.",
    "Song dynasty general Yue Fei defeats an army led by Jin dynasty general Wuzhu at the Battle of Yancheng during the Jin-Song Wars.",
    "After a siege of several weeks, the city of Weinsberg and its castle surrender to Conrad III of Germany.",
    "The Battle of Lincoln, at which Stephen, King of England is defeated and captured by the allies of Empress Matilda.",
    "Empress Matilda becomes the first female ruler of England, adopting the title 'Lady of the English'.",
    "Yelü Dashi, the Liao dynasty general who founded the Qara Khitai, defeats the Seljuq and Kara-Khanid forces at the Battle of Qatwan.",
    "A peace treaty ends the Jin-Song wars.",
    "With the signing of the Treaty of Zamora, King Alfonso VII of León and Castile recognises Portugal as a Kingdom.",
    "The capital of the crusader County of Edessa falls to Imad ad-Din Zengi, the atabeg of Mosul and Aleppo.",
    "The main altar of Lund Cathedral, at the time seat of the archiepiscopal see of all the Nordic countries, is consecrated.",
    "Bernard of Clairvaux preaches his famous sermon in a field at Vézelay, urging the necessity of a Second Crusade. Louis VII is present, and joins the Crusade.",
    "Seljuk Turks defeat German crusaders under Conrad III at the Battle of Dorylaeum.",
    "Reconquista: After a siege of four months, crusader knights reconquer Lisbon.",
    "Louis VII of France lays siege to Damascus during the Second Crusade.",
    "The Siege of Damascus ends in a decisive crusader defeat and leads to the disintegration of the Second Crusade.",
    "Pope Eugene III takes refuge in the castle of Ptolemy II of Tusculum.",
    "Raymond of Poitiers is defeated and killed at the Battle of Inab by Nur ad-Din Zangi.",
    "The reconstructed Church of the Holy Sepulchre is consecrated in Jerusalem.",
    "Frederick I Barbarossa is elected King of Germany.",
    "Annulment of the marriage of King Louis VII of France and Queen Eleanor of Aquitaine.",
    "The future Henry II of England marries Eleanor of Aquitaine. He would become king two years later, after the death of his cousin once removed King Stephen of England.",
    "Malcolm IV becomes King of Scotland.",
    "Baldwin III of Jerusalem takes control of the Kingdom of Jerusalem from his mother Melisende, and also captures Ascalon.",
    "Henry II of England is crowned at Westminster Abbey."
  ]
}