{
  "years": [
    1995,
    1996,
    1997,
    1998
  ],
  "minYear": 1995,
  "maxYear": 1998,
  "events": [
    "The World Trade Organization comes into being.",
    "The Draupner wave in the North Sea in Norway is detected, confirming the existence of freak waves.",
    "Austria, Finland and Sweden join the EU.",
    "A chemical fire in an apartment complex in Manila, Philippines, leads to the discovery of plans for Project Bojinka, a mass-terrorist attack.",
    "An avalanche hits the Icelandic village Súðavík, destroying 25 homes and burying 26 people, 14 of whom died.",
    "After being struck by lightning the crew of Bristow Helicopters Flight 56C are forced to ditch. All 18 aboard are later rescued.",
    "The Norwegian rocket incident: Russia almost launches a nuclear attack after it mistakes Black Brant XII, a Norwegian research rocket, for a US Trident missile.",
    "Hydroxycarbamide becomes the first approved preventive treatment for sickle cell disease.",
    "First Chechen War: Chechen separatists launch a raid against the helicopter airfield and later a civilian hospital in the city of Kizlyar in the neighboring Dagestan, which turns into a massive hostage crisis involving thousands of civilians.",
    "The Czech Republic applies for membership in the European Union.",
    "The barge North Cape oil spill occurs as an engine fire forces the tugboat Scandia ashore on Moonstone Beach in South Kingstown, Rhode Island.",
    "Billy Bailey becomes the last person to be hanged in the United States.",
    "In a military coup, Colonel Ibrahim Baré Maïnassara deposes the first democratically elected president of Niger, Mahamane Ousmane.",
    "Germany first observes the International Holocaust Remembrance Day.",
    "President Jacques Chirac announces a \"definitive end\" to French nuclear weapons testing.",
    "The Communications Decency Act is passed by the U.S. Congress.",
    "Space Shuttle program: Atlantis launches from the Kennedy Space Center on mission STS-81 to the Russian space station Mir, carrying astronaut Jerry M. Linenger for a four-month stay on board the station, replacing astronaut John E. Blaha.",
    "Yasser Arafat returns to Hebron after more than 30 years and joins celebrations over the handover of the last Israeli-controlled West Bank city.",
    "Madeleine Albright becomes the first woman to serve as United States Secretary of State.",
    "The so-called Big Three banks in Switzerland announce the creation of a $71 million fund to aid Holocaust survivors and their families.",
    "Following a currency reform, Russia begins to circulate new rubles to stem inflation and promote confidence.",
    "A massive ice storm hits eastern Canada and the northeastern United States, continuing through January 10 and causing widespread destruction.",
    "Nineteen European nations agree to forbid human cloning.",
    "Alfredo Ormando sets himself on fire in St. Peter's Square, protesting against homophobia."
  ]
}