{
  "years": [
    1968,
    1969,
    1970,
    1967
  ],
  "minYear": 1967,
  "maxYear": 1970,
  "events": [
    "Ronald Reagan, past movie actor and future President of the United States, is sworn in as Governor of California.",
    "Cultural Revolution: The Shanghai People's Commune is established following the seizure of power from local city officials by revolutionaries.",
    "Vietnam War: United States Marine Corps and ARVN troops launch \"Operation Deckhouse Five\" in the Mekong River delta.",
    "Dr. James Bedford becomes the first person to be cryonically preserved with intent of future resuscitation.",
    "Counterculture of the 1960s: The Human Be-In takes place in San Francisco, California's Golden Gate Park, launching the Summer of Love.",
    "The first Super Bowl is played in Los Angeles. The Green Bay Packers defeat the Kansas City Chiefs 35-10.",
    "Albert DeSalvo, the \"Boston Strangler\", is convicted of numerous crimes and is sentenced to life imprisonment.",
    "Between dozens and hundreds of anti-Somocista demonstrators are killed by the Nicaraguan National Guard in Managua.",
    "Diplomatic relations between the Soviet Union and Ivory Coast are established.",
    "Alexander Dubček comes to power in Czechoslovakia, effectively beginning the \"Prague Spring\".",
    "Surveyor Program: Surveyor 7, the last spacecraft in the Surveyor series, lifts off from launch complex 36A, Cape Canaveral.",
    "Johnny Cash performs live at Folsom State Prison.",
    "A B-52 bomber crashes near Thule Air Base, contaminating the area after its nuclear payload ruptures. One of the four bombs remains unaccounted for after the cleanup operation is complete.",
    "Apollo 5 lifts off carrying the first Lunar module into space.",
    "Operation Igloo White, a US electronic surveillance system to stop communist infiltration into South Vietnam begins installation.",
    "USS Pueblo (AGER-2) is attacked and seized by the Korean People's Navy.",
    "The Venera 5 space probe is launched at 06:28:08 UTC from Baikonur.",
    "The New York Jets of the American Football League defeat the Baltimore Colts of the National Football League to win Super Bowl III in what is considered to be one of the greatest upsets in sports history.",
    "USS Enterprise fire: An accidental explosion aboard the USS Enterprise near Hawaii kills 28 people.",
    "The Soviet Union launches Soyuz 5.",
    "Czech student Jan Palach commits suicide by self-immolation in Prague, Czechoslovakia, in protest against the Soviets' crushing of the Prague Spring the year before.",
    "Space Race: Soviet spacecraft Soyuz 4 and Soyuz 5 perform the first-ever docking of manned spacecraft in orbit, the first-ever transfer of crew from one space vehicle to another, and the only time such a transfer was accomplished with a space walk.",
    "Black Panther Party members Bunchy Carter and John Huggins are killed during a meeting in Campbell Hall on the campus of UCLA.",
    "The defined beginning of Unix time, at 00:00:00."
  ]
}