{
  "years": [
    1632,
    1633,
    1634,
    1635,
    1629,
    1630,
    1631
  ],
  "minYear": 1629,
  "maxYear": 1635,
  "events": [
    "Charles I dissolves the Parliament of England, beginning the eleven-year period known as the Personal Rule.",
    "Holy Roman Emperor Ferdinand II and Danish King Christian IV sign the Treaty of Lübeck ending Danish intervention in the Thirty Years' War.",
    "Dutch forces led by Hendrick Lonck capture Olinda in what was to become part of Dutch Brazil.",
    "Thirty Years' War: Four thousand Swedish troops under Gustavus Adolphus land in Pomerania, Germany.",
    "Portuguese forces are defeated by the Kingdom of Kandy at the Battle of Randeniwela in Sri Lanka.",
    "The city of Boston, Massachusetts is founded.",
    "Frendraught Castle in Scotland, the home of James Crichton of Frendraught, burns down.",
    "The Massachusetts Bay Colony outlaws the possession of cards, dice, and gaming tables.",
    "In Dorchester, Massachusetts, John Winthrop takes the oath of office and becomes the first Governor of Massachusetts.",
    "Publication of Gazette de France, the first French newspaper.",
    "Mumtaz Mahal dies during childbirth. Her husband, Mughal emperor Shah Jahan I, will spend the next 17 years building her mausoleum, the Taj Mahal.",
    "The Sack of Baltimore: The Irish village of Baltimore is attacked by Algerian pirates.",
    "Sweden wins a major victory at the Battle of Breitenfeld against the Holy Roman Empire during the Thirty Years' War.",
    "Ferdinando II de' Medici, Grand Duke of Tuscany, the dedicatee, receives the first printed copy of Galileo's Dialogue Concerning the Two Chief World Systems .",
    "Battle of Rain: Swedes under Gustavus Adolphus defeat the Holy Roman Empire during the Thirty Years' War.",
    "The University of Tartu was founded.",
    "Three hundred colonists bound for New France depart from Dieppe, France.",
    "Galileo Galilei arrives in Rome for his trial before the Inquisition.",
    "Samuel de Champlain reclaims his role as commander of New France on behalf of Cardinal Richelieu.",
    "The Holy Office in Rome forces Galileo Galilei to recant his view that the Sun, not the Earth, is the center of the Universe in the form he presented it in, after heated controversy.",
    "The Ming dynasty defeats the Dutch East India Company.",
    "Urbain Grandier, accused and convicted of sorcery, is burned alive in Loudun, France.",
    "Following pressure from Anglican bishop John Atherton, the Irish House of Commons passes An Act for the Punishment for the Vice of Buggery.",
    "The first public school in the United States, Boston Latin School, is founded in Boston."
  ]
}