{
  "years": [
    610,
    613,
    614,
    615,
    617,
    618,
    619,
    632,
    622,
    624,
    626,
    627,
    628,
    629,
    598,
    599,
    630,
    602
  ],
  "minYear": 598,
  "maxYear": 632,
  "events": [
    "Balkan Campaign: The Avars lift the siege at the Byzantine stronghold of Tomis. Their leader Bayan I retreats north of the Danube River after the Avaro-Slavic hordes are decimated by the plague.",
    "Goguryeo-Sui War: Emperor Wéndi of Sui orders his youngest son, Yang Liang (assisted by the co-prime minister Gao Jiong), to conquer Goguryeo (Korea) during the Manchurian rainy season, with a Chinese army and navy.",
    "Maya king Uneh Chan of Calakmul attacks rival city-state Palenque in southern Mexico, defeating queen Yohl Ik'nal and sacking the city.",
    "Byzantine Emperor Maurice is forced to watch as the usurper Phocas executes his five sons before Maurice is beheaded himself.",
    "Heraclius arrives at Constantinople, kills Byzantine Emperor Phocas, and becomes emperor.",
    "Eight-month-old Constantine is crowned as co-emperor (Caesar) by his father Heraclius at Constantinople.",
    "King Chlothar II promulgates the Edict of Paris (Edictum Chlotacharii), a sort of Frankish Magna Carta that defends the rights of the Frankish nobles while it excludes Jews from all civil employment in the Frankish Kingdom.",
    "Pakal ascends the throne of Palenque at the age of 12.",
    "Battle of Huoyi: Li Yuan defeats a Sui dynasty army, opening the path to his capture of the imperial capital Chang'an and the eventual establishment of the Tang dynasty.",
    "Li Yuan becomes Emperor Gaozu of Tang, initiating three centuries of Tang dynasty rule over China.",
    "Transition from Sui to Tang: Wang Shichong decisively defeats Li Mi at the Battle of Yanshi.",
    "The Tang dynasty scores a decisive victory over their rival Xue Rengao at the Battle of Qianshuiyuan.",
    "A qaghan of the Western Turkic Khaganate is assassinated in a Chinese palace by Eastern Turkic rivals after the approval of Tang emperor Gaozu.",
    "The beginning of the Islamic calendar.",
    "The Battle of Badr, the first major battle between the Muslims and Quraysh.",
    "Li Shimin, the future Emperor Taizong of Tang, ambushes and kills his rival brothers Li Yuanji and Li Jiancheng in the Xuanwu Gate Incident.",
    "The Avar and Slav armies leave the siege of Constantinople.",
    "King Edwin of Northumbria is converted to Christianity by Paulinus, bishop of York.",
    "Khosrow II, last Sasanian shah of Iran, is overthrown.",
    "Emperor Heraclius enters Constantinople in triumph after his victory over the Persian Empire.",
    "Dagobert I is crowned King of the Franks.",
    "Conquest of Mecca: The prophet Muhammad and his followers conquer the city, Quraysh surrender.",
    "The Farewell Sermon (Khutbah, Khutbatul Wada') of the Islamic prophet Muhammad.",
    "Yazdegerd III ascends the throne as king (shah) of the Persian Empire. He becomes the last ruler of the Sasanian dynasty (modern Iran)."
  ]
}