{
  "years": [
    1529,
    1530,
    1531,
    1532,
    1533,
    1534,
    1535
  ],
  "minYear": 1529,
  "maxYear": 1535,
  "events": [
    "Beginning of the Protestant Reformation: After the Second Diet of Speyer bans Lutheranism, a group of rulers (German: Fürst) and independent cities protests the reinstatement of the Edict of Worms.",
    "French forces are driven out of northern Italy by Spain at the Battle of Landriano during the War of the League of Cognac.",
    "Francisco Pizarro González, Spanish conquistador, is appointed governor of Peru.",
    "The Spanish fort of Sancti Spiritu, the first one built in modern Argentina, is destroyed by natives.",
    "The Siege of Vienna begins when Suleiman I attacks the city.",
    "Spanish conquistadores, led by Nuño de Guzmán, overthrow and execute Tangaxuan II, the last independent monarch of the Tarascan state in present-day central Mexico.",
    "At the Diet of Augsburg the Augsburg Confession is presented to the Holy Roman Emperor by the Lutheran princes and Electors of Germany.",
    "The 6.4-7.1 Mw Lisbon earthquake kills about thirty thousand people.",
    "Abyssinian-Adal war: The Adal Sultanate seizes southern Ethiopia.",
    "The Second War of Kappel results in the dissolution of the Protestant alliance in Switzerland.",
    "The Virgin of Guadalupe first appears to Juan Diego at Tepeyac, Mexico City.",
    "Sir Thomas More resigns as Lord Chancellor of England.",
    "Henry VIII of England and Francis I of France sign the \"Treaty of Closer Amity With France\" (also known as the Pommeraye treaty), pledging mutual aid against Charles V, Holy Roman Emperor.",
    "Union of Brittany and France: The Duchy of Brittany is absorbed into the Kingdom of France.",
    "Lady Anne Boleyn is made Marquess of Pembroke by her fiancé, King Henry VIII of England.",
    "The marriage of King Henry VIII to Catherine of Aragon is declared null and void.",
    "The Archbishop of Canterbury, Thomas Cranmer, declares the marriage of King Henry VIII of England to Anne Boleyn valid.",
    "Anne Boleyn is crowned Queen of England.",
    "Jacques Cartier begins his first voyage to what is today the east coast of Canada, Newfoundland and Labrador.",
    "Christian III is elected King of Denmark and Norway in the town of Rye.",
    "French explorer Jacques Cartier plants a cross on the Gaspé Peninsula and takes possession of the territory in the name of Francis I of France.",
    "Anti-Catholic posters appear in Paris and other cities supporting Huldrych Zwingli's position on the Mass.",
    "Following the Affair of the Placards, the French king leads an anti-Protestant procession through Paris.",
    "Spaniard Fray Tomás de Berlanga, the fourth Bishop of Panama, discovers the Galápagos Islands by chance on his way to Peru."
  ]
}