{
  "years": [
    1088,
    1091,
    1092,
    1095,
    1096,
    1097,
    1098,
    1099,
    1100,
    1105,
    1106,
    1110,
    1111,
    1112,
    1113,
    1086
  ],
  "minYear": 1086,
  "maxYear": 1113,
  "events": [
    "King Canute IV of Denmark is killed by rebellious peasants.",
    "Spanish Reconquista: At the Battle of Sagrajas, the Almoravids defeats the Castilians, but are unable to take advantage of their victory.",
    "Election of Urban II as the 159th Pope of the Catholic Church. He is best known for initiating the Crusades.",
    "Battle of Levounion: The Pechenegs are defeated by Byzantine Emperor Alexios I Komnenos.",
    "The Diocese of Pisa is elevated to the rank of metropolitan archdiocese by Pope Urban II",
    "The Council of Clermont begins: called by Pope Urban II, it led to the First Crusade to the Holy Land.",
    "Pope Urban II declares the First Crusade at the Council of Clermont.",
    "Starting date of the First Crusade as set by Pope Urban II.",
    "A Seljuk Turkish army successfully fights off the People's Crusade.",
    "The Siege of Nicaea begins during the First Crusade.",
    "First Crusade: Crusaders led by Godfrey of Bouillon, Bohemund of Taranto, and Raymond IV, Count of Toulouse, begin the Siege of Antioch.",
    "After 5-month siege during the First Crusade, the Crusaders seize Antioch (today's Turkey).",
    "Fighters of the First Crusade defeat Kerbogha of Mosul.",
    "Raniero is elected as Pope Paschal II.",
    "Henry I is crowned King of England in Westminster Abbey.",
    "Baldwin of Boulogne is crowned the first King of Jerusalem in the Church of the Nativity in Bethlehem.",
    "Maginulfo is elected the Antipope as Sylvester IV.",
    "Holy Roman Emperor Henry IV is forced to abdicate in favor of his son, Henry V, in Ingelheim.",
    "King Henry I of England defeats his brother Robert Curthose at the Battle of Tinchebray.",
    "The Kingdom of Jerusalem captures Sidon.",
    "Henry V is crowned Holy Roman Emperor.",
    "Highest Galician nobility led by Pedro Fróilaz de Traba and the bishop Diego Gelmírez crown Alfonso VII as \"King of Galicia\".",
    "Ramon Berenguer III, Count of Barcelona, and Douce I, Countess of Provence, marry, uniting the fortunes of those two states.",
    "Pope Paschal II issues Pie Postulatio Voluntatis, recognizing the Order of Hospitallers."
  ]
}