{
  "years": [
    960,
    961,
    962,
    963,
    965,
    966,
    969,
    971,
    945,
    946,
    947,
    951,
    954,
    955,
    959
  ],
  "minYear": 945,
  "maxYear": 971,
  "events": [
    "The co-emperors Stephen and Constantine are overthrown and forced to become monks by Constantine VII, who becomes sole emperor of the Byzantine Empire.",
    "Caliph Al-Mustakfi is blinded and deposed by Emir Mu'izz al-Dawla, ruler of the Buyid Empire. He is succeeded by Al-Muti as caliph of the Abbasid Caliphate.",
    "Emperor Suzaku abdicates the throne in favor of his brother Murakami who becomes the 62nd emperor of Japan.",
    "King Edmund I of England is murdered by a thief whom he personally attacks while celebrating St Augustine's Mass Day.",
    "The Later Han is founded by Liu Zhiyuan. He declares himself emperor.",
    "Abu Yazid, a Kharijite rebel leader, is defeated and killed in the Hodna Mountains in modern-day Algeria by Fatimid forces.",
    "Guo Wei, a court official, leads a military coup and declares himself emperor of the new Later Zhou.",
    "The 13-year-old Lothair III is crowned at the Abbey of Saint-Remi as king of the West Frankish Kingdom.",
    "Battle of Lechfeld: Otto I, Holy Roman Emperor defeats the Magyars, ending 50 years of Magyar invasion of the West.",
    "King Otto I defeats a Slavic revolt in what is now Mecklenburg-Vorpommern.",
    "Eraclus becomes the 25th bishop of Liège.",
    "Edgar the Peaceful becomes king of all England, in succession to Eadwig.",
    "The coronation of Zhao Kuangyin as Emperor Taizu of Song, initiating the Song dynasty period of China that would last more than three centuries.",
    "Byzantine conquest of Chandax by Nikephoros Phokas, end of the Emirate of Crete.",
    "Translatio imperii: Pope John XII crowns Otto I, Holy Roman Emperor, the first Holy Roman Emperor in nearly 40 years.",
    "The Sack of Aleppo as part of the Arab-Byzantine wars: Under the future Emperor Nicephorus Phocas, Byzantine troops storm the city of Aleppo.",
    "The Byzantine army proclaims Nikephoros II Phokas Emperor of the Romans on the plains outside Cappadocian Caesarea.",
    "Nikephoros II Phokas is crowned emperor of the Byzantine Empire.",
    "Synod of Rome: Emperor Otto I calls a council at St. Peter's Basilica in Rome. Pope John XII is deposed on charges of an armed rebellion against Otto.",
    "Pope Leo VIII is appointed to the office of Protonotary and begins his papacy as antipope of Rome.",
    "Pope John XIII is consecrated.",
    "After his marriage to the Christian Doubravka of Bohemia, the pagan ruler of the Polans, Mieszko I, converts to Christianity, an event considered to be the founding of the Polish state.",
    "The Fatimid general Jawhar leads the Friday prayer in Fustat in the name of Caliph al-Mu'izz li-Din Allah, thereby symbolically completing the Fatimid conquest of Egypt.",
    "Using crossbows, Song dynasty troops soundly defeat a war elephant corps of the Southern Han at Shao."
  ]
}