{
  "years": [
    1684,
    1685,
    1686,
    1687,
    1688,
    1689,
    1690
  ],
  "minYear": 1684,
  "maxYear": 1690,
  "events": [
    "The charter of the Massachusetts Bay Colony is revoked via a scire facias writ issued by an English court.",
    "Isaac Newton's derivation of Kepler's laws from his theory of gravity, contained in the paper De motu corporum in gyrum, is read to the Royal Society by Edmond Halley.",
    "James II of England and VII of Scotland is proclaimed King upon the death of his brother Charles II.",
    "René-Robert Cavelier establishes Fort St. Louis at Matagorda Bay thus forming the basis for France's claim to Texas.",
    "Battle of Vrtijeljka between rebels and Ottoman forces.",
    "Monmouth Rebellion: James Scott, 1st Duke of Monmouth declares himself King of England at Bridgwater.",
    "The Municipality of Ilagan is founded in the Philippines.",
    "Albany, New York is formally chartered as a municipality by Governor Thomas Dongan.",
    "Explorer Robert Cavelier de La Salle, searching for the mouth of the Mississippi River, is murdered by his own men.",
    "Morean War: The Parthenon in Athens, used as a gunpowder depot by the Ottoman garrison, is partially destroyed after being bombarded during the Siege of the Acropolis by Venetian forces.",
    "The first Huguenots set sail from France to the Cape of Good Hope.",
    "The Immortal Seven issue the Invitation to William, which would culminate in the Glorious Revolution.",
    "The city council of Amsterdam votes to support William of Orange's invasion of England, which became the Glorious Revolution.",
    "William III of Orange sets out a second time from Hellevoetsluis in the Netherlands to seize the crowns of England, Scotland and Ireland from King James II of England during the Glorious Revolution.",
    "Glorious Revolution: William of Orange captures Exeter.",
    "As part of the Glorious Revolution, King James II of England flees from England to Paris, France after being deposed in favor of his son-in-law and nephew, William of Orange and his daughter Mary.",
    "Bostonians rise up in rebellion against Sir Edmund Andros.",
    "Deposed monarch James II of England lays siege to Derry.",
    "The English Parliament passes the Act of Toleration protecting dissenting Protestants but excluding Roman Catholics.",
    "Beaver Wars: Fifteen hundred Iroquois attack Lachine in New France.",
    "The colony of Massachusetts issues the first paper money in the Americas.",
    "Constantin Cantemir, Prince of Moldavia, and the Holy Roman Empire sign a secret treaty in Sibiu, stipulating that Moldavia would support the actions led by the House of Habsburg against the Ottoman Empire.",
    "King William III of England (William of Orange) lands in Ireland to confront the former King James II.",
    "Publick Occurrences Both Forreign and Domestick, the first newspaper to appear in the Americas, is published for the first and only time."
  ]
}