{
  "years": [
    1472,
    1476,
    1477,
    1462,
    1464,
    1466,
    1467,
    1468,
    1469,
    1470,
    1471
  ],
  "minYear": 1462,
  "maxYear": 1477,
  "events": [
    "The Treaty of Westminster is finalised between Edward IV of England and the Scottish Lord of the Isles.",
    "Vlad III the Impaler attempts to assassinate Mehmed II (The Night Attack at Târgovişte), forcing him to retreat from Wallachia.",
    "Thirteen Years' War: A Polish army under Piotr Dunin decisively defeats the Teutonic Order at the Battle of Świecino.",
    "Pope Paul II succeeds Pope Pius II as the 211th pope.",
    "The Thirteen Years' War between Poland and the Teutonic Order ends with the Second Treaty of Thorn.",
    "The Battle of Molinella: The first battle in Italy in which firearms are used extensively.",
    "The Second Battle of Olmedo takes places as part of a succession conflict between Henry IV of Castile and his half-brother Alfonso, Prince of Asturias.",
    "Battle of Brustem: Charles the Bold defeats Prince-Bishopric of Liège.",
    "Stephen III of Moldavia defeats Matthias Corvinus of Hungary, with the latter being injured thrice, at the Battle of Baia.",
    "Liège is sacked by Charles I of Burgundy's troops.",
    "Louis XI of France founds the chivalric order called the Order of Saint Michael in Amboise.",
    "Ferdinand II of Aragon marries Isabella I of Castile, a marriage that paves the way to the unification of Aragon and Castile into a single country, Spain.",
    "The Ottomans capture Euboea.",
    "The Earl of Warwick's rebellion forces King Edward IV of England to flee to the Netherlands, restoring Henry VI to the throne.",
    "Champa-Đại Việt War: Emperor Lê Thánh Tông of Đại Việt formally launches his attack against Champa.",
    "In England, the Yorkists under Edward IV defeat the Lancastrians under the Earl of Warwick at the Battle of Barnet; the Earl is killed and Edward IV resumes the throne.",
    "Wars of the Roses: The Battle of Tewkesbury: Edward IV defeats a Lancastrian Army and kills Edward of Westminster, Prince of Wales.",
    "Sten Sture the Elder, the Regent of Sweden, with the help of farmers and miners, repels an attack by King Christian I of Denmark.",
    "Orkney and Shetland are pawned by Norway to Scotland in lieu of a dowry for Margaret of Denmark.",
    "Forces of the Catholic Monarchs engage the combined Portuguese-Castilian armies of Afonso V and Prince John at the Battle of Toro.",
    "Burgundian Wars: The Old Swiss Confederacy hands Charles the Bold, Duke of Burgundy, a major defeat in the Battle of Grandson in Canton of Neuchâtel.",
    "Giuliano della Rovere is appointed bishop of Coutances.",
    "Vlad the Impaler defeats Basarab Laiota with the help of Stephen the Great and Stephen V Báthory and becomes the ruler of Wallachia for the third time.",
    "Uppsala University is inaugurated after receiving its corporate rights from Pope Sixtus IV in February the same year."
  ]
}