{
  "years": [
    1937,
    1938,
    1939,
    1940
  ],
  "minYear": 1937,
  "maxYear": 1940,
  "events": [
    "Spanish Civil War: Nationalists and Republican both withdraw after suffering heavy losses, ending the Second Battle of the Corunna Road.",
    "Howard Hughes sets a new air record by flying from Los Angeles to New York City in seven hours, 28 minutes, 25 seconds.",
    "Franklin D. Roosevelt and John Nance Garner are sworn in for their second terms as U.S. President and U.S. Vice President; it is the first time a Presidential Inauguration takes place on January 20 since the 20th Amendment changed the dates of presidential terms.",
    "The trial of the anti-Soviet Trotskyist center sees seventeen mid-level Communists accused of sympathizing with Leon Trotsky and plotting to overthrow Joseph Stalin's regime.",
    "The Flint sit-down strike ends when General Motors recognizes the United Auto Workers trade union.",
    "Wallace H. Carothers receives a United States patent for nylon.",
    "Yekatit 12: During a public ceremony at the Viceregal Palace (the former Imperial residence) in Addis Ababa, Ethiopia, two Ethiopian nationalists of Eritrean origin attempt to kill viceroy Rodolfo Graziani with a number of grenades.",
    "The League of Nations bans foreign national \"volunteers\" in the Spanish Civil War.",
    "Adolf Hitler appoints himself as head of the Armed Forces High Command.",
    "BBC Television produces the world's first ever science fiction television programme, an adaptation of a section of the Karel Čapek play R.U.R., that coined the term \"robot\".",
    "Second Sino-Japanese War: During the Nanking Massacre, the Nanking Safety Zone International Committee is renamed \"Nanking International Rescue Committee\", and the safety zone in place for refugees falls apart.",
    "Oil is discovered in Saudi Arabia.",
    "Anschluss: German troops occupy and absorb Austria.",
    "Mexico creates Pemex by expropriating all foreign-owned oil reserves and facilities.",
    "U.S. Supreme Court delivers its opinion in Erie Railroad Co. v. Tompkins and overturns a century of federal common law.",
    "Norway claims Queen Maud Land in Antarctica.",
    "First flight of the Lockheed P-38 Lightning.",
    "Generalísimo Francisco Franco becomes the 68th \"Caudillo de España\", or Leader of Spain.",
    "As part of British air raid precautions, the first of 2.mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}1⁄2 million Anderson shelters is constructed in a garden in Islington, north London.",
    "United States labor law: The U.S. Supreme Court rules in NLRB v. Fansteel Metallurgical Corp. that the National Labor Relations Board has no authority to force an employer to rehire workers who engage in sit-down strikes.",
    "Winter War: Battle of Raate Road: The Finnish 9th Division finally defeat the numerically superior Soviet forces on the Raate-Suomussalmi road.",
    "World War II: Britain introduces food rationing.",
    "Three trains on the Nishinari Line; present Sakurajima Line, in Osaka, Japan, collide and explode while approaching Ajikawaguchi Station. One hundred and eighty-one people are killed.",
    "The second full-length animated Walt Disney film, Pinocchio, premieres."
  ]
}