{
  "years": [
    929,
    932,
    934,
    935,
    936,
    937,
    938,
    939,
    942,
    945,
    946,
    947,
    927
  ],
  "minYear": 927,
  "maxYear": 947,
  "events": [
    "King Constantine II of Scotland, King Hywel Dda of Deheubarth, Ealdred of Bamburgh and King Owain of the Cumbrians accepted the overlordship of King Æthelstan of England, leading to seven years of peace in the north.",
    "The Saracens conquer and destroy Taranto.",
    "The Sajid emir of Adharbayjan, Yusuf ibn Abi'l-Saj is defeated and captured by the Qarmatians near Kufa.",
    "Emir Abd-ar-Rahman III establishes the Caliphate of Córdoba.",
    "Battle of Lenzen: Slavic forces (the Redarii and the Obotrites) are defeated by a Saxon army near the fortified stronghold of Lenzen in Brandenburg.",
    "After a two-years siege, the city of Toledo, in Spain, surrenders to the forces of the Caliph of Córdoba Abd al-Rahman III, assuming an important victory in his campaign to subjugate the Central March.",
    "Abbasid caliph al-Muqtadir is killed while fighting against the forces of general Mu'nis al-Muzaffar. Al-Muqtadir's brother al-Qahir is chosen to succeed him.",
    "Meng Zhixiang declares himself emperor and establishes Later Shu as a new state independent of Later Tang.",
    "Duke Wenceslaus I of Bohemia is murdered by a group of nobles led by his brother Boleslaus I, who succeeds him.",
    "King Henry the Fowler dies in his royal palace in Memleben. He is succeeded by his son Otto I, who becomes the ruler of East Francia.",
    "Coronation of King Otto I of Germany.",
    "Shi Jingtang is enthroned as the first emperor of the Later Jin by Emperor Taizong of Liao, following a revolt against Emperor Fei of Later Tang.",
    "Ten Kingdoms: Li Bian usurps the throne and deposes Emperor Yang Pu. The Wu State is replaced by Li (now called \"Xu Zhigao\"), who becomes the first ruler of Southern Tang.",
    "Translation of the relics of martyr Wenceslaus I, Duke of Bohemia, Prince of the Czechs.",
    "The Battle of Alhandic is fought between Ramiro II of León and Abd-ar-Rahman III at Zamora in the context of the Spanish Reconquista. The battle resulted in a victory for the Emirate of Córdoba.",
    "Æthelstan, the first king of all England, dies and is succeeded by his half-brother, Edmund I.",
    "Start of the four-day Battle of al-Mada'in, between the Hamdanids of Mosul and the Baridis of Basra over control of the Abbasid capital, Baghdad.",
    "Assassination of William I of Normandy.",
    "The co-emperors Stephen and Constantine are overthrown and forced to become monks by Constantine VII, who becomes sole emperor of the Byzantine Empire.",
    "Caliph Al-Mustakfi is blinded and deposed by Emir Mu'izz al-Dawla, ruler of the Buyid Empire. He is succeeded by Al-Muti as caliph of the Abbasid Caliphate.",
    "Emperor Suzaku abdicates the throne in favor of his brother Murakami who becomes the 62nd emperor of Japan.",
    "King Edmund I of England is murdered by a thief whom he personally attacks while celebrating St Augustine's Mass Day.",
    "The Later Han is founded by Liu Zhiyuan. He declares himself emperor.",
    "Abu Yazid, a Kharijite rebel leader, is defeated and killed in the Hodna Mountains in modern-day Algeria by Fatimid forces."
  ]
}