{
  "years": [
    1914,
    1915,
    1916,
    1917
  ],
  "minYear": 1914,
  "maxYear": 1917,
  "events": [
    "The SPT Airboat Line becomes the world's first scheduled airline to use a winged aircraft.",
    "The Ford Motor Company announces an eight-hour workday and minimum daily wage of $5 in salary plus bonuses.",
    "The Phi Beta Sigma fraternity is founded by African-American students at Howard University in Washington D.C., United States.",
    "Copyright: In New York City the American Society of Composers, Authors and Publishers is established to protect the copyrighted musical compositions of its members.",
    "HMHS Britannic, sister to the RMS Titanic, is launched at Harland and Wolff shipyard in Belfast.",
    "China joins the Universal Postal Union.",
    "Prince William of Wied arrives in Albania to begin his reign as King.",
    "Nineteen men, women, and children participating in a strike are killed in the Ludlow Massacre during the Colorado Coalfield War.",
    "Ypiranga incident: A German arms shipment to Mexico is intercepted by the U.S. Navy near Veracruz.",
    "First baseball game at Wrigley Field, then known as Weeghman Park, in Chicago.",
    "The United States House of Representatives rejects a proposal to require states to give women the right to vote.",
    "Russia defeats Ottoman Turkey in the Battle of Sarikamish during the Caucasus Campaign of World War I.",
    "Japan issues the \"Twenty-One Demands\" to the Republic of China in a bid to increase its power in East Asia.",
    "Georges Claude patents the neon discharge tube for use in advertising.",
    "Kiwanis International is founded in Detroit.",
    "World War I: British Grand Fleet battle cruisers under Vice-Admiral Sir David Beatty engage Rear-Admiral Franz von Hipper's battle cruisers in the Battle of Dogger Bank.",
    "Alexander Graham Bell inaugurates U.S. transcontinental telephone service, speaking from New York to Thomas Watson in San Francisco.",
    "Both Oswald Boelcke and Max Immelmann, for achieving eight aerial victories each over Allied aircraft, receive the German Empire's highest military award, the Pour le Mérite as the first German aviators to earn it.",
    "In Brushaber v. Union Pacific Railroad Co., the Supreme Court of the United States declares the federal income tax constitutional.",
    "The Canadian province of Manitoba grants women the right to vote and run for office in provincial elections (although still excluding women of Indigenous or Asian heritage), marking the first time women in Canada are granted voting rights.",
    "The Centre Block of the Parliament buildings in Ottawa, Ontario, Canada burns down with the loss of seven lives.",
    "The Governor-General of Korea establishes a clinic called Jahyewon in Sorokdo to segregate Hansen's disease patients.",
    "In the Battle of Verdun, a German unit captures Fort Douaumont, keystone of the French defences, without a fight.",
    "The Kingsland munitions factory explosion occurs as a result of sabotage."
  ]
}