{
  "years": [
    1912,
    1910,
    1911
  ],
  "minYear": 1910,
  "maxYear": 1912,
  "events": [
    "Captain David Beatty is promoted to Rear admiral, and becomes the youngest admiral in the Royal Navy (except for Royal family members) since Horatio Nelson.",
    "The first public radio broadcast takes place; a live performance of the operas Cavalleria rusticana and Pagliacci is sent out over the airwaves from the Metropolitan Opera House in New York.",
    "The Boy Scouts of America is incorporated by William D. Boyce.",
    "Rockefeller Foundation: John D. Rockefeller Jr. announces his retirement from managing his businesses so that he can devote all his time to philanthropy.",
    "French aviator Raymonde de Laroche becomes the first woman to receive a pilot's license.",
    "Henri Fabre becomes the first person to fly a seaplane, the Fabre Hydravion, after taking off from a water runway near in France.",
    "The Transandine Railway connecting Chile and Argentina is inaugurated.",
    "SMS Zrínyi, one of the last pre-dreadnought battleships built by the Austro-Hungarian Navy, is launched.",
    "A magnitude 7.7 earthquake destroys the city of Almaty in Russian Turkestan.",
    "A gun battle in the East End of London leaves two dead. It sparked a political row over the involvement of then-Home Secretary Winston Churchill.",
    "Kappa Alpha Psi, the world's third oldest and largest black fraternity, is founded at Indiana University.",
    "The University of the Philippines College of Law is formally established; three future Philippine presidents are among the first enrollees.",
    "Roald Amundsen's South Pole expedition makes landfall on the eastern edge of the Ross Ice Shelf.",
    "Palestinian Arabic-language Falastin newspaper founded.",
    "Eugene B. Ely lands on the deck of the USS Pennsylvania anchored in San Francisco Bay, the first time an aircraft landed on a ship.",
    "The destroyer USS Terry makes the first airplane rescue at sea saving the life of Douglas McCurdy ten miles from Havana, Cuba.",
    "The Republic of China is established.",
    "The Scout Association is incorporated throughout the British Empire by royal charter.",
    "The sixth All-Russian Conference of the Russian Social Democratic Labour Party (Prague Party Conference) opens. In the course of the conference, Vladimir Lenin and his supporters break from the rest of the party to form the Bolshevik movement.",
    "New Mexico is admitted to the Union as the 47th U.S. state.",
    "German geophysicist Alfred Wegener first presents his theory of continental drift.",
    "The African National Congress is founded, under the name South African Native National Congress (SANNC).",
    "Immigrant textile workers in Lawrence, Massachusetts, go on strike when wages are reduced in response to a mandated shortening of the work week.",
    "British polar explorer Captain Robert Falcon Scott reaches the South Pole, one month after Roald Amundsen."
  ]
}