{
  "years": [
    1025,
    1027,
    1028,
    1030,
    1031,
    1032,
    1034,
    1038,
    1040,
    1041,
    1042,
    1014,
    1046,
    1016,
    1018,
    1021
  ],
  "minYear": 1014,
  "maxYear": 1046,
  "events": [
    "Pope Benedict VIII crowns Henry of Bavaria, King of Germany and of Italy, as Holy Roman Emperor.",
    "Battle of Clontarf: High King of Ireland Brian Boru defeats Viking invaders, but is killed in battle.",
    "Edmund Ironside succeeds his father Æthelred the Unready as King of England.",
    "The Danes defeat the English in the Battle of Assandun.",
    "Poland and the Holy Roman Empire conclude the Peace of Bautzen.",
    "Count Dirk III defeats an army sent by Emperor Henry II in the Battle of Vlaardingen.",
    "Byzantine general Eustathios Daphnomeles blinds and captures Ibatzes of Bulgaria by a ruse, thereby ending Bulgarian resistance against Emperor Basil II's conquest of Bulgaria.",
    "On the feast of Eid al-Adha, the death of the Fatimid caliph al-Hakim bi-Amr Allah, kept secret for six weeks, is announced, along with the succession of his son, al-Zahir li-i'zaz Din Allah. On the same day, al-Hakim's designated heir, Abd al-Rahim ibn Ilyas, is arrested in Damascus and brought to Egypt.",
    "Constantine VIII becomes sole emperor of the Byzantine Empire, 63 years after being crowned co-emperor.",
    "Coronation of Mieszko II Lambert as king of Poland.",
    "Pope John XIX crowns Conrad II as Holy Roman Emperor.",
    "Robert II of France names his son Henry I as junior King of the Franks.",
    "Future Byzantine empress Zoe takes the throne as empress consort to Romanos III Argyros.",
    "Ladejarl-Fairhair succession wars: Battle of Stiklestad: King Olaf II fights and dies trying to regain his Norwegian throne from the Danes.",
    "The Battle of Azaz ends with a humiliating retreat of the Byzantine emperor, Romanos III Argyros, against the Mirdasid rulers of Aleppo. The retreat degenerates into a rout, in which Romanos himself barely escapes capture.",
    "Olaf II of Norway is canonized as Saint Olaf by Grimketel, the English Bishop of Selsey.",
    "Conrad II, Holy Roman Emperor becomes king of Burgundy.",
    "Máel Coluim mac Cináeda, King of Scots, dies. His grandson, Donnchad, son of Bethóc and Crínán of Dunkeld, inherits the throne.",
    "King Stephen I, the first king of Hungary, dies; his nephew, Peter Orseolo, succeeds him.",
    "King Duncan I is killed in battle against his first cousin and rival Macbeth. The latter succeeds him as King of Scotland.",
    "Michael V, adoptive son of Empress Zoë of Byzantium, is proclaimed emperor of the Eastern Roman Empire.",
    "Edward the Confessor becomes King of England - the country's penultimate Anglo-Saxon king.",
    "Nasir Khusraw begins the seven-year Middle Eastern journey which he will later describe in his book Safarnama.",
    "Henry III is crowned Holy Roman Emperor by Pope Clement II."
  ]
}