{
  "years": [
    775,
    781,
    783,
    786,
    787,
    789,
    792,
    793,
    794,
    796,
    797,
    799,
    800,
    801,
    805,
    811,
    814,
    820,
    823,
    829
  ],
  "minYear": 775,
  "maxYear": 829,
  "events": [
    "The Battle of Bagrevand puts an end to an Armenian rebellion against the Abbasid Caliphate. Muslim control over the South Caucasus is solidified and its Islamization begins, while several major Armenian nakharar families lose power and their remnants flee to the Byzantine Empire.",
    "The oldest recorded eruption of Mount Fuji (Traditional Japanese date: Sixth day of the seventh month of the first year of the Ten'o (天応) era).",
    "The Asturian queen Adosinda is held at a monastery to prevent her king from retaking the throne from Mauregatus.",
    "A Hasanid Alid uprising in Mecca is crushed by the Abbasids at the Battle of Fakhkh.",
    "\"Night of the three Caliphs\": Harun al-Rashid becomes the Abbasid caliph upon the death of his brother al-Hadi. Birth of Harun's son al-Ma'mun.",
    "Second Council of Nicaea: The council assembles at the church of Hagia Sophia.",
    "Idris I reaches Volubilis and founds the Idrisid dynasty, marking the secession of Morocco from the Abbasid caliphate and founding the first Moroccan state.",
    "Kardam of Bulgaria defeats Byzantine Emperor Constantine VI at the Battle of Marcellae.",
    "Vikings raid the abbey at Lindisfarne in Northumbria, commonly accepted as the beginning of Norse activity in the British Isles.",
    "While visiting the royal Mercian court at Sutton Walls with a view to marrying princess Ælfthryth, King Æthelberht II of East Anglia is taken captive and beheaded.",
    "Emperor Kanmu relocates the Japanese capital to Heian-kyō (now Kyoto).",
    "King Æthelred I of Northumbria is murdered in Corbridge by a group led by his ealdormen, Ealdred and Wada. The patrician Osbald is crowned, but abdicates within 27 days.",
    "Empress Irene organizes a conspiracy against her son, the Byzantine emperor Constantine VI. He is deposed and blinded. Shortly after, Constantine dies of his wounds; Irene proclaims herself basileus.",
    "After mistreatment and disfigurement by the citizens of Rome, pope Leo III flees to the Frankish court of king Charlemagne at Paderborn for protection.",
    "A council is convened in the Vatican, at which Charlemagne is to judge the accusations against Pope Leo III.",
    "The coronation of Charlemagne as Holy Roman Emperor, in Rome.",
    "King Louis the Pious captures Barcelona from the Moors after a siege of several months.",
    "Noble Erchana of Dahauua grants the Bavarian town of Dachau to the Diocese of Freising",
    "Byzantine emperor Nikephoros I plunders the Bulgarian capital of Pliska and captures Khan Krum's treasury.",
    "Battle of Pliska: Byzantine Emperor Nikephoros I is killed and his heir Staurakios is seriously wounded.",
    "The death of Charlemagne, the first Holy Roman Emperor, brings about the accession of his son Louis the Pious as ruler of the Frankish Empire.",
    "Eastern Emperor Leo V is murdered in a church of the Great Palace of Constantinople by followers of Michael II.",
    "Lothair I is crowned King of Italy by Pope Paschal I.",
    "Theophilos succeeds his father Michael II as Byzantine Emperor."
  ]
}