{
  "years": [
    274,
    275,
    284,
    285,
    293,
    296,
    301,
    303,
    306,
    307,
    308,
    309,
    311,
    313,
    314,
    315,
    320,
    324,
    325
  ],
  "minYear": 274,
  "maxYear": 325,
  "events": [
    "A temple to Sol Invictus is dedicated in Rome by Emperor Aurelian.",
    "For the last time, the Roman Senate chooses an emperor; they elect 75-year-old Marcus Claudius Tacitus.",
    "Diocletian is chosen as Roman emperor.",
    "Execution of Saints Crispin and Crispinian during the reign of Diocletian, now the patron saints of leather workers, curriers, and shoemakers.",
    "Emperor Diocletian and Maximian appoint Constantius Chlorus and Galerius as Caesars. This is considered the beginning of the Tetrarchy, known as the Quattuor Principes Mundi (\"Four Rulers of the World\").",
    "Roman Emperors Diocletian and Maximian appoint Galerius as Caesar to Diocletian, beginning the period of four rulers known as the Tetrarchy.",
    "Pope Marcellinus begins his papacy.",
    "San Marino, one of the smallest nations in the world and the world's oldest republic still in existence, is founded by Saint Marinus.",
    "Roman emperor Diocletian orders the destruction of the Christian church in Nicomedia, beginning eight years of Diocletianic Persecution.",
    "Martyrdom of Saint Adrian of Nicomedia.",
    "Constantine I is proclaimed Roman emperor by his troops.",
    "Maxentius is proclaimed Roman emperor.",
    "Jin Huaidi becomes emperor of China in succession to his father, Jin Huidi, despite a challenge from his uncle, Sima Ying.",
    "After divorcing his wife Minervina, Constantine marries Fausta, daughter of the retired Roman emperor Maximian.",
    "At Carnuntum, Emperor emeritus Diocletian confers with Galerius, Augustus of the East, and Maximianus, the recently returned former Augustus of the West, in an attempt to end the civil wars of the Tetrarchy.",
    "Pope Eusebius is banished by the Emperor Maxentius to Sicily, where he dies, perhaps from a hunger strike.",
    "The Diocletianic Persecution of Christians in the Roman Empire ends.",
    "The decisions of the Edict of Milan, signed by Constantine the Great and co-emperor Valerius Licinius, granting religious freedom throughout the Roman Empire, are published in Nicomedia.",
    "Pope Sylvester I is consecrated, as successor to the late Pope Miltiades.",
    "The Arch of Constantine is completed near the Colosseum in Rome to commemorate Constantine I's victory over Maxentius at the Milvian Bridge.",
    "Pappus of Alexandria, Greek philosopher, observes an eclipse of the Sun and writes a commentary on The Great Astronomer (Almagest).",
    "Battle of Adrianople: Constantine I defeats Licinius, who flees to Byzantium.",
    "The First Council of Nicaea is formally opened, starting the first ecumenical council of the Christian Church.",
    "The original Nicene Creed is adopted at the First Council of Nicaea."
  ]
}