{
  "years": [
    2010,
    2011,
    2012,
    2013,
    2014
  ],
  "minYear": 2010,
  "maxYear": 2014,
  "events": [
    "The Burj Khalifa, the current tallest building in the world, officially opens in Dubai.",
    "Yemen declares an open war against the terrorist group al-Qaeda.",
    "Apple announces the iPad.",
    "Estonia officially adopts the Euro currency and becomes the 17th Eurozone country.",
    "Sitting US Congresswoman Gabby Giffords is shot in the head along with 18 others in a mass shooting in Tucson, Arizona. Giffords survived the assassination attempt, but six others died, including John Roll, a federal judge.",
    "President Zine El Abidine Ben Ali of Tunisia seeks refuge in Saudi Arabia after a series of demonstrations against his regime, considered to be the birth of the Arab Spring.",
    "Syrian civil war: The Movement for a Democratic Society (TEV-DEM) is established with the stated goal of re-organizing Syria along the lines of democratic confederalism.",
    "Anti-government demonstrations take place in Tirana, Albania. Four people lose their lives from gunshots, allegedly fired from armed police protecting the Prime Minister's office.",
    "The first wave of the Egyptian revolution begins throughout the country, marked by street demonstrations, rallies, acts of civil disobedience, riots, labour strikes, and violent clashes.",
    "Twenty-six people are killed and 63 wounded when a suicide bomber blows himself up at a police station in Damascus.",
    "A bombing at Jamrud in Pakistan, kills at least 30 people and injures 78 others.",
    "Violent protests occur in Bucharest, Romania, as two-day-old demonstrations continue against President Traian Băsescu's economic austerity measures. Clashes are reported in numerous Romanian cities between protesters and law enforcement officers.",
    "The Mali War begins when Tuareg militias start fighting the Malian government for independence.",
    "The Hong Kong-based file-sharing website Megaupload is shut down by the FBI.",
    "A gunman kills eight people in a house-to-house rampage in Kawit, Cavite, Philippines.",
    "One French soldier and 17 militants are killed in a failed attempt to free a French hostage in Bulo Marer, Somalia.",
    "Former cyclist Lance Armstrong confesses to his doping in an airing of Oprah's Next Chapter.",
    "Two hundred and forty-two people die in a nightclub fire in the Brazilian city of Santa Maria, Rio Grande do Sul.",
    "Naro-1 becomes the first carrier rocket launched by South Korea.",
    "A launch of the communication satellite GSAT-14 aboard the GSLV MK.II D5 marks the first successful flight of an Indian cryogenic engine.",
    "An explosion at a Mitsubishi Materials chemical plant in Yokkaichi, Japan, kills at least five people and injures 17 others.",
    "A bomb attack on an army convoy in the city of Bannu kills at least 26 Pakistani soldiers and injures 38 others.",
    "Rojava conflict: The Jazira Canton declares its autonomy from the Syrian Arab Republic.",
    "Two people are shot and killed and 29 students are taken hostage at a high school in Moscow, Russia."
  ]
}