{
  "years": [
    1248,
    1249,
    1250,
    1251,
    1252,
    1253,
    1254,
    1256,
    1257,
    1258,
    1259,
    1246
  ],
  "minYear": 1246,
  "maxYear": 1259,
  "events": [
    "Henry Raspe is elected anti-king of the Kingdom of Germany in opposition to Conrad IV.",
    "With the death of Frederick II, Duke of Austria, the Babenberg dynasty ends in Austria.",
    "The Dutch city of Ommen receives city rights and fortification rights from Otto III, the Archbishop of Utrecht.",
    "Conquest of Seville by Christian troops under King Ferdinand III of Castile.",
    "An overnight landslide on the north side of Mont Granier, one of the largest historical rockslope failures ever recorded in Europe, destroys five villages.",
    "Andrew of Longjumeau is dispatched by Louis IX of France as his ambassador to meet with the Khagan of the Mongol Empire.",
    "Coronation of Alexander III as King of Scots.",
    "Seventh Crusade: Crusaders engage Ayyubid forces in the Battle of Al Mansurah.",
    "Celebrated by the Carmelite Order-but doubted by modern historians-as the day when Saint Simon Stock had a vision of the Virgin Mary.",
    "Pope Innocent IV issues the papal bull ad extirpanda, which authorizes, but also limits, the torture of heretics in the Medieval Inquisition.",
    "Alfonso X is proclaimed king of Castile and León.",
    "Nichiren, a Japanese Buddhist monk, propounds Namu Myōhō Renge Kyō for the very first time and declares it to be the essence of Buddhism, in effect founding Nichiren Buddhism.",
    "Battle of West-Capelle: John I of Avesnes defeats Guy of Dampierre.",
    "Mindaugas is crowned King of Lithuania.",
    "Serbian King Stefan Uroš I and the Republic of Venice sign a peace treaty.",
    "The Augustinian monastic order is constituted at the Lecceto Monastery when Pope Alexander IV issues a papal bull Licet ecclesiae catholicae.",
    "Mongol forces under Hulagu enter and dismantle the Nizari Ismaili (Assassin) stronghold at Alamut Castle (in present-day Iran) as part of their offensive on Islamic southwest Asia.",
    "Richard of Cornwall, and his wife, Sanchia of Provence, are crowned King and Queen of the Germans at Aachen Cathedral.",
    "Kraków, in Poland, receives city rights.",
    "First Mongol invasion of Đại Việt: Đại Việt defeats the Mongols at the battle of Đông Bộ Đầu, forcing the Mongols to withdraw from the country.",
    "Mongol invasions: Baghdad falls to the Mongols, bringing the Islamic Golden Age to an end.",
    "War of Saint Sabas: In the Battle of Acre, the Venetians defeat a larger Genoese fleet sailing to relieve Acre.",
    "Regent George Mouzalon and his brothers are killed during a coup headed by the aristocratic faction under Michael VIII Palaiologos, paving the way for its leader to ultimately usurp the throne of the Empire of Nicaea.",
    "Michael VIII Palaiologos is proclaimed co-emperor of the Empire of Nicaea with his ward John IV Laskaris."
  ]
}