{
  "years": [
    1835,
    1836,
    1837,
    1838
  ],
  "minYear": 1835,
  "maxYear": 1838,
  "events": [
    "HMS Beagle, with Charles Darwin on board, drops anchor off the Chonos Archipelago.",
    "US President Andrew Jackson announces a celebratory dinner after having reduced the United States national debt to zero for the only time.",
    "Slaves in Salvador da Bahia, Brazil, stage a revolt, which is instrumental in ending slavery there 50 years later.",
    "In the first assassination attempt against a President of the United States, Richard Lawrence attempts to shoot president Andrew Jackson, but fails and is subdued by a crowd, including several congressmen as well as Jackson himself.",
    "Slavery is abolished in Mauritius.",
    "The original Quorum of the Twelve Apostles, in the Latter Day Saint movement, is formed in Kirtland, Ohio.",
    "Serbia's Sretenje Constitution briefly comes into effect.",
    "Elias Lönnrot signed and dated the first version of the Kalevala, the so-called foreword to the Old Kalevala.",
    "The first railway in continental Europe opens between Brussels and Mechelen.",
    "King William IV signs Letters Patent establishing the Province of South Australia.",
    "Texas Revolution: The Siege of the Alamo (prelude to the Battle of the Alamo) begins in San Antonio, Texas.",
    "Samuel Colt is granted a United States patent for his revolver firearm.",
    "A convention of delegates from 57 Texas communities convenes in Washington-on-the-Brazos, Texas, to deliberate independence from Mexico.",
    "U.S. Congress passes an act creating the Wisconsin Territory.",
    "Michigan is admitted as the 26th U.S. state.",
    "Richard Johnson becomes the first Vice President of the United States chosen by the United States Senate.",
    "The city of Chicago is incorporated.",
    "The University of Athens is founded in Athens, Greece.",
    "Houston is incorporated by the Republic of Texas.",
    "The Broad Street Riot occurs in Boston, fueled by ethnic tensions between Yankees and Irish.",
    "Queen Victoria succeeds to the British throne.",
    "Alfred Vail and colleagues demonstrate a telegraph system using dots and dashes (this is the forerunner of Morse code).",
    "Weenen massacre: Hundreds of Voortrekkers along the Blaukraans River, Natal are killed by Zulus.",
    "The French Army captures Veracruz in the Pastry War."
  ]
}