{
  "years": [
    1395,
    1396,
    1397,
    1398,
    1399,
    1400,
    1401,
    1402,
    1403,
    1404,
    1405,
    1406
  ],
  "minYear": 1395,
  "maxYear": 1406,
  "events": [
    "Timur defeats Tokhtamysh of the Golden Horde at the Battle of the Terek River. The Golden Horde capital city, Sarai, is razed to the ground and Timur installs a puppet ruler on the throne.",
    "Battle of Rovine: The Wallachians defeat an invading Ottoman army.",
    "Ottoman Emperor Bayezid I defeats a Christian army at the Battle of Nicopolis.",
    "The Kalmar Union is formed under the rule of Margaret I of Denmark.",
    "The Battle of Kellistown was fought on this day between the forces of the English led by Roger Mortimer, 4th Earl of March against the O'Byrnes and O'Tooles under the command of Art Óg mac Murchadha Caomhánach, the most powerful Chieftain in Leinster.",
    "In the Treaty of Salynas, Lithuania cedes Samogitia to the Teutonic Knights.",
    "Sultan Nasir-u Din Mehmud's armies in Delhi are defeated by Timur.",
    "Henry IV is proclaimed king of England.",
    "Coronation of Henry IV of England at Westminster Abbey.",
    "Turko-Mongol emperor Timur sacks Damascus.",
    "The Trần dynasty of Vietnam is deposed, after one hundred and seventy-five years of rule, by Hồ Quý Ly, a court official.",
    "Owain Glyndŵr is declared Prince of Wales by his followers.",
    "King Minkhaung I becomes king of Ava.",
    "Turco-Mongol emperor Timur sacks Damascus.[full citation needed]",
    "Timur attacks the Jalairid Sultanate and destroys Baghdad.",
    "Zhu Di, better known by his era name as the Yongle Emperor, assumes the throne over the Ming dynasty of China.",
    "Ottoman-Timurid Wars: Battle of Ankara: Timur, ruler of Timurid Empire, defeats forces of the Ottoman Empire sultan Bayezid I.",
    "Henry III of Castile sends Ruy González de Clavijo as ambassador to Timur to discuss the possibility of an alliance between Timur and Castile against the Ottoman Empire.",
    "Venetian-Genoese wars: The Genoese fleet under a French admiral is defeated by a Venetian fleet at the Battle of Modon.",
    "The Italian professor Galeazzo di Santa Sophie performed the first post-mortem autopsy for the purposes of teaching and demonstration at the Heiligen-Geist Spital in Vienna.",
    "Welsh rebel leader Owain Glyndŵr, having declared himself Prince of Wales, allies himself with the French against King Henry IV of England.",
    "Ming admiral Zheng He sets sail to explore the world for the first time.",
    "Sharif ul-Hāshim establishes the Sultanate of Sulu.",
    "Chen Yanxiang, the only person from Indonesia known to have visited dynastic Korea, reaches Seoul after having set out from Java four months before."
  ]
}