{
  "years": [
    2016,
    2017,
    2018,
    2015
  ],
  "minYear": 2015,
  "maxYear": 2018,
  "events": [
    "The Eurasian Economic Union comes into effect, creating a political and economic union between Russia, Belarus, Armenia, Kazakhstan and Kyrgyzstan.",
    "Two gunmen commit mass murder at the offices of Charlie Hebdo in Paris, shooting twelve people execution style, and wounding eleven others.",
    "A car bomb explodes outside a police college in the Yemeni capital Sana'a with at least 38 people reported dead and more than 63 injured.",
    "The perpetrators of the Charlie Hebdo shooting in Paris two days earlier are both killed after a hostage situation; a second hostage situation, related to the Charlie Hebdo shooting, occurs at a Jewish market in Vincennes.",
    "The Swiss National Bank abandons the cap on the Swiss franc's value relative to the euro, causing turmoil in international financial markets.",
    "A clash in Mamasapano, Maguindanao in the Philippines kills 44 members of Special Action Force (SAF), at least 18 from the Moro Islamic Liberation Front and five from the Bangsamoro Islamic Freedom Fighters.",
    "In response to the execution of Nimr al-Nimr, Iran ends its diplomatic relations with Saudi Arabia.",
    "Joaquín Guzmán, widely regarded as the world's most powerful drug trafficker, is recaptured following his escape from a maximum security prison in Mexico.",
    "Ten people are killed and 15 wounded in a bombing near the Blue Mosque in Istanbul.",
    "President Barack Obama announces the Joint Comprehensive Plan of Action.",
    "North Korea launches Kwangmyŏngsŏng-4 into outer space violating multiple UN treaties and prompting condemnation from around the world.",
    "Two passenger trains collide in the German town of Bad Aibling in the state of Bavaria. Twelve people die and 85 others are injured.",
    "An attack on a nightclub in Istanbul, Turkey, during New Year's celebrations, kills at least 39 people and injures more than 60 others.",
    "Five people are killed and six others injured in a mass shooting at Fort Lauderdale-Hollywood International Airport in Broward County, Florida.",
    "A naming ceremony for the chemical element tennessine takes place in the United States.",
    "Kim Jong-nam, brother of North Korean dictator Kim Jong-Un, is assassinated at Kuala Lumpur International Airport.",
    "The Turkish-backed Free Syrian Army captures Al-Bab from ISIL.",
    "The elements Moscovium, Tennessine, and Oganesson are officially added to the periodic table at a conference in Moscow, Russia.",
    "For the first time in history all five major storm surge gates in the Netherlands are closed simultaneously in the wake of a storm.",
    "A false emergency alert warning of an impending missile strike in Hawaii causes widespread panic in the state.",
    "British multinational construction and facilities management services company Carillion went into liquidation – officially, \"the largest ever trading liquidation in the UK\"",
    "A bus catches fire on the Samara-Shymkent road in Yrgyz District, Aktobe, Kazakhstan. The fire kills 52 passengers, with three passengers and two drivers escaping.",
    "A group of four or five gunmen attack The Inter-Continental Hotel in Kabul, Afghanistan, sparking a 12-hour battle. The attack kills 40 people and injures many others.",
    "Syrian civil war: The Government of Turkey announces the initiation of the Afrin offensive and begins shelling Syrian Democratic Forces (SDF) positions in Afrin Region."
  ]
}