{
  "years": [
    1377,
    1378,
    1381,
    1363,
    1364,
    1365,
    1367,
    1368,
    1370,
    1371,
    1373,
    1374
  ],
  "minYear": 1363,
  "maxYear": 1381,
  "events": [
    "The five-week Battle of Lake Poyang begins, in which the forces of two Chinese rebel leaders (Chen Youliang and Zhu Yuanzhang) meet to decide who will supplant the Yuan dynasty.",
    "Battle of Lake Poyang: In one of the largest naval battles in history, Zhu Yuanzhang's rebels defeat rival Chen Youliang.",
    "Jagiellonian University, the oldest university in Poland, is founded in Kraków.",
    "Troops of the Republic of Pisa and the Republic of Florence clash in the Battle of Cascina.",
    "Hundred Years' War: English forces defeat the French in Brittany, ending the War of the Breton Succession.",
    "Albert III of Mecklenburg (King Albert of Sweden) grants city rights to Ulvila (Swedish: Ulvsby).",
    "The Ava Kingdom and the royal city of Ava (Inwa) founded by King Thado Minbya.",
    "Swa Saw Ke becomes king of Ava",
    "In a coronation ceremony, Zhu Yuanzhang ascends the throne of China as the Hongwu Emperor, initiating Ming dynasty rule over China that would last for three centuries.",
    "Northern Crusades: Grand Duchy of Lithuania and the Teutonic Knights meet in the Battle of Rudau.",
    "Brussels massacre: Between six and twenty Jews are murdered and the rest of the Jewish community is banished from Brussels, Belgium, for allegedly desecrating consecrated Host.",
    "Charles IV, Holy Roman Emperor, grants city privileges to Karlovy Vary.",
    "Robert II becomes King of Scotland, beginning the Stuart dynasty.",
    "Serbian-Turkish wars: Ottoman Turks fought against a Serbian army at the Battle of Maritsa.",
    "Julian of Norwich, a Christian mystic and anchoress, experiences the deathbed visions described in her Revelations of Divine Love.",
    "A sudden outbreak of St. John's Dance causes people in the streets of Aachen, Germany, to experience hallucinations and begin to jump and twitch uncontrollably until they collapse from exhaustion.",
    "Pope Gregory XI reaches Rome, after deciding to move the Papacy back to Rome from Avignon.",
    "King Richard II of England is crowned.",
    "Russian troops are defeated by forces of the Blue Horde Khan Arapsha in the Battle on Pyana River.",
    "Tvrtko I is crowned the first king of Bosnia.",
    "Cardinal Robert of Geneva is elected as Pope Clement VII, beginning the Papal schism.",
    "Beginning of the Peasants' Revolt in England.",
    "Peasants' Revolt: In England, rebels assemble at Blackheath, just outside London.",
    "In England, the Peasants' Revolt, led by Wat Tyler, comes to a head, as rebels set fire to the Savoy Palace."
  ]
}