{
  "years": [
    1718,
    1719,
    1720,
    1721,
    1722,
    1723
  ],
  "minYear": 1718,
  "maxYear": 1723,
  "events": [
    "The city of New Orleans is founded by Jean-Baptiste Le Moyne, Sieur de Bienville.",
    "Alexei Petrovich, Tsarevich of Russia, Peter the Great's son, mysteriously dies after being sentenced to death by his father for plotting against him.",
    "The Treaty of Passarowitz between the Ottoman Empire, Austria and the Republic of Venice is signed.",
    "At the behest of Tsar Peter the Great, the construction of the Kadriorg Palace, dedicated to his wife Catherine, begins in Tallinn.",
    "Royal Navy Lieutenant Robert Maynard attacks and boards the vessels of the British pirate Edward Teach (best known as \"Blackbeard\") off the coast of North Carolina. The casualties on both sides include Maynard's first officer Mister Hyde and Teach himself.",
    "Great Northern War: King Charles XII of Sweden dies during a siege of the fortress of Fredriksten in Norway.",
    "War of the Quadruple Alliance: Great Britain declares war on Spain.",
    "The Principality of Liechtenstein is created within the Holy Roman Empire.",
    "Jacobite risings: Battle of Glen Shiel.",
    "Sweden and Prussia sign the Treaty of Stockholm.",
    "Ulrika Eleonora, Queen of Sweden abdicates in favour of her husband, who becomes King Frederick I on March 24.",
    "Count Frederick of Hesse-Kassel is elected King of Sweden by the Riksdag of the Estates, after his consort Ulrika Eleonora abdicated the throne on 29 February.",
    "The Spanish military Villasur expedition is defeated by Pawnee and Otoe warriors near present-day Columbus, Nebraska.",
    "The synagogue of Judah HeHasid is burned down by Arab creditors, leading to the expulsion of the Ashkenazim from Jerusalem.",
    "The Committee of Inquiry on the South Sea Bubble publishes its findings, revealing details of fraud among company directors and corrupt politicians.",
    "Robert Walpole becomes, in effect, the first Prime Minister of Great Britain, though he himself denied that title.",
    "A massive earthquake devastates the Iranian city of Tabriz.",
    "The Great Northern War between Sweden and Russia ends in the Treaty of Nystad.",
    "The Russian Empire is proclaimed by Tsar Peter I after the Swedish defeat in the Great Northern War.",
    "The Safavid Empire of Iran is defeated by an army from Afghanistan at the Battle of Gulnabad.",
    "Dummer's War begins along the Maine-Massachusetts border.",
    "After a siege and bombardment by cannon, Baku surrenders to the Russians.",
    "Ioan Giurgiu Patachi becomes Bishop of Făgăraș and is festively installed in his position at the St. Nicolas Cathedral in Făgăraș, after being formally confirmed earlier by Pope Clement XI.",
    "Grand Master António Manoel de Vilhena lays down the first stone of Fort Manoel in Malta."
  ]
}