{
  "years": [
    1537,
    1538,
    1539,
    1540,
    1541
  ],
  "minYear": 1537,
  "maxYear": 1541,
  "events": [
    "Bigod's Rebellion, an armed insurrection attempting to resist the English Reformation, begins.",
    "Asunción, Paraguay is founded.",
    "The Honourable Artillery Company, the oldest surviving regiment in the British Army, and the second most senior, is formed.",
    "Treaty of Nagyvárad between Holy Roman Emperor Ferdinand I and King John Zápolya of Hungary and Croatia.",
    "Geneva expels John Calvin and his followers from the city. Calvin lives in exile in Strasbourg for the next three years.",
    "The city of Guayaquil is founded by the Spanish Conquistador Francisco de Orellana and given the name Muy Noble y Muy Leal Ciudad de Santiago de Guayaquil.",
    "Bogotá, Colombia, is founded by Gonzalo Jiménez de Quesada.",
    "Ottoman-Venetian War: The Ottoman Navy scores a decisive victory over a Holy League fleet in the Battle of Preveza.",
    "The Universidad Santo Tomás de Aquino is founded in what is now the Dominican Republic.",
    "Pope Paul III excommunicates Henry VIII of England.",
    "The first recorded race is held on Chester Racecourse, known as the Roodee.",
    "The Treaty of Frankfurt between Protestants and the Holy Roman Emperor is signed.",
    "Official founding of the city of Bogotá, New Granada (nowadays Colombia), by Nikolaus Federmann and Sebastián de Belalcázar.",
    "Hernando de Soto claims Florida for Spain.",
    "Council of Trent: Pope Paul III sends out letters to his bishops, delaying the Council due to war and the difficulty bishops had traveling to Venice.",
    "Spain's DeSoto expedition takes over the Apalachee capital of Anhaica for their winter quarters.",
    "King Henry VIII of England marries Anne of Cleves.",
    "Waltham Abbey is surrendered to King Henry VIII of England; the last religious community to be closed during the Dissolution of the Monasteries.",
    "English King Henry VIII commands his 4th wife, Anne of Cleves, to leave the court.",
    "Thomas Cromwell is executed at the order of Henry VIII of England on charges of treason. Henry marries his fifth wife, Catherine Howard, on the same day.",
    "Arequipa, Peru is founded.",
    "The Society of Jesus (Jesuits) receives its charter from Pope Paul III.",
    "King Francis I of France gives Jean-François Roberval a commission to settle the province of New France (Canada) and provide for the spread of the \"Holy Catholic faith\".",
    "Santiago, Chile is founded by Pedro de Valdivia."
  ]
}