{
  "years": [
    1921,
    1922,
    1923
  ],
  "minYear": 1921,
  "maxYear": 1923,
  "events": [
    "World premiere of the science fiction play by the Czech writer Karel Čapek R.U.R. in theater in Hradec Králové.",
    "Greco-Turkish War: The First Battle of İnönü, the first battle of the war, begins near Eskişehir in Anatolia.",
    "The Marxist Left in Slovakia and the Transcarpathian Ukraine holds its founding congress in Ľubochňa.",
    "The British K-class submarine HMS K5 sinks in the English Channel; all 56 on board die.",
    "The first Constitution of Turkey is adopted, making fundamental changes in the source and exercise of sovereignty by consecrating the principle of national sovereignty.",
    "Bolsheviks launch a revolt in Georgia as a preliminary to the Red Army invasion of Georgia.",
    "Constituent Assembly of the Democratic Republic of Georgia adopts the country's first constitution.",
    "Rezā Shāh takes control of Tehran during a successful coup.",
    "After Russian forces under Baron Roman von Ungern-Sternberg drive the Chinese out, the Bogd Khan is reinstalled as the emperor of Mongolia.",
    "Georgian capital Tbilisi falls to the invading Russian forces after heavy fighting and the Russians declare the Georgian Soviet Socialist Republic.",
    "Dáil Éireann ratifies the Anglo-Irish Treaty by a 64-57 vote.",
    "Leonard Thompson becomes the first person to be injected with insulin.",
    "Ulysses by James Joyce is published.",
    "The Washington Naval Treaty is signed in Washington, D.C., limiting the naval armaments of United States, Britain, Japan, France, and Italy.",
    "United States President Warren G. Harding introduces the first radio set in the White House.",
    "Brazil becomes a member of the Berne Convention copyright treaty.",
    "A challenge to the Nineteenth Amendment to the United States Constitution, allowing women the right to vote, is rebuffed by the Supreme Court of the United States in Leser v. Garnett.",
    "The United Kingdom ends its protectorate over Egypt through a Unilateral Declaration of Independence.",
    "Mahatma Gandhi is arrested in India, tried for sedition, and sentenced to six years in prison, only to be released after nearly two years for an appendicitis operation.",
    "Britain's Railways are grouped into the Big Four: LNER, GWR, SR, and LMS.",
    "Juan de la Cierva makes the first autogyro flight.",
    "Lithuanian residents of the Memel Territory rebel against the League of Nations' decision to leave the area as a mandated region under French control.",
    "Occupation of the Ruhr: Troops from France and Belgium occupy the Ruhr area to force Germany to make its World War I reparation payments.",
    "Texas Tech University is founded as Texas Technological College in Lubbock, Texas."
  ]
}