{
  "years": [
    1586,
    1587,
    1588,
    1590,
    1591,
    1592
  ],
  "minYear": 1586,
  "maxYear": 1592,
  "events": [
    "Sir Francis Drake with an English force captures and occupies the Spanish colonial port of Cartagena de Indias for two months, obtaining a ransom and booty.",
    "Mary, Queen of Scots, recognizes Philip II of Spain as her heir and successor.",
    "English colonists leave Roanoke Island, after failing to establish England's first permanent settlement in North America.",
    "Anglo-Spanish War: A convoy of English ships from the Levant Company manage to repel a fleet of eleven Spanish and Maltese galleys off the Mediterranean island of Pantelleria.",
    "The Battle of Zutphen is a Spanish victory over the English and Dutch.",
    "Go-Yōzei becomes Emperor of Japan.",
    "Roanoke Colony: A second group of English settlers arrives on Roanoke Island off North Carolina to re-establish the deserted colony.",
    "French Wars of Religion: Henry III of France flees Paris after Henry I, Duke of Guise, enters the city and a spontaneous uprising occurs.",
    "The last ship of the Spanish Armada sets sail from Lisbon heading for the English Channel.",
    "Thomas Cavendish in his ship Desire enters Plymouth and completes the first deliberately planned voyage of circumnavigation.",
    "The so-called \"Invincible Armada\" sent by Catholic King Philip II of Spain to overthrow Protestant Queen Elizabeth I of England has been handed a crushing defeat in the English Channel.",
    "Coronation of Shah Abbas I of Persia.",
    "Luis de Carvajal y de la Cueva is tortured by the Inquisition in Mexico, charged with concealing the practice of Judaism of his sister and her children.",
    "Battle of Ivry: Henry of Navarre and the Huguenots defeat the forces of the Catholic League under Charles, Duke of Mayenne, during the French Wars of Religion.",
    "Anne of Denmark is crowned Queen of Scotland.",
    "John White, the governor of the Roanoke Colony, returns from a supply trip to England and finds his settlement deserted.",
    "Alexander Farnese's army forces Henry IV of France to lift the siege of Paris.",
    "The death of Pope Urban VII, 13 days after being chosen as the Pope, ends the shortest papal reign in history.",
    "Prince Gesualdo of Venosa murders his wife and her lover.",
    "Execution of Agnes Sampson, accused of witchcraft in Edinburgh.",
    "At the Battle of Tondibi in Mali, Moroccan forces of the Saadi dynasty, led by Judar Pasha, defeat the Songhai Empire, despite being outnumbered by at least five to one.",
    "The Duke of Parma is defeated near the Dutch city of Nijmegen by an Anglo-Dutch force led by Maurice of Orange.",
    "Pope Innocent IX is elected.",
    "During the first Japanese invasion of Korea, Japanese forces led by Toyotomi Hideyoshi captured Pyongyang, although they were ultimately unable to hold it."
  ]
}