{
  "years": [
    1065,
    1066,
    1068,
    1069,
    1070,
    1071,
    1072,
    1074,
    1075,
    1076,
    1077,
    1080,
    1081,
    1082
  ],
  "minYear": 1065,
  "maxYear": 1082,
  "events": [
    "Edward the Confessor's Romanesque monastic church at Westminster Abbey is consecrated.",
    "Following the death of Edward the Confessor on the previous day, the Witan meets to confirm Harold Godwinson as the new King of England; Harold is crowned the same day, sparking a succession crisis that will eventually lead to the Norman conquest of England.",
    "Norwegian king Harald Hardrada lands with Tostig Godwinson at the mouth of the Humber River and begins his invasion of England.",
    "At the Battle of Fulford, Harald Hardrada defeats earls Morcar and Edwin.",
    "In the Battle of Stamford Bridge, Harald Hardrada, the invading King of Norway, is defeated by King Harold II of England.",
    "William the Conqueror and his army set sail from the mouth of the Somme river, beginning the Norman conquest of England.",
    "The Norman conquest of England begins with the Battle of Hastings.",
    "Granada massacre: A Muslim mob storms the royal palace in Granada, crucifies Jewish vizier Joseph ibn Naghrela and massacres most of the Jewish population of the city.",
    "Romanos IV Diogenes marries Eudokia Makrembolitissa and is crowned Byzantine Emperor.",
    "Byzantine-Norman wars: Italo-Normans begin a nearly-three-year siege of Bari.",
    "Robert de Comines, appointed Earl of Northumbria by William the Conqueror, rides into Durham, England, where he is defeated and killed by rebels. This incident leads to the Harrying of the North.",
    "The Pavian-born Benedictine Lanfranc is appointed as the new Archbishop of Canterbury in England.",
    "Bari, the last Byzantine possession in southern Italy, is surrendered to Robert Guiscard.",
    "The Seljuq Turks defeat the Byzantine army at the Battle of Manzikert, and soon gain control of most of Anatolia.",
    "Robert Guiscard conquers Palermo in Sicily for the Normans.",
    "Battle of Mogyoród: Dukes Géza and Ladislaus defeat their cousin Solomon, King of Hungary, forcing him to flee to Hungary's western borderland.",
    "Dmitar Zvonimir is crowned King of Croatia.",
    "Having received a letter during the Lenten synod of 14-20 February demanding that he abdicate, Pope Gregory VII excommunicates Henry IV, Holy Roman Emperor.",
    "Coronation of Bolesław II the Generous as king of Poland.",
    "Walk to Canossa: The excommunication of Henry IV, Holy Roman Emperor, is lifted after he humbles himself before Pope Gregory VII at Canossa in Italy.",
    "The Patriarchate of Friûl, the first Friulian state, is created.",
    "Harald III of Denmark dies and is succeeded by Canute IV, who would later be the first Dane to be canonized.",
    "Alexios I Komnenos overthrows the Byzantine emperor Nikephoros III Botaneiates, and, after his troops spend three days extensively looting Constantinople, is formally crowned on April 4.",
    "Ramon Berenguer II, Count of Barcelona is assassinated."
  ]
}