{
  "years": [
    1025,
    1027,
    1028,
    1009,
    1010,
    1011,
    1012,
    1013,
    1014,
    1016,
    1018,
    1021
  ],
  "minYear": 1009,
  "maxYear": 1028,
  "events": [
    "First known mention of Lithuania, in the annals of the monastery of Quedlinburg.",
    "Lombard Revolt: Lombard forces led by Melus revolt in Bari against the Byzantine Catepanate of Italy.",
    "Pope Sergius IV becomes the 142nd pope, succeeding Pope John XVIII.",
    "Mainz Cathedral suffers extensive damage from a fire, which destroys the building on the day of its inauguration.",
    "The Church of the Holy Sepulchre, a Christian church in Jerusalem, is completely destroyed by the Fatimid caliph Al-Hakim bi-Amr Allah, who hacks the Church's foundations down to bedrock.",
    "Berber forces led by Sulayman ibn al-Hakam defeat the Umayyad caliph Muhammad II of Córdoba in the battle of Alcolea.",
    "Lý Công Uẩn is enthroned as emperor of Đại Cồ Việt, founding the Lý dynasty.",
    "Ferdowsi completes his epic poem Shahnameh.",
    "Danes capture Canterbury after a siege, taking Ælfheah, archbishop of Canterbury, as a prisoner.",
    "Duke Oldřich of Bohemia deposes and blinds his brother Jaromír, who flees to Poland.",
    "Sweyn Forkbeard takes control of the Danelaw and is proclaimed king of England.",
    "Pope Benedict VIII crowns Henry of Bavaria, King of Germany and of Italy, as Holy Roman Emperor.",
    "Battle of Clontarf: High King of Ireland Brian Boru defeats Viking invaders, but is killed in battle.",
    "Edmund Ironside succeeds his father Æthelred the Unready as King of England.",
    "The Danes defeat the English in the Battle of Assandun.",
    "Poland and the Holy Roman Empire conclude the Peace of Bautzen.",
    "Count Dirk III defeats an army sent by Emperor Henry II in the Battle of Vlaardingen.",
    "Byzantine general Eustathios Daphnomeles blinds and captures Ibatzes of Bulgaria by a ruse, thereby ending Bulgarian resistance against Emperor Basil II's conquest of Bulgaria.",
    "On the feast of Eid al-Adha, the death of the Fatimid caliph al-Hakim bi-Amr Allah, kept secret for six weeks, is announced, along with the succession of his son, al-Zahir li-i'zaz Din Allah. On the same day, al-Hakim's designated heir, Abd al-Rahim ibn Ilyas, is arrested in Damascus and brought to Egypt.",
    "Constantine VIII becomes sole emperor of the Byzantine Empire, 63 years after being crowned co-emperor.",
    "Coronation of Mieszko II Lambert as king of Poland.",
    "Pope John XIX crowns Conrad II as Holy Roman Emperor.",
    "Robert II of France names his son Henry I as junior King of the Franks.",
    "Future Byzantine empress Zoe takes the throne as empress consort to Romanos III Argyros."
  ]
}