{
  "years": [
    993,
    994,
    995,
    996,
    998,
    1000,
    1001,
    1002,
    1009,
    1010,
    986,
    987,
    988,
    991
  ],
  "minYear": 986,
  "maxYear": 1010,
  "events": [
    "Louis V becomes the last Carolingian king of West Francia after the death of his father, Lothaire.",
    "Byzantine-Bulgarian wars: Battle of the Gates of Trajan: The Bulgarians under the Comitopuli Samuel and Aron defeat the Byzantine forces at the Gate of Trajan, with Byzantine Emperor Basil II barely escaping.",
    "Bardas Phokas the Younger and Bardas Skleros, Byzantine generals of the military elite, begin a wide-scale rebellion against Emperor Basil II.",
    "The Norse King Glúniairn recognises Máel Sechnaill mac Domnaill, High King of Ireland, and agrees to pay taxes and accept Brehon Law; the event is considered to be the founding of the city of Dublin.",
    "Battle of Maldon: The English, led by Byrhtnoth, Ealdorman of Essex, are defeated by a band of inland-raiding Vikings near Maldon, Essex.",
    "Ulrich of Augsburg is canonized as a saint.",
    "Major Fatimid victory over the Byzantine Empire at the Battle of the Orontes.",
    "Boleslaus II, Duke of Bohemia, kills most members of the rival Slavník dynasty.",
    "Sixteen-year-old Otto III is crowned Holy Roman Emperor.",
    "Emperor Otto III issues a deed to Gottschalk, Bishop of Freising, which is the oldest known document using the name Ostarrîchi (Austria in Old High German).",
    "Arab-Byzantine wars: Battle of Apamea: Fatimids defeat a Byzantine army near Apamea.",
    "Fatimid caliph al-Hakim bi-Amr Allah assassinates the eunuch chief minister Barjawan and assumes control of the government.",
    "The foundation of the Kingdom of Hungary: Hungary is established as a Christian kingdom by Stephen I of Hungary.",
    "Grand Prince Stephen I of Hungary is named the first King of Hungary by Pope Sylvester II (probable).",
    "At an assembly at Pavia of Lombard nobles, Arduin of Ivrea is restored to his domains and crowned King of Italy.",
    "Henry II, a cousin of Emperor Otto III, is elected and crowned King of Germany.",
    "First known mention of Lithuania, in the annals of the monastery of Quedlinburg.",
    "Lombard Revolt: Lombard forces led by Melus revolt in Bari against the Byzantine Catepanate of Italy.",
    "Pope Sergius IV becomes the 142nd pope, succeeding Pope John XVIII.",
    "Mainz Cathedral suffers extensive damage from a fire, which destroys the building on the day of its inauguration.",
    "The Church of the Holy Sepulchre, a Christian church in Jerusalem, is completely destroyed by the Fatimid caliph Al-Hakim bi-Amr Allah, who hacks the Church's foundations down to bedrock.",
    "Berber forces led by Sulayman ibn al-Hakam defeat the Umayyad caliph Muhammad II of Córdoba in the battle of Alcolea.",
    "Lý Công Uẩn is enthroned as emperor of Đại Cồ Việt, founding the Lý dynasty.",
    "Ferdowsi completes his epic poem Shahnameh."
  ]
}