{
  "years": [
    897,
    900,
    870,
    871,
    902,
    903,
    904,
    875,
    876,
    877,
    878,
    879,
    880,
    887,
    893
  ],
  "minYear": 870,
  "maxYear": 904,
  "events": [
    "The Fourth Council of Constantinople closes.",
    "Treaty of Meerssen: King Louis the German and his half-brother Charles the Bald partition the Middle Frankish Kingdom into two larger east and west divisions.",
    "The city of Melite surrenders to an Aghlabid army following a siege, putting an end to Byzantine Malta.",
    "Battle of Englefield: The Vikings clash with ealdorman Æthelwulf of Berkshire. The invaders are driven back to Reading (East Anglia); many Danes are killed.",
    "Æthelred I and Alfred the Great lead a West Saxon army to repel an invasion by Danelaw Vikings.",
    "Charles the Bald, King of the Franks, is crowned as Holy Roman Emperor Charles II.",
    "The Battle of Dayr al-'Aqul saves Baghdad from the Saffarids.",
    "Frankish forces led by Louis the Younger prevent a West Frankish invasion and defeat emperor Charles II (\"the Bald\").",
    "Louis the Stammerer (son of Charles the Bald) is crowned king of the West Frankish Kingdom at Compiègne.",
    "Syracuse, Sicily, is captured by the Muslim Aghlabids after a nine-month siege.",
    "Pope John VIII gives blessings to Branimir of Croatia and to the Croatian people, considered to be international recognition of the Croatian state.",
    "The Nea Ekklesia is inaugurated in Constantinople, setting the model for all later cross-in-square Orthodox churches.",
    "Luoyang, eastern capital of the Tang dynasty, is captured by rebel leader Huang Chao during the reign of Emperor Xizong.",
    "Emperor Charles the Fat is deposed by the Frankish magnates in an assembly at Frankfurt, leading his nephew, Arnulf of Carinthia, to declare himself king of the East Frankish Kingdom in late November.",
    "Berengar I is elected as king of Italy by the lords of Lombardy. He is crowned with the Iron Crown of Lombardy at Pavia.",
    "An earthquake destroys the city of Dvin, Armenia.",
    " Al-Hadi ila'l-Haqq Yahya enters Sa'dah and founds the Zaydi Imamate of Yemen.",
    "The Laguna Copperplate Inscription (the earliest known written document found in what is now the Philippines): the Commander-in-Chief of the Kingdom of Tondo, as represented by the Honourable Jayadewa, Lord Minister of Pailah, pardons from all debt the Honourable Namwaran and his relations.",
    "Count Reginar I of Hainault rises against Zwentibold of Lotharingia and slays him near present-day Susteren.",
    "Taormina, the last Byzantine stronghold in Sicily, is captured by the Aghlabid army, concluding the Muslim conquest of Sicily.",
    "The Abbasid army under Muhammad ibn Sulayman al-Katib defeats the Qarmatians at the Battle of Hama.",
    "Sergius III is elected pope, after coming out of retirement to take over the papacy from the deposed antipope Christopher.",
    "Sack of Thessalonica: Saracen raiders under Leo of Tripoli sack Thessaloniki, the Byzantine Empire's second-largest city, after a short siege, and plunder it for a week.",
    "The warlord Zhu Quanzhong kills Emperor Zhaozong, the penultimate emperor of the Tang dynasty, after seizing control of the imperial government."
  ]
}