{
  "years": [
    1745,
    1746,
    1748,
    1749,
    1750,
    1751,
    1752
  ],
  "minYear": 1745,
  "maxYear": 1752,
  "events": [
    "War of the Austrian Succession: French forces defeat an Anglo-Dutch-Hanoverian army.",
    "Battle of Hohenfriedberg: Frederick the Great's Prussian army decisively defeated an Austrian army under Prince Charles Alexander of Lorraine during the War of the Austrian Succession.",
    "A New England colonial army captures the French fortifications at Louisbourg (New Style).",
    "French victory in the Battle of Melle allows them to capture Ghent in the days after.",
    "The first recorded women's cricket match takes place near Guildford, England.",
    "Prince Charles Edward Stuart raises his standard in Glenfinnan: The start of the Second Jacobite Rebellion, known as \"the 45\".",
    "Ottoman-Persian War: In the Battle of Kars, the Ottoman army is routed by Persian forces led by Nader Shah.",
    "A Hanoverian army is defeated, in ten minutes, by the Jacobite forces of Prince Charles Edward Stuart",
    "Second Jacobite rising: Bonnie Prince Charlie occupies Stirling.",
    "The Battle of Culloden is fought between the French-supported Jacobites and the British Hanoverian forces commanded by William Augustus, Duke of Cumberland, in Scotland. After the battle many highland traditions were banned and the Highlands of Scotland were cleared of inhabitants.",
    "The College of New Jersey (later renamed Princeton University) receives its charter",
    "Denmark adopts the characteristic Nordic Cross flag later taken up by all other Scandinavian countries.",
    "War of Jenkins' Ear: A British squadron wins a tactical victory over a Spanish squadron off Havana.",
    "Signing of the Treaty of Aix-la-Chapelle ends the War of the Austrian Succession.",
    "Benning Wentworth issues the first of the New Hampshire Grants, leading to the establishment of Vermont.",
    "King George II of Great Britain grants the Ohio Company a charter of land around the forks of the Ohio River.",
    "Halifax, Nova Scotia, is founded.",
    "on 28 July, the composer, organist and harpsichordist Johann Sebastian Bach dies.",
    "Riots break out in Lhasa after the murder of the Tibetan regent.",
    "The F.H.C. Society, also known as the Flat Hat Club, is formed at Raleigh Tavern, Williamsburg, Virginia. It is the first college fraternity.",
    "Tarabai, regent of the Maratha Empire, imprisons Rajaram II of Satara for refusing to remove Balaji Baji Rao from the post of peshwa.",
    "Pope Benedict XIV suppresses the Patriarchate of Aquileia and establishes from its territory the Archdiocese of Udine and Gorizia.",
    "The Theresian Military Academy is founded in Wiener Neustadt, Austria.",
    "Benjamin Franklin proves that lightning is electricity (traditional date, the exact date is unknown)."
  ]
}