{
  "years": [
    523,
    524,
    493,
    527,
    529,
    498,
    531,
    532,
    533,
    502,
    534,
    536,
    537,
    506,
    538,
    508,
    511
  ],
  "minYear": 493,
  "maxYear": 538,
  "events": [
    "Odoacer, the first barbarian King of Italy after the fall of the Western Roman Empire, is slain by Theoderic the Great, king of the Ostrogoths, while the two kings were feasting together.",
    "After the death of Anastasius II, Symmachus is elected Pope in the Lateran Palace, while Laurentius is elected Pope in Santa Maria Maggiore.",
    "The Synodus Palmaris, called by Gothic king Theoderic, absolves Pope Symmachus of all charges, thus ending the schism of Antipope Laurentius.",
    "Chinese emperor Xiao Yan names Xiao Tong his heir designate.",
    "Alaric II, eighth king of the Visigoths, promulgates the Breviary of Alaric (Breviarium Alaricianum or Lex Romana Visigothorum), a collection of \"Roman law\".",
    "The bishops of Visigothic Gaul meet in the Council of Agde.",
    "Clovis I, king of the Franks, is baptized into the Catholic faith at Reims, by Saint Remigius.",
    "King Clovis I dies at Lutetia and is buried in the Abbey of St Genevieve.",
    "John I becomes the new Pope after the death of Pope Hormisdas.",
    "The Franks are defeated by the Burgundians in the Battle of Vézeronce.",
    "Byzantine Emperor Justin I names his nephew Justinian I as co-ruler and successor to the throne.",
    "Justinian I becomes the sole ruler of the Byzantine Empire.",
    "First Corpus Juris Civilis, a fundamental work in jurisprudence, is issued by Eastern Roman Emperor Justinian I.",
    "Battle of Callinicum: A Byzantine army under Belisarius is defeated by the Persians at Raqqa (northern Syria).",
    "Nika riots in Constantinople: A quarrel between supporters of different chariot teams—the Blues and the Greens—in the Hippodrome escalates into violence.",
    "The Nika riots break out, during the racing season at the Hippodrome in Constantinople, as a result of discontent with the rule of the Emperor Justinian I.",
    "Mercurius becomes Pope John II, the first pope to adopt a new name upon elevation to the papacy.",
    "A Byzantine expeditionary fleet under Belisarius sails from Constantinople to attack the Vandals in Africa, via Greece and Sicily (approximate date).",
    "Belisarius of the Byzantine Empire defeats Gelimer and the Vandals at the Battle of Ad Decimum, near Carthage, North Africa.",
    "Vandalic War: Byzantine general Belisarius defeats the Vandals, commanded by King Gelimer, at the Battle of Tricamarum.",
    "The second and final edition of the Code of Justinian comes into effect in the Byzantine Empire.",
    "Gothic War: The Byzantine general Belisarius enters Rome unopposed; the Gothic garrison flees the capital.",
    "Siege of Rome: The Ostrogoth army under king Vitiges begins the siege of the capital. Belisarius conducts a delaying action outside the Flaminian Gate; he and a detachment of his bucellarii are almost cut off.",
    "Vitiges, king of the Ostrogoths ends his siege of Rome and retreats to Ravenna, leaving the city to the victorious Byzantine general, Belisarius."
  ]
}