{
  "years": [
    1984,
    1985,
    1986,
    1987
  ],
  "minYear": 1984,
  "maxYear": 1987,
  "events": [
    "Brunei becomes independent of the United Kingdom.",
    "The Apple Macintosh, the first consumer computer to popularize the computer mouse and the graphical user interface, is introduced during a Super Bowl XVIII television commercial.",
    "Apple Computer places the Macintosh personal computer on sale in the United States.",
    "Doctor John Buster and a research team at Harbor-UCLA Medical Center in the United States announce history's first embryo transfer, from one woman to another resulting in a live birth.",
    "Space Shuttle program: STS-41-B is launched using Space Shuttle Challenger.",
    "The first British mobile phone call is made by Michael Harrison to his father Sir Ernest Harrison, chairman of Vodafone.",
    "Japan Aerospace Exploration Agency launches Sakigake, Japan's first interplanetary spacecraft and the first deep space probe to be launched by any country other than the United States or the Soviet Union.",
    "Sandinista Daniel Ortega becomes president of Nicaragua and vows to continue the transformation to socialism and alliance with the Soviet Union and Cuba; American policy continues to support the Contras in their revolt against the Nicaraguan government.",
    "World Airways Flight 30H overshoots the runway at Logan International Airport in Boston, Massachusetts, and crashes into Boston Harbor. Two people are presumed dead.",
    "Supergroup USA for Africa (United Support of Artists for Africa) records the hit single We Are the World, to help raise funds for Ethiopian famine relief.",
    "Hezbollah is founded.",
    "William J. Schroeder becomes the first recipient of an artificial heart to leave the hospital.",
    "The Gateway Bridge, Brisbane, Queensland, Australia is officially opened.",
    "A month-long violent struggle begins in Aden, South Yemen between supporters of Ali Nasir Muhammad and Abdul Fattah Ismail, resulting in thousands of casualties.",
    "In the United States, Martin Luther King Jr. Day is celebrated as a federal holiday for the first time.",
    "The Rock and Roll Hall of Fame inducts its first members: Little Richard, Chuck Berry, James Brown, Ray Charles, Sam Cooke, Fats Domino, The Everly Brothers, Buddy Holly, Jerry Lee Lewis and Elvis Presley.",
    "The Voyager 2 space probe makes its closest approach to Uranus.",
    "The National Resistance Movement topples the government of Tito Okello in Uganda.",
    "The Ugandan government of Tito Okello is overthrown by the National Resistance Army, led by Yoweri Museveni.",
    "The Isleta Pueblo tribe elect Verna Williamson to be their first female governor.",
    "Mohammed Said Hersi Morgan sends a \"letter of death\" to Somali President Siad Barre, proposing the genocide of the Isaaq people.",
    "Justice Mary Gaudron becomes the first woman to be appointed to the High Court of Australia.",
    "Supernova 1987a is seen in the Large Magellanic Cloud.",
    "Iran-Contra affair: The Tower Commission rebukes President Ronald Reagan for not controlling his national security staff."
  ]
}