{
  "years": [
    796,
    797,
    799,
    800,
    801,
    805,
    811,
    814,
    820,
    823,
    829,
    834,
    835,
    836,
    841,
    842,
    843,
    844,
    845
  ],
  "minYear": 796,
  "maxYear": 845,
  "events": [
    "King Æthelred I of Northumbria is murdered in Corbridge by a group led by his ealdormen, Ealdred and Wada. The patrician Osbald is crowned, but abdicates within 27 days.",
    "Empress Irene organizes a conspiracy against her son, the Byzantine emperor Constantine VI. He is deposed and blinded. Shortly after, Constantine dies of his wounds; Irene proclaims herself basileus.",
    "After mistreatment and disfigurement by the citizens of Rome, pope Leo III flees to the Frankish court of king Charlemagne at Paderborn for protection.",
    "A council is convened in the Vatican, at which Charlemagne is to judge the accusations against Pope Leo III.",
    "The coronation of Charlemagne as Holy Roman Emperor, in Rome.",
    "King Louis the Pious captures Barcelona from the Moors after a siege of several months.",
    "Noble Erchana of Dahauua grants the Bavarian town of Dachau to the Diocese of Freising",
    "Byzantine emperor Nikephoros I plunders the Bulgarian capital of Pliska and captures Khan Krum's treasury.",
    "Battle of Pliska: Byzantine Emperor Nikephoros I is killed and his heir Staurakios is seriously wounded.",
    "The death of Charlemagne, the first Holy Roman Emperor, brings about the accession of his son Louis the Pious as ruler of the Frankish Empire.",
    "Eastern Emperor Leo V is murdered in a church of the Great Palace of Constantinople by followers of Michael II.",
    "Lothair I is crowned King of Italy by Pope Paschal I.",
    "Theophilos succeeds his father Michael II as Byzantine Emperor.",
    "Emperor Louis the Pious is restored as sole ruler of the Frankish Empire.",
    "Sweet Dew Incident: Emperor Wenzong of the Tang dynasty conspires to kill the powerful eunuchs of the Tang court, but the plot is foiled.",
    "Pactum Sicardi, a peace treaty between the Principality of Benevento and the Duchy of Naples, is signed.",
    "In the Battle of Fontenay-en-Puisaye, forces led by Charles the Bald and Louis the German defeat the armies of Lothair I of Italy and Pepin II of Aquitaine.",
    "Charles the Bald and Louis the German swear the Oaths of Strasbourg in the French and German languages.",
    "Triumph of Orthodoxy: Empress Theodora II restores the veneration of icons in the Orthodox churches in the Byzantine Empire.",
    "The Vikings sack French city of Nantes.",
    "Louis II is crowned as king of Italy at Rome by pope Sergius II.",
    "The 42 Martyrs of Amorium are killed after refusing to convert to Islam.",
    "Paris is sacked by Viking raiders, probably under Ragnar Lodbrok, who collects a huge ransom in exchange for leaving.",
    "The first duke of Brittany, Nominoe, defeats the Frankish king Charles the Bald at the Battle of Ballon near Redon."
  ]
}