{
  "years": [
    1186,
    1187,
    1189,
    1190,
    1192,
    1194,
    1195,
    1198,
    1199,
    1200,
    1201,
    1202,
    1203
  ],
  "minYear": 1186,
  "maxYear": 1203,
  "events": [
    "Henry VI, the son and heir of the Holy Roman Emperor Frederick I, marries Constance of Sicily.",
    "Georgenberg Pact: Ottokar IV, Duke of Styria and Leopold V, Duke of Austria sign a heritage agreement in which Ottokar gives his duchy to Leopold and to his son Frederick under the stipulation that Austria and Styria would henceforth remain undivided.",
    "The Crusades: Battle of Hattin: Saladin defeats Guy of Lusignan, King of Jerusalem.",
    "Saladin begins the Siege of Jerusalem.",
    "Pope Clement III is elected.",
    "Richard I of England officially invested as Duke of Normandy.",
    "Friedrich Barbarossa arrives at Niš, the capital of Serbian King Stefan Nemanja, during the Third Crusade.",
    "Third Crusade: The Crusaders begin the Siege of Acre under Guy of Lusignan.",
    "Massacre of Jews at Clifford's Tower, York.",
    "Conrad of Montferrat becomes King of Jerusalem upon his marriage to Isabella I of Jerusalem.",
    "Minamoto no Yoritomo becomes Sei-i Taishōgun and the de facto ruler of Japan. (Traditional Japanese date: the 12th day of the seventh month in the third year of the Kenkyū (建久) era).",
    "The Treaty of Jaffa is signed between Richard I of England and Saladin, leading to the end of the Third Crusade.",
    "King Richard I of England gives Portsmouth its first Royal Charter.",
    "Sverre is crowned King of Norway, leading to his excommunication by the Catholic Church and civil war.",
    "Palermo is conquered by Henry VI, Holy Roman Emperor.",
    "Battle of Alarcos: Almohad forces defeat the Castilian army of Alfonso VIII and force its retreat to Toledo.",
    "Philip of Swabia, Prince of Hohenstaufen, is crowned King of Germany (King of the Romans)",
    "John is crowned King of England.",
    "King John of England and King Philip II of France sign the Treaty of Le Goulet.",
    "Isabella of Angoulême is crowned Queen consort of England.",
    "Attempted usurpation by John Komnenos the Fat for the throne of Alexios III Angelos.",
    "Georgian-Seljuk wars: At the Battle of Basian the Kingdom of Georgia defeats the Sultanate of Rum.",
    "Fourth Crusade: Despite letters from Pope Innocent III forbidding it and threatening excommunication, Catholic crusaders begin a siege of Zara (now Zadar, Croatia).",
    "The Fourth Crusade assaults Constantinople. The Byzantine emperor Alexios III Angelos flees from his capital into exile."
  ]
}