{
  "years": [
    645,
    649,
    653,
    654,
    655,
    656,
    657,
    660,
    661,
    663,
    671,
    673,
    677,
    680,
    681,
    682,
    683,
    684,
    686,
    687
  ],
  "minYear": 645,
  "maxYear": 687,
  "events": [
    "Isshi Incident: Prince Naka-no-Ōe and Fujiwara no Kamatari assassinate Soga no Iruka during a coup d'état at the imperial palace.",
    "Chinese forces under general Li Shiji besiege the strategic fortress city of Anshi (Liaoning) during the Goguryeo-Tang War.",
    "Conquest of Kucha: The forces of Kucha surrender after a forty-day siege led by Tang dynasty general Ashina She'er, establishing Tang control over the northern Tarim Basin in Xinjiang.",
    "King Chindasuinth, at the urging of bishop Braulio of Zaragoza, crowns his son Recceswinth as co-ruler of the Visigothic Kingdom.",
    "Pope Martin I is arrested and taken to Constantinople, due to his opposition to monothelitism.",
    "Pope Eugene I elected to succeed Martinus I.",
    "Battle of the Winwaed: Penda of Mercia is defeated by Oswiu of Northumbria.",
    "Ali becomes Caliph of the Rashidun Caliphate.",
    "First Fitna: In the Battle of Siffin, troops led by Ali ibn Abu Talib clash with those led by Muawiyah I.",
    "Korean forces under general Kim Yu-sin of Silla defeat the army of Baekje in the Battle of Hwangsanbeol.",
    "The Rashidun Caliphate is effectively ended with the assassination of Ali, the last caliph.",
    "Silla-Tang armies crush the Baekje restoration attempt and force Yamato Japan to withdraw from Korea in the Battle of Baekgang.",
    "Emperor Tenji of Japan introduces a water clock (clepsydra) called Rokoku. The instrument, which measures time and indicates hours, is placed in the capital of Ōtsu.",
    "King Wamba of the Visigoths puts down a revolt by Hilderic, governor of Nîmes (France) and rival for the throne.",
    "Climax of the Siege of Thessalonica by the Slavs in a three-day assault on the city walls.",
    "The Battle of Karbala is won by the Umayyads under Yazid I.",
    "The Sixth Ecumenical Council commences in Constantinople.",
    "Twelfth Council of Toledo: King Erwig of the Visigoths initiates a council in which he implements diverse measures against the Jews in Spain.",
    "Pope Honorius I is posthumously excommunicated by the Sixth Ecumenical Council.",
    "Pope Leo II begins his pontificate.",
    "During the Siege of Mecca, the Kaaba catches fire and is burned down.",
    "Pope Benedict II is chosen.",
    "Maya king Yuknoom Yich'aak K'ahk' assumes the crown of Calakmul.",
    "Pope Sergius I is elected as a compromise between antipopes Paschal and Theodore."
  ]
}