{
  "years": [
    1992,
    1993,
    1994,
    1995
  ],
  "minYear": 1992,
  "maxYear": 1995,
  "events": [
    "President of Georgia Zviad Gamsakhurdia flees the country as a result of the military coup.",
    "The Assembly of the Serb People in Bosnia and Herzegovina proclaims the creation of Republika Srpska, a new state within Yugoslavia.",
    "During a visit to South Korea, Japanese Prime Minister Kiichi Miyazawa apologizes for forcing Korean women into sexual slavery during World War II.",
    "Rebel forces occupy Zaire's national radio station in Kinshasa and broadcast a demand for the government's resignation.",
    "Space Shuttle program: The space shuttle Discovery launches on STS-42 carrying Dr. Roberta Bondar, who becomes the first Canadian woman and the first neurologist in space.",
    "The Chief Judicial Magistrate of Bhopal court declares Warren Anderson, ex-CEO of Union Carbide, a fugitive under Indian law for failing to appear in the Bhopal disaster case.",
    "Dissolution of Czechoslovakia: Czechoslovakia is divided into the Czech Republic and Slovak Republic.",
    "In Moscow, Russia, George H. W. Bush and Boris Yeltsin sign the second Strategic Arms Reduction Treaty (START).",
    "Indian Border Security Force units kill 55 Kashmiri civilians in Sopore, Jammu and Kashmir, in revenge after militants ambushed a BSF patrol.",
    "The Fourth Republic of Ghana is inaugurated with Jerry Rawlings as president.",
    "Bosnian War: The Bosnian Army executes a surprise attack at the village of Kravica in Srebrenica.",
    "The Chemical Weapons Convention (CWC) is signed.",
    "The Zapatista Army of National Liberation initiates twelve days of armed conflict in the Mexican state of Chiapas.",
    "The North American Free Trade Agreement (NAFTA) comes into effect.",
    "American figure skater Nancy Kerrigan is attacked and injured by an assailant hired by her rival Tonya Harding's ex-husband during the U.S. Figure Skating Championships.",
    "The Irish Government announces the end of a 15-year broadcasting ban on the IRA and its political arm Sinn Féin.",
    "The spacecraft Clementine by BMDO and NASA is launched.",
    "The World Trade Organization comes into being.",
    "The Draupner wave in the North Sea in Norway is detected, confirming the existence of freak waves.",
    "Austria, Finland and Sweden join the EU.",
    "A chemical fire in an apartment complex in Manila, Philippines, leads to the discovery of plans for Project Bojinka, a mass-terrorist attack.",
    "An avalanche hits the Icelandic village Súðavík, destroying 25 homes and burying 26 people, 14 of whom died.",
    "After being struck by lightning the crew of Bristow Helicopters Flight 56C are forced to ditch. All 18 aboard are later rescued.",
    "The Norwegian rocket incident: Russia almost launches a nuclear attack after it mistakes Black Brant XII, a Norwegian research rocket, for a US Trident missile."
  ]
}