{
  "years": [
    1157,
    1158,
    1159,
    1160,
    1161,
    1167,
    1169,
    1170,
    1172,
    1173,
    1174,
    1176,
    1178,
    1179,
    1180
  ],
  "minYear": 1157,
  "maxYear": 1180,
  "events": [
    "Albert I of Brandenburg, also called The Bear (Ger: Albrecht der Bär), becomes the founder of the Margraviate of Brandenburg, Germany and the first margrave.",
    "The Battle of Grathe Heath ends the Danish Civil War.",
    "Vladislaus II, Duke of Bohemia becomes King of Bohemia.",
    "German city Munich (München) is first mentioned as forum apud Munichen in the Augsburg arbitration by Holy Roman Emperor Friedrich I.",
    "The city of Munich is founded by Henry the Lion on the banks of the river Isar.",
    "Pope Alexander III is chosen.",
    "Louis VII of France marries Adela of Champagne.",
    "Battle of Caishi: A Song dynasty fleet fights a naval engagement with Jin dynasty ships on the Yangtze river during the Jin-Song Wars.",
    "Jin-Song wars: Military officers conspire against the emperor Wanyan Liang of the Jin dynasty after a military defeat at the Battle of Caishi, and assassinate the emperor at his camp.",
    "Sicilian Chancellor Stephen du Perche moves the royal court to Messina to prevent a rebellion.",
    "Saladin becomes the emir of Egypt.",
    "Norman mercenaries land at Bannow Bay in Leinster, marking the beginning of the Norman invasion of Ireland.",
    "The Kingdom of Dublin falls to Norman invaders.",
    "Thomas Becket, Archbishop of Canterbury, is assassinated inside Canterbury Cathedral by followers of King Henry II; he subsequently becomes a saint and martyr in the Anglican Communion and the Catholic Church.",
    "Henry the Young King and Margaret of France are crowned junior king and queen of England.",
    "Construction of the campanile of the Cathedral of Pisa (now known as the Leaning Tower of Pisa) begins; it will take two centuries to complete.",
    "The widow Stamira sacrifices herself in order to raise the siege of Ancona by the forces of Emperor Frederick Barbarossa.",
    "Baldwin IV, 13, becomes King of Jerusalem, with Raymond III, Count of Tripoli as regent and William of Tyre as chancellor.",
    "The Hashshashin (Assassins) attempt to assassinate Saladin near Aleppo.",
    "Five Canterbury monks see an event believed to have been the formation of the Giordano Bruno crater on the moon. It is believed that the current oscillations of the Moon's distance from the Earth (on the order of meters) are a result of this collision.",
    "Philip II is crowned as 'King of France'.",
    "Emperor Antoku accedes to the throne of Japan.",
    "First Battle of Uji, starting the Genpei War in Japan.",
    "Genpei War: Battle of Ishibashiyama in Japan."
  ]
}