{
  "years": [
    1988,
    1989,
    1990,
    1991
  ],
  "minYear": 1988,
  "maxYear": 1991,
  "events": [
    "The Evangelical Lutheran Church in America comes into existence, creating the largest Lutheran denomination in the United States.",
    "Lee Teng-hui becomes the first native Taiwanese President of the Republic of China.",
    "In R v Morgentaler the Supreme Court of Canada strikes down all anti-abortion laws.",
    "Doug Williams becomes the first African-American quarterback to play in a Super Bowl and leads the Washington Redskins to victory in Super Bowl XXII.",
    "Manuel Noriega is indicted on drug smuggling and money laundering charges.",
    "Michael Jordan makes his signature slam dunk from the free throw line inspiring Air Jordan and the Jumpman logo.",
    "The Nagorno-Karabakh Autonomous Oblast votes to secede from Azerbaijan and join Armenia, triggering the First Nagorno-Karabakh War.",
    "Saddam Hussein begins the Anfal genocide against Kurds and Assyrians in northern Iraq.",
    "The Montreal Protocol comes into force, stopping the use of chemicals contributing to ozone depletion.",
    "Second Gulf of Sidra incident: A pair of Libyan MiG-23 \"Floggers\" are shot down by a pair of US Navy F-14 Tomcats during an air-to-air confrontation.",
    "Satwant Singh and Kehar Singh are sentenced to death for conspiracy in the assassination of Prime Minister Indira Gandhi; the two men are executed the same day.",
    "Notorious serial killer Ted Bundy, with over 30 known victims, is executed by the electric chair at the Florida State Prison.",
    "The American embassy in Kabul, Afghanistan is closed.",
    "Soviet-Afghan War: The last Soviet armoured column leaves Kabul.",
    "After a stroke two weeks previously, South African President P. W. Botha resigns as leader of the National Party, but stays on as president for six more months.",
    "David Dinkins is sworn in as New York City's first black mayor.",
    "United States invasion of Panama: Manuel Noriega, former leader of Panama, surrenders to American forces.",
    "Time Warner is formed by the merger of Time Inc. and Warner Communications.",
    "A seven-day pogrom breaks out against the Armenian civilian population of Baku, Azerbaijan, during which Armenians were beaten, tortured, murdered, and expelled from the city.",
    "Douglas Wilder becomes the first elected African American governor as he takes office as Governor of Virginia in Richmond, Virginia.",
    "Washington, D.C. Mayor Marion Barry is arrested for drug possession in an FBI sting.",
    "Protests in Azerbaijan, part of the Dissolution of the Soviet Union.",
    "Sharon Pratt Dixon becomes the first African American woman mayor of a major city and first woman Mayor of the District of Columbia.",
    "Somali Civil War: The United States Embassy to Somalia in Mogadishu is evacuated by helicopter airlift days after the outbreak of violence in Mogadishu."
  ]
}