{
  "years": [
    392,
    393,
    336,
    337,
    350,
    351,
    355,
    356,
    357,
    361,
    364,
    365,
    366,
    367,
    372,
    378,
    379,
    380,
    381
  ],
  "minYear": 336,
  "maxYear": 393,
  "events": [
    "First documentary sign of Christmas celebration in Rome.",
    "Constantine II, Constantius II, and Constans succeed their father Constantine I as co-emperors. The Roman Empire is divided between the three Augusti.",
    "Vetranio proclaims himself Caesar after being encouraged to do so by Constantina, sister of Constantius II.",
    "The Roman usurper Nepotianus, of the Constantinian dynasty, proclaims himself Roman emperor, entering Rome at the head of a group of gladiators.",
    "The Jewish revolt against Constantius Gallus breaks out after his arrival at Antioch.",
    "Claudius Silvanus, accused of treason, proclaims himself Roman Emperor against Constantius II.",
    "The anti-paganism policy of Constantius II forbids the worship of pagan idols in the Roman Empire.",
    "Emperor Constantius II enters Rome for the first time to celebrate his victory over Magnus Magnentius.",
    "Julian enters Constantinople as sole Roman Emperor.",
    "Valentinian I is proclaimed Roman emperor.",
    "Roman Emperor Valentinian I appoints his brother Flavius Valens co-emperor.",
    "Roman usurper Procopius bribes two legions passing by Constantinople, and proclaims himself emperor.",
    "The Alemanni cross the Rhine and invade Gaul. Emperor Valentinian I moves to Paris to command the army and defend the Gallic cities.",
    "Pope Damasus I is consecrated.",
    "Gratian, son of Roman Emperor Valentinian I, is named co-Augustus at the age of eight by his father.",
    "Sixteen Kingdoms: Jin Xiaowudi, age 10, succeeds his father Jin Jianwendi as Emperor of the Eastern Jin dynasty.",
    "General Siyaj K'ak' conquers Tikal, enlarging the domain of King Spearthrower Owl of Teotihuacán.",
    "Gothic War: Battle of Adrianople: A large Roman army led by Emperor Valens is defeated by the Visigoths. Valens is killed along with over half of his army.",
    "Yax Nuun Ahiin I is crowned as 15th Ajaw of Tikal",
    "Edict of Thessalonica: Emperor Theodosius I and his co-emperors Gratian and Valentinian II declare their wish that all Roman citizens convert to Nicene Christianity.",
    "Theodosius I makes his adventus, or formal entry, into Constantinople.",
    "The end of the First Council of Christian bishops convened in Constantinople by the Roman Emperor Theodosius I.",
    "Arbogast has Eugenius elected Western Roman Emperor.",
    "Roman emperor Theodosius I proclaims his eight-year-old son Honorius co-emperor."
  ]
}