{
  "years": [
    2008,
    2005,
    2006,
    2007
  ],
  "minYear": 2005,
  "maxYear": 2008,
  "events": [
    "The dwarf planet Eris is discovered by Palomar Observatory-based astronomers, later motivating the International Astronomical Union (IAU) to define the term planet for the first time.",
    "A train collision in Graniteville, South Carolina, United States, releases about 60 tons of chlorine gas.",
    "The nuclear sub USS San Francisco collides at full speed with an undersea mountain south of Guam. One man is killed, but the sub surfaces and is repaired.",
    "Mahmoud Abbas wins the election to succeed Yasser Arafat as President of the Palestinian National Authority, replacing interim president Rawhi Fattouh.",
    "The Sudan People's Liberation Movement and the Government of Sudan sign the Comprehensive Peace Agreement to end the Second Sudanese Civil War.",
    "Deep Impact launches from Cape Canaveral on a Delta II rocket.",
    "ESA's SMART-1 lunar orbiter discovers elements such as calcium, aluminum, silicon, iron, and other surface elements on the Moon.",
    "The Airbus A380, the world's largest commercial jet, is unveiled at a ceremony in Toulouse, France",
    "In Belmopan, Belize, the unrest over the government's new taxes erupts into riots.",
    "Ehud Olmert becomes acting Prime Minister of Israel after the incumbent, Ariel Sharon, suffers a second, apparently more serious stroke.",
    "Ellen Johnson Sirleaf is sworn in as Liberia's new president. She becomes Africa's first female elected head of state.",
    "Evo Morales is inaugurated as President of Bolivia, becoming the country's first indigenous president.",
    "Stephen Harper becomes Prime Minister of Canada.",
    "The last Mobile army surgical hospital (MASH) is decommissioned by the United States Army.",
    "A methane explosion in a coal mine near Nueva Rosita, Mexico, kills 65 miners.",
    "Bulgaria and Romania join the EU.",
    "The 110th United States Congress convenes, electing Nancy Pelosi as the first female Speaker of the House in U.S. history.",
    "Apple CEO Steve Jobs introduces the original iPhone at a Macworld keynote in San Francisco.",
    "A general strike begins in Guinea in an attempt to get President Lansana Conté to resign.",
    "The Doomsday Clock is set to five minutes to midnight in response to North Korea's nuclear testing.",
    "Turkish-Armenian journalist Hrant Dink is assassinated in front of his newspaper's Istanbul office by 17-year-old Turkish ultra-nationalist Ogün Samast.",
    "The Euphronios Krater is unveiled in Rome after being returned to Italy by the Metropolitan Museum of Art.",
    "A major tornado outbreak across the Southern United States kills 57.",
    "Rebel East Timorese soldiers seriously wound President José Ramos-Horta. Rebel leader Alfredo Reinado is killed in the attack."
  ]
}