{
  "years": [
    1641,
    1642,
    1643,
    1644
  ],
  "minYear": 1641,
  "maxYear": 1644,
  "events": [
    "Arauco War: The first Parliament of Quillín is celebrated, putting a temporary hold on hostilities between Mapuches and Spanish in Chile.",
    "Guaraní forces living in the Jesuit reductions defeat bandeirantes loyal to the Portuguese Empire at the Battle of Mbororé in present-day Panambí, Argentina.",
    "The Treaty of London between England and Scotland, ending the Bishops' Wars, is signed.",
    "Irish Catholic gentry from Ulster attempt to seize control of Dublin Castle, the seat of English rule in Ireland, so as to force concessions.",
    "Felim O'Neill of Kinard, the leader of the Irish Rebellion, issues his Proclamation of Dungannon, justifying the uprising and declaring continued loyalty to King Charles I of England.",
    "The Clergy Act becomes law, excluding bishops of the Church of England from serving in the House of Lords.",
    "Irish Confederate Wars: A Confederate Irish militia is routed in the Battle of Kilrush when it attempts to halt the progress of a Royalist Army.",
    "From this date all honors granted by Charles I of England are retroactively annulled by Parliament.",
    "Charles I raises his standard in Nottingham, which marks the beginning of the English Civil War.",
    "England's Long Parliament bans public stage-plays.",
    "The first commencement exercises occur at Harvard College.",
    "The Battle of Edgehill is the first major battle of the English Civil War.",
    "First English Civil War: Battle of Turnham Green: The Royalist forces withdraw in the face of the Parliamentarian army and fail to take London.",
    "Abel Tasman becomes the first European to discover the island Van Diemen's Land (later renamed Tasmania).",
    "Four-year-old Louis XIV becomes King of France upon the death of his father, Louis XIII.",
    "Thirty Years' War: French forces under the duc d'Enghien decisively defeat Spanish forces at the Battle of Rocroi, marking the symbolic end of Spain as a dominant land power.",
    "The Westminster Assembly is convened by the Parliament of England, without the assent of Charles I, in order to restructure the Church of England.",
    "First meeting of the Westminster Assembly, a council of theologians (\"divines\") and members of the Parliament of England appointed to restructure the Church of England, at Westminster Abbey in London.",
    "English Civil War: Battle of Roundway Down: In England, Henry Wilmot, 1st Earl of Rochester, commanding the Royalist forces, heavily defeats the Parliamentarian forces led by Sir William Waller.",
    "A Dutch fleet establishes a new colony in the ruins of Valdivia in southern Chile.",
    "The Third Anglo-Powhatan War begins in the Colony of Virginia.",
    "Transition from Ming to Qing: The Chongzhen Emperor, the last Emperor of Ming China, commits suicide during a peasant rebellion led by Li Zicheng.",
    "Ming general Wu Sangui forms an alliance with the invading Manchus and opens the gates of the Great Wall of China at Shanhaiguan pass, letting the Manchus through towards the capital Beijing.",
    "Portuguese Restoration War: Portuguese and Spanish forces both claim victory in the Battle of Montijo."
  ]
}