{
  "years": [
    1787,
    1788,
    1789
  ],
  "minYear": 1787,
  "maxYear": 1789,
  "events": [
    "The nationally known image of the Black Nazarene in the Philippines was transferred from what is now Rizal Park to its present shrine in the minor basilica of Quiapo Church. This is annually commemorated through its Traslación (solemn transfer) in the streets of Manila and is attended by millions of devotees.",
    "William Herschel discovers Titania and Oberon, two moons of Uranus.",
    "Militia led by General Benjamin Lincoln crush the remnants of Shays' Rebellion in Petersham, Massachusetts.",
    "After a delay of 11 days, the United States Constitutional Convention formally convenes in Philadelphia after a quorum of seven states is secured.",
    "Oliver Ellsworth moves at the Federal Convention to call the government the 'United States'.",
    "The Continental Congress enacts the Northwest Ordinance establishing governing rules for the Northwest Territory. It also establishes procedures for the admission of new states and limits the expansion of slavery.",
    "Sixty proof sheets of the Constitution of the United States are delivered to the Constitutional Convention in Philadelphia, Pennsylvania.",
    "The United States Constitution is signed in Philadelphia.",
    "The Congress of the Confederation votes to send the newly written United States Constitution to the state legislatures for approval.",
    "First edition of The Times of London, previously The Daily Universal Register, is published.",
    "Georgia becomes the fourth state to ratify the United States Constitution.",
    "Connecticut becomes the fifth state to ratify the United States Constitution.",
    "The second group of ships of the First Fleet arrive at Botany Bay.",
    "The third and main part of First Fleet arrives at Botany Bay, beginning the British colonization of Australia. Arthur Phillip decides that Port Jackson is a more suitable location for a colony.",
    "The British First Fleet, led by Arthur Phillip, sails into Port Jackson (Sydney Harbour) to establish Sydney, the first permanent European settlement on Australia. Celebrated as Australia Day.",
    "Massachusetts becomes the sixth state to ratify the United States Constitution.",
    "The Habsburg Empire joins the Russo-Turkish War in the Russian camp.",
    "The First Fleet arrives at Norfolk Island in order to found a convict settlement.",
    "The first American novel, The Power of Sympathy or the Triumph of Nature Founded in Truth by William Hill Brown, is printed in Boston.",
    "Georgetown College, the first Catholic university in the United States, is founded in Georgetown, Maryland (now a part of Washington, D.C.) when Bishop John Carroll, Rev. Robert Molyneux, and Rev. John Ashton purchase land for the proposed academy for the education of youth.",
    "Tây Sơn forces emerge victorious against Qing armies and liberate the capital Thăng Long.",
    "George Washington is unanimously elected as the first President of the United States by the U.S. Electoral College.",
    "In New York City, the first Congress of the United States meets, putting the United States Constitution into effect.",
    "John Adams sworn in as 1st US Vice President (nine days before George Washington)"
  ]
}