{
  "years": [
    929,
    932,
    934,
    935,
    936,
    937,
    938,
    939,
    915,
    917,
    919,
    920,
    921,
    923,
    927
  ],
  "minYear": 915,
  "maxYear": 939,
  "events": [
    "Pope John X crowns Berengar I of Italy as Holy Roman Emperor (probable date).",
    "Battle of Acheloos: Tsar Simeon I of Bulgaria decisively defeats a Byzantine army.",
    "Liu Yan declares himself emperor, establishing the Southern Han state in southern China, at his capital of Panyu.",
    "Romanos Lekapenos seizes the Boukoleon Palace in Constantinople and becomes regent of the Byzantine emperor Constantine VII.",
    "The second Fatimid invasion of Egypt begins, when the Fatimid heir-apparent, al-Qa'im bi-Amr Allah, sets out from Raqqada at the head of his army.",
    "The nobles of Franconia and Saxony elect Henry the Fowler at the Imperial Diet in Fritzlar as king of the East Frankish Kingdom.",
    "Rout of an alliance of Christian troops from Navarre and Léon against the Muslims at the Battle of Valdejunquera.",
    "Treaty of Bonn: The Frankish kings Charles the Simple and Henry the Fowler sign a peace treaty or 'pact of friendship' (amicitia) to recognize their borders along the Rhine.",
    "The Qarmatians of Bahrayn capture and pillage the city of Basra.",
    "King Constantine II of Scotland, King Hywel Dda of Deheubarth, Ealdred of Bamburgh and King Owain of the Cumbrians accepted the overlordship of King Æthelstan of England, leading to seven years of peace in the north.",
    "The Saracens conquer and destroy Taranto.",
    "The Sajid emir of Adharbayjan, Yusuf ibn Abi'l-Saj is defeated and captured by the Qarmatians near Kufa.",
    "Emir Abd-ar-Rahman III establishes the Caliphate of Córdoba.",
    "After a two-years siege, the city of Toledo, in Spain, surrenders to the forces of the Caliph of Córdoba Abd al-Rahman III, assuming an important victory in his campaign to subjugate the Central March.",
    "Abbasid caliph al-Muqtadir is killed while fighting against the forces of general Mu'nis al-Muzaffar. Al-Muqtadir's brother al-Qahir is chosen to succeed him.",
    "Meng Zhixiang declares himself emperor and establishes Later Shu as a new state independent of Later Tang.",
    "Duke Wenceslaus I of Bohemia is murdered by a group of nobles led by his brother Boleslaus I, who succeeds him.",
    "King Henry the Fowler dies in his royal palace in Memleben. He is succeeded by his son Otto I, who becomes the ruler of East Francia.",
    "Coronation of King Otto I of Germany.",
    "Shi Jingtang is enthroned as the first emperor of the Later Jin by Emperor Taizong of Liao, following a revolt against Emperor Fei of Later Tang.",
    "Ten Kingdoms: Li Bian usurps the throne and deposes Emperor Yang Pu. The Wu State is replaced by Li (now called \"Xu Zhigao\"), who becomes the first ruler of Southern Tang.",
    "Translation of the relics of martyr Wenceslaus I, Duke of Bohemia, Prince of the Czechs.",
    "The Battle of Alhandic is fought between Ramiro II of León and Abd-ar-Rahman III at Zamora in the context of the Spanish Reconquista. The battle resulted in a victory for the Emirate of Córdoba.",
    "Æthelstan, the first king of all England, dies and is succeeded by his half-brother, Edmund I."
  ]
}