{
  "years": [
    1888,
    1889,
    1890
  ],
  "minYear": 1888,
  "maxYear": 1890,
  "events": [
    "The National Geographic Society is founded in Washington, D.C.",
    "The premiere of the very first Romani language operetta is staged in Moscow, Russia.",
    "In England, The Football League, the world's oldest professional association football league, meets for the first time.",
    "Jack the Ripper: The first of 11 unsolved brutal murders of women committed in or near the impoverished Whitechapel district in the East End of London, occurs.",
    "In Southeast Asia, the North Borneo Chartered Company's territories become the British protectorate of North Borneo.",
    "With the passage of the Lei Áurea (\"Golden Law\"), Empire of Brazil abolishes slavery.",
    "Nikola Tesla delivers a lecture describing the equipment which will allow efficient generation and use of alternating currents to transmit electric power over long distances.",
    "The Rio de la Plata earthquake takes place.",
    "The Coca-Cola Company, then known as the Pemberton Medicine Company, is incorporated in Atlanta.",
    "Archduke Crown Prince Rudolf of Austria, heir to the Austro-Hungarian crown, is found dead with his mistress Baroness Mary Vetsera in the Mayerling.",
    "US president Grover Cleveland signs a bill elevating the United States Department of Agriculture to a Cabinet-level agency.",
    "Meiji Constitution of Japan is adopted.",
    "Antonín Dvořák's Jakobín is premiered at National Theater in Prague",
    "President Grover Cleveland signs a bill admitting North Dakota, South Dakota, Montana and Washington as U.S. states.",
    "The Ahmadiyya Muslim Community is established by Mirza Ghulam Ahmad in Qadian, British India.",
    "The Eiffel Tower is officially opened.",
    "Eritrea is consolidated into a colony by the Italian government.",
    "The United Mine Workers of America is founded in Columbus, Ohio.",
    "Nellie Bly completes her round-the-world journey in 72 days.",
    "Chancellor of the German Empire Otto von Bismarck is dismissed by Emperor Wilhelm II.",
    "The Pan-American Union is founded by the First International Conference of American States in Washington, D.C.",
    "Canada and Bermuda are linked by telegraph cable.",
    "The U.S. Congress passes the Sherman Antitrust Act.",
    "Idaho is admitted as the 43rd U.S. state."
  ]
}