{
  "years": [
    1377,
    1378,
    1380,
    1381,
    1382,
    1383,
    1384,
    1386,
    1371,
    1373,
    1374
  ],
  "minYear": 1371,
  "maxYear": 1386,
  "events": [
    "Robert II becomes King of Scotland, beginning the Stuart dynasty.",
    "Serbian-Turkish wars: Ottoman Turks fought against a Serbian army at the Battle of Maritsa.",
    "Julian of Norwich, a Christian mystic and anchoress, experiences the deathbed visions described in her Revelations of Divine Love.",
    "A sudden outbreak of St. John's Dance causes people in the streets of Aachen, Germany, to experience hallucinations and begin to jump and twitch uncontrollably until they collapse from exhaustion.",
    "Pope Gregory XI reaches Rome, after deciding to move the Papacy back to Rome from Avignon.",
    "King Richard II of England is crowned.",
    "Russian troops are defeated by forces of the Blue Horde Khan Arapsha in the Battle on Pyana River.",
    "Tvrtko I is crowned the first king of Bosnia.",
    "Cardinal Robert of Geneva is elected as Pope Clement VII, beginning the Papal schism.",
    "Battle of Kulikovo: Russian forces defeat a mixed army of Tatars and Mongols, stopping their advance.",
    "Beginning of the Peasants' Revolt in England.",
    "Peasants' Revolt: In England, rebels assemble at Blackheath, just outside London.",
    "In England, the Peasants' Revolt, led by Wat Tyler, comes to a head, as rebels set fire to the Savoy Palace.",
    "Richard II of England meets leaders of Peasants' Revolt at Mile End. The Tower of London is stormed by rebels who enter without resistance.",
    "John Ball, a leader in the Peasants' Revolt, is hanged, drawn and quartered in the presence of King Richard II of England.",
    "Siege of Moscow: The Golden Horde led by Tokhtamysh lays siege to the capital of the Grand Duchy of Moscow.",
    "Louis the Great's daughter, Mary, is crowned \"king\" of Hungary.",
    "The male line of the Portuguese House of Burgundy becomes extinct with the death of King Fernando, leaving only his daughter Beatrice. Rival claimants begin a period of civil war and disorder.",
    "Jadwiga is crowned King of Poland, although she is a woman.",
    "King Charles III of Naples and Hungary is assassinated at Buda.",
    "Władysław II Jagiełło (Jogaila) is crowned King of Poland.",
    "England and Portugal formally ratify their alliance with the signing of the Treaty of Windsor, making it the oldest diplomatic alliance in the world which is still in force.",
    "The Old Swiss Confederacy makes great strides in establishing control over its territory by soundly defeating the Duchy of Austria in the Battle of Sempach.",
    "Karl Topia, the ruler of Princedom of Albania forges an alliance with the Republic of Venice, committing to participate in all wars of the Republic and receiving coastal protection against the Ottomans in return."
  ]
}