{
  "years": [
    1877,
    1878,
    1879
  ],
  "minYear": 1877,
  "maxYear": 1879,
  "events": [
    "Queen Victoria of the United Kingdom is proclaimed Empress of India.",
    "Crazy Horse and his warriors fight their last battle against the United States Cavalry at Wolf Mountain, Montana Territory.",
    "The last day of the Constantinople Conference results in agreement for political reforms in the Balkans.",
    "Tchaikovsky's ballet Swan Lake receives its premiere at the Bolshoi Theatre in Moscow.",
    "First ever official cricket test match is played: Australia vs England at the MCG Stadium, in Melbourne, Australia.",
    "The United Kingdom annexes the Transvaal.",
    "Russo-Turkish War: Russian Empire declares war on Ottoman Empire.",
    "American Indian Wars: Sitting Bull leads his band of Lakota into Canada to avoid harassment by the United States Army under Colonel Nelson Miles.",
    "Chief Crazy Horse of the Oglala Lakota surrenders to United States troops in Nebraska.",
    "Umberto I becomes King of Italy.",
    "Yale Daily News becomes the first independent daily college newspaper in the United States.",
    "John Tunstall is murdered by outlaw Jesse Evans, sparking the Lincoln County War in Lincoln County, New Mexico.",
    "Thomas Edison patents the phonograph.",
    "The first telephone directory is issued in New Haven, Connecticut.",
    "The Russo-Turkish War ends with Bulgaria regaining its independence from the Ottoman Empire according to the Treaty of San Stefano.",
    "The Anglo-Zulu War begins.",
    "The Battle of Isandlwana during the Anglo-Zulu War results in a British defeat.",
    "Anglo-Zulu War: The Battle of Rorke's Drift ends.",
    "The Bulgarian National Bank is founded.",
    "Sandford Fleming first proposes adoption of Universal Standard Time at a meeting of the Royal Canadian Institute.",
    "The England cricket team led by Lord Harris is attacked in a riot during a match in Sydney.",
    "The War of the Pacific breaks out when the Chilean Army occupies the Bolivian port city of Antofagasta.",
    "Women's rights: US President Rutherford B. Hayes signs a bill allowing female attorneys to argue cases before the Supreme Court of the United States.",
    "In Utica, New York, Frank Woolworth opens the first of many of five-and-dime Woolworth stores."
  ]
}