{
  "years": [
    224,
    193,
    226,
    229,
    230,
    235,
    236,
    238,
    176,
    240,
    211,
    180,
    254,
    247,
    217,
    218,
    221,
    190
  ],
  "minYear": 176,
  "maxYear": 254,
  "events": [
    "Emperor Marcus Aurelius grants his son Commodus the rank of \"Imperator\" and makes him Supreme Commander of the Roman legions.",
    "Commodus becomes sole emperor of the Roman Empire at the age of eighteen, following the death of his father, Marcus Aurelius.",
    "Twelve inhabitants of Scillium (near Kasserine, modern-day Tunisia) in North Africa are executed for being Christians. This is the earliest record of Christianity in that part of the world.",
    "Dong Zhuo has his troops evacuate the capital Luoyang and burn it to the ground.",
    "The Senate chooses Pertinax against his will to succeed Commodus as Roman emperor.",
    "After assassinating the Roman Emperor Pertinax, his Praetorian Guards auction off the throne to Didius Julianus.",
    "The distinguished soldier Septimus Severus is proclaimed emperor by the army in Illyricum.",
    "Following the death of the Roman Emperor Septimius Severus at Eboracum (modern York, England) while preparing to lead a campaign against the Caledonians, the empire is left in the control of his two quarrelling sons, Caracalla and Geta, whom he had instructed to make peace.",
    "Roman emperor Caracalla is assassinated and is succeeded by his Praetorian Guard prefect, Marcus Opellius Macrinus.",
    "Battle of Antioch: With the support of the Syrian legions, Elagabalus defeats the forces of emperor Macrinus.",
    "Liu Bei, Chinese warlord, proclaims himself emperor of Shu Han, the successor of the Han dynasty.",
    "The Battle of Hormozdgan is fought. Ardashir I defeats and kills Artabanus V effectively ending the Parthian Empire.",
    "Cao Rui succeeds his father as emperor of the Kingdom of Wei.",
    "On his death, at Cutilia, Vespasian is deified. He is succeeded by his elder son Titus, who is responsible for the capture of Jerusalem in 70. Titus appoints his younger brother Flavius Domitianus as heir.",
    "Sun Quan proclaims himself emperor of Eastern Wu.",
    "Pope Pontian succeeds Urban I as the eighteenth pope.",
    "Maximinus Thrax is proclaimed Roman emperor.",
    "Pope Anterus succeeds Pontian as the nineteenth pope. During the persecutions of emperor Maximinus Thrax he is martyred.",
    "Pope Fabian succeeds Anterus to become the twentieth pope of Rome.",
    "Year of the Six Emperors: The Roman Senate outlaws emperor Maximinus Thrax for his bloodthirsty proscriptions in Rome and nominates two of its members, Pupienus and Balbinus, to the throne.",
    "The Praetorian Guard storm the palace and capture Pupienus and Balbinus. They are dragged through the streets of Rome and executed. On the same day, Gordian III, age 13, is proclaimed emperor, the sixth emperor of the year.",
    "Shapur I becomes co-emperor of the Sasanian Empire with his father Ardashir I.",
    "Philip the Arab marks the millennium of Rome with a celebration of the ludi seaculares.",
    "Pope Stephen I succeeds Pope Lucius I, becoming the 23rd pope of the Catholic Church, and immediately takes a stand against Novatianism."
  ]
}