{
  "years": [
    1602,
    1603,
    1604,
    1605,
    1606,
    1607
  ],
  "minYear": 1602,
  "maxYear": 1607,
  "events": [
    "The Dutch East India Company is established.",
    "Cape Cod sighted by English navigator Bartholomew Gosnold.",
    "An English naval force defeats a fleet of Spanish galleys, and captures a large Portuguese carrack at the Battle of Sesimbra Bay",
    "Eighty Years' War and the Anglo-Spanish War: A fleet of Spanish galleys are defeated by English and Dutch galleons in the English Channel.",
    "The Bodleian Library at the University of Oxford is opened to the public.",
    "A surprise attack by forces under the command of Charles Emmanuel I, Duke of Savoy, and his brother-in-law, Philip III of Spain, is repelled by the citizens of Geneva. (Commemorated annually by the Fête de l'Escalade.)",
    "James VI of Scotland is proclaimed King James I of England and Ireland, upon the death of Elizabeth I.",
    "Tokugawa Ieyasu is granted the title of shōgun from Emperor Go-Yōzei, and establishes the Tokugawa shogunate in Edo, Japan.",
    "English explorer, writer and courtier Sir Walter Raleigh goes on trial for treason.",
    "The Masque of Indian and China Knights is performed by courtiers of James VI and I at Hampton Court.",
    "Samuel de Champlain discovers the mouth of the Saint John River, site of Reversing Falls and the present-day city of Saint John, New Brunswick, Canada.",
    "Adi Granth, now known as Guru Granth Sahib, the holy scripture of Sikhs, is first installed at Harmandir Sahib.",
    "Kepler's Supernova is the most recent supernova to be observed within the Milky Way.",
    "William Shakespeare's tragedy Othello is performed for the first time, at Whitehall Palace in London.",
    "The first edition of El ingenioso hidalgo Don Quijote de la Mancha (Book One of Don Quixote) by Miguel de Cervantes is published in Madrid, Spain.",
    "The city of Oulu, Finland, is founded by Charles IX of Sweden.",
    "The armies of Sweden are defeated by the Polish-Lithuanian Commonwealth in the Battle of Kircholm.",
    "Gunpowder Plot: Guy Fawkes is arrested.",
    "Robert Catesby, ringleader of the Gunpowder Plotters, is killed.",
    "The Virginia Company of London is established by royal charter by James I of England with the purpose of establishing colonial settlements in North America.",
    "The Union Flag is adopted as the flag of English and Scottish ships.",
    "The ships Susan Constant, Godspeed, and Discovery depart England carrying settlers who founded, at Jamestown, Virginia, the first of the thirteen colonies that became the United States.",
    "San Agustin Church in Manila is officially completed; it is the oldest church still standing in the Philippines.",
    "L'Orfeo by Claudio Monteverdi, one of the first works recognized as an opera, receives its première performance."
  ]
}