{
  "years": [
    1922,
    1923,
    1924
  ],
  "minYear": 1922,
  "maxYear": 1924,
  "events": [
    "Dáil Éireann ratifies the Anglo-Irish Treaty by a 64-57 vote.",
    "Leonard Thompson becomes the first person to be injected with insulin.",
    "Ulysses by James Joyce is published.",
    "The Washington Naval Treaty is signed in Washington, D.C., limiting the naval armaments of United States, Britain, Japan, France, and Italy.",
    "United States President Warren G. Harding introduces the first radio set in the White House.",
    "Brazil becomes a member of the Berne Convention copyright treaty.",
    "A challenge to the Nineteenth Amendment to the United States Constitution, allowing women the right to vote, is rebuffed by the Supreme Court of the United States in Leser v. Garnett.",
    "The United Kingdom ends its protectorate over Egypt through a Unilateral Declaration of Independence.",
    "Mahatma Gandhi is arrested in India, tried for sedition, and sentenced to six years in prison, only to be released after nearly two years for an appendicitis operation.",
    "Britain's Railways are grouped into the Big Four: LNER, GWR, SR, and LMS.",
    "Juan de la Cierva makes the first autogyro flight.",
    "Lithuanian residents of the Memel Territory rebel against the League of Nations' decision to leave the area as a mandated region under French control.",
    "Occupation of the Ruhr: Troops from France and Belgium occupy the Ruhr area to force Germany to make its World War I reparation payments.",
    "Texas Tech University is founded as Texas Technological College in Lubbock, Texas.",
    "Greece becomes the last European country to adopt the Gregorian calendar.",
    "Howard Carter unseals the burial chamber of Pharaoh Tutankhamun.",
    "The Arts Club of Chicago hosts the opening of Pablo Picasso's first United States showing, entitled Original Drawings by Pablo Picasso, becoming an early proponent of modern art in the United States.",
    "Insulin becomes generally available for use by people with diabetes.",
    "The Duke of York weds Lady Elizabeth Bowes-Lyon at Westminster Abbey.",
    "Ramsay MacDonald becomes the first Labour Prime Minister of the United Kingdom.",
    "Six days after his death Lenin's body is carried into a specially erected mausoleum.",
    "Russia-United Kingdom relations are restored, over six years after the Communist revolution.",
    "The Royal Greenwich Observatory begins broadcasting the hourly time signals known as the Greenwich Time Signal.",
    "Capital punishment: The first state execution in the United States by gas chamber takes place in Nevada."
  ]
}