{
  "years": [
    1939,
    1940,
    1941,
    1942,
    1943
  ],
  "minYear": 1939,
  "maxYear": 1943,
  "events": [
    "Norway claims Queen Maud Land in Antarctica.",
    "Spanish Civil War: Catalonia Offensive: Troops loyal to nationalist General Francisco Franco and aided by Italy take Barcelona.",
    "First flight of the Lockheed P-38 Lightning.",
    "Generalísimo Francisco Franco becomes the 68th \"Caudillo de España\", or Leader of Spain.",
    "As part of British air raid precautions, the first of 2.mw-parser-output .frac{white-space:nowrap}.mw-parser-output .frac .num,.mw-parser-output .frac .den{font-size:80%;line-height:0;vertical-align:super}.mw-parser-output .frac .den{vertical-align:sub}.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px}1⁄2 million Anderson shelters is constructed in a garden in Islington, north London.",
    "United States labor law: The U.S. Supreme Court rules in NLRB v. Fansteel Metallurgical Corp. that the National Labor Relations Board has no authority to force an employer to rehire workers who engage in sit-down strikes.",
    "Winter War: Battle of Raate Road: The Finnish 9th Division finally defeat the numerically superior Soviet forces on the Raate-Suomussalmi road.",
    "World War II: Britain introduces food rationing.",
    "Three trains on the Nishinari Line; present Sakurajima Line, in Osaka, Japan, collide and explode while approaching Ajikawaguchi Station. One hundred and eighty-one people are killed.",
    "The second full-length animated Walt Disney film, Pinocchio, premieres.",
    "The Soviet Union begins mass deportations of Polish citizens from occupied eastern Poland to Siberia.",
    "Martin Kamen and Sam Ruben discover carbon-14.",
    "For her performance as Mammy in Gone with the Wind, Hattie McDaniel becomes the first African American to win an Academy Award.",
    "Finland initiates Winter War peace negotiations.",
    "Amy Johnson, a 37-year-old pilot and the first woman to fly solo from London to Australia, disappears after bailing out of her plane over the River Thames, and is presumed dead.",
    "Franco-Thai War: Vichy French forces inflict a decisive defeat over the Royal Thai Navy.",
    "The Declaration by United Nations is signed by twenty-six nations.",
    "The Federal Bureau of Investigation (FBI) obtains the conviction of 33 members of a German spy ring headed by Fritz Joubert Duquesne in the largest espionage case in United States history—the Duquesne Spy Ring.",
    "Henry Ford patents a soybean car, which is 30% lighter than a regular car.",
    "The Holocaust: Nazi Germany begins deporting Jews from the Łódź Ghetto to Chełmno extermination camp.",
    "The Republic of China agrees to the Sino-British New Equal Treaty and the Sino-American New Equal Treaty.",
    "Italian-American anarchist Carlo Tresca is assassinated in New York City.",
    "The Pentagon is dedicated in Arlington, Virginia.",
    "Warsaw Ghetto Uprising: The first uprising of Jews in the Warsaw Ghetto."
  ]
}