{
  "years": [
    1809,
    1810,
    1811,
    1812
  ],
  "minYear": 1809,
  "maxYear": 1812,
  "events": [
    "Combined British, Portuguese and colonial Brazilian forces begin the Invasion of Cayenne during the Napoleonic Wars.",
    "Peninsular War: The British defeat the French at the Battle of La Coruña.",
    "The Territory of Illinois is created by the 10th United States Congress.",
    "London's Drury Lane Theatre burns to the ground, leaving its owner, Irish writer and politician Richard Brinsley Sheridan, destitute.",
    "King Gustav IV Adolf of Sweden abdicates after a coup d'état. At the Diet of Porvoo, Finland's four Estates pledge allegiance to Alexander I of Russia, commencing the secession of the Grand Duchy of Finland from Sweden.",
    "Napoleonic Wars: The War of the Fifth Coalition begins when forces of the Austrian Empire invade Bavaria.",
    "Major-General Lachlan Macquarie officially becomes Governor of New South Wales.",
    "Venezuela achieves home rule: Vicente Emparán, Governor of the Captaincy General is removed by the people of Caracas and a junta is installed.",
    "May Revolution: Citizens of Buenos Aires expel Viceroy Baltasar Hidalgo de Cisneros during the \"May Week\", starting the Argentine War of Independence.",
    "The newspaper Gazeta de Buenos Ayres is first published in Argentina.",
    "John Jacob Astor forms the Pacific Fur Company.",
    "Citizens of Bogotá, New Granada declare independence from Spain.",
    "Charles Deslondes leads an unsuccessful slave revolt in the North American settlements of St. Charles and St. James, Louisiana.",
    "Leaders of the Mamluk dynasty are killed by Egyptian ruler Muhammad Ali.",
    "Argentine War of Independence: A royalist fleet defeats a small flotilla of revolutionary ships in the Battle of San Nicolás on the River Plate.",
    "Paraguayan forces defeat Manuel Belgrano at the Battle of Tacuarí.",
    "A French and Italian fleet is defeated by a British squadron off the island of Vis in the Adriatic during the Napoleonic Wars.",
    "Percy Bysshe Shelley is expelled from the University of Oxford for publishing the pamphlet The Necessity of Atheism.",
    "The first steamboat on the Ohio River or the Mississippi River arrives in New Orleans, 82 days after departing from Pittsburgh.",
    "The strongest in a series of earthquakes strikes New Madrid, Missouri.",
    "Massachusetts governor Elbridge Gerry is accused of \"gerrymandering\" for the first time.",
    "Poet Lord Byron gives his first address as a member of the House of Lords, in defense of Luddite violence against Industrialism in his home county of Nottinghamshire.",
    "An earthquake devastates Caracas, Venezuela.",
    "A political cartoon in the Boston Gazette coins the term \"gerrymander\" to describe oddly shaped electoral districts designed to help incumbents win reelection."
  ]
}