{
  "years": [
    1626,
    1627,
    1628,
    1629,
    1630,
    1631
  ],
  "minYear": 1626,
  "maxYear": 1631,
  "events": [
    "Yuan Chonghuan is appointed Governor of Liaodong, after leading the Chinese into a great victory against the Manchurians under Nurhaci.",
    "Dutch explorer Peter Minuit arrives in New Netherland (present day Manhattan Island) aboard the See Meeuw.",
    "Peter Minuit buys Manhattan.",
    "The new St Peter's Basilica is consecrated.",
    "The Polish-Lithuanian Commonwealth Navy has its greatest and last victory in the Battle of Oliwa.",
    "Writs issued in February by Charles I of England mandate that every county in England (not just seaport towns) pay ship tax by this date.",
    "The Massachusetts Bay Colony is granted a Royal charter.",
    "The Petition of Right, a major English constitutional document, is granted the Royal Assent by Charles I and becomes law.",
    "The Swedish warship Vasa sinks in the Stockholm harbour after only about 20 minutes of her maiden voyage.",
    "George Villiers, the first Duke of Buckingham, is assassinated by John Felton.",
    "Puritans settle Salem, which became part of Massachusetts Bay Colony.",
    "French Wars of Religion: The Siege of La Rochelle ends with the surrender of the Huguenots after fourteen months.",
    "Charles I dissolves the Parliament of England, beginning the eleven-year period known as the Personal Rule.",
    "Holy Roman Emperor Ferdinand II and Danish King Christian IV sign the Treaty of Lübeck ending Danish intervention in the Thirty Years' War.",
    "Dutch forces led by Hendrick Lonck capture Olinda in what was to become part of Dutch Brazil.",
    "Thirty Years' War: Four thousand Swedish troops under Gustavus Adolphus land in Pomerania, Germany.",
    "Portuguese forces are defeated by the Kingdom of Kandy at the Battle of Randeniwela in Sri Lanka.",
    "The city of Boston, Massachusetts is founded.",
    "Frendraught Castle in Scotland, the home of James Crichton of Frendraught, burns down.",
    "In Dorchester, Massachusetts, John Winthrop takes the oath of office and becomes the first Governor of Massachusetts.",
    "Publication of Gazette de France, the first French newspaper.",
    "Mumtaz Mahal dies during childbirth. Her husband, Mughal emperor Shah Jahan I, will spend the next 17 years building her mausoleum, the Taj Mahal.",
    "The Sack of Baltimore: The Irish village of Baltimore is attacked by Algerian pirates.",
    "Sweden wins a major victory at the Battle of Breitenfeld against the Holy Roman Empire during the Thirty Years' War."
  ]
}