{
  "years": [
    355,
    324,
    325,
    326,
    356,
    328,
    361,
    332,
    333,
    364,
    365,
    336,
    366,
    367,
    372,
    378,
    350,
    351
  ],
  "minYear": 324,
  "maxYear": 378,
  "events": [
    "Battle of Adrianople: Constantine I defeats Licinius, who flees to Byzantium.",
    "Constantine the Great decisively defeats Licinius in the Battle of Chrysopolis, establishing Constantine's sole control over the Roman Empire.",
    "The First Council of Nicaea is formally opened, starting the first ecumenical council of the Christian Church.",
    "The original Nicene Creed is adopted at the First Council of Nicaea.",
    "The old St. Peter's Basilica is consecrated by Pope Sylvester I.",
    "Athanasius is elected Patriarch of Alexandria.",
    "The official opening of Constantine's Bridge built over the Danube between Sucidava (Corabia, Romania) and Oescus (Gigen, Bulgaria) by the Roman architect Theophilus Patricius.",
    "Emperor Constantine the Great announces free distributions of food to the citizens in Constantinople.",
    "Roman Emperor Constantine the Great elevates his youngest son Constans to the rank of Caesar.",
    "First documentary sign of Christmas celebration in Rome.",
    "Vetranio proclaims himself Caesar after being encouraged to do so by Constantina, sister of Constantius II.",
    "The Roman usurper Nepotianus, of the Constantinian dynasty, proclaims himself Roman emperor, entering Rome at the head of a group of gladiators.",
    "The Jewish revolt against Constantius Gallus breaks out after his arrival at Antioch.",
    "Claudius Silvanus, accused of treason, proclaims himself Roman Emperor against Constantius II.",
    "The anti-paganism policy of Constantius II forbids the worship of pagan idols in the Roman Empire.",
    "Julian enters Constantinople as sole Roman Emperor.",
    "Valentinian I is proclaimed Roman emperor.",
    "Roman usurper Procopius bribes two legions passing by Constantinople, and proclaims himself emperor.",
    "The Alemanni cross the Rhine and invade Gaul. Emperor Valentinian I moves to Paris to command the army and defend the Gallic cities.",
    "Pope Damasus I is consecrated.",
    "Gratian, son of Roman Emperor Valentinian I, is named co-Augustus at the age of eight by his father.",
    "Sixteen Kingdoms: Jin Xiaowudi, age 10, succeeds his father Jin Jianwendi as Emperor of the Eastern Jin dynasty.",
    "General Siyaj K'ak' conquers Tikal, enlarging the domain of King Spearthrower Owl of Teotihuacán.",
    "Gothic War: Battle of Adrianople: A large Roman army led by Emperor Valens is defeated by the Visigoths. Valens is killed along with over half of his army."
  ]
}