{
  "years": [
    320,
    324,
    325,
    326,
    328,
    332,
    333,
    336,
    306,
    307,
    308,
    309,
    311,
    313,
    314,
    315,
    350,
    351
  ],
  "minYear": 306,
  "maxYear": 351,
  "events": [
    "Martyrdom of Saint Adrian of Nicomedia.",
    "Constantine I is proclaimed Roman emperor by his troops.",
    "Maxentius is proclaimed Roman emperor.",
    "Jin Huaidi becomes emperor of China in succession to his father, Jin Huidi, despite a challenge from his uncle, Sima Ying.",
    "After divorcing his wife Minervina, Constantine marries Fausta, daughter of the retired Roman emperor Maximian.",
    "At Carnuntum, Emperor emeritus Diocletian confers with Galerius, Augustus of the East, and Maximianus, the recently returned former Augustus of the West, in an attempt to end the civil wars of the Tetrarchy.",
    "Pope Eusebius is banished by the Emperor Maxentius to Sicily, where he dies, perhaps from a hunger strike.",
    "The Diocletianic Persecution of Christians in the Roman Empire ends.",
    "The decisions of the Edict of Milan, signed by Constantine the Great and co-emperor Valerius Licinius, granting religious freedom throughout the Roman Empire, are published in Nicomedia.",
    "Pope Sylvester I is consecrated, as successor to the late Pope Miltiades.",
    "The Arch of Constantine is completed near the Colosseum in Rome to commemorate Constantine I's victory over Maxentius at the Milvian Bridge.",
    "Pappus of Alexandria, Greek philosopher, observes an eclipse of the Sun and writes a commentary on The Great Astronomer (Almagest).",
    "Battle of Adrianople: Constantine I defeats Licinius, who flees to Byzantium.",
    "The First Council of Nicaea is formally opened, starting the first ecumenical council of the Christian Church.",
    "The original Nicene Creed is adopted at the First Council of Nicaea.",
    "The old St. Peter's Basilica is consecrated by Pope Sylvester I.",
    "Athanasius is elected Patriarch of Alexandria.",
    "The official opening of Constantine's Bridge built over the Danube between Sucidava (Corabia, Romania) and Oescus (Gigen, Bulgaria) by the Roman architect Theophilus Patricius.",
    "Emperor Constantine the Great announces free distributions of food to the citizens in Constantinople.",
    "Roman Emperor Constantine the Great elevates his youngest son Constans to the rank of Caesar.",
    "First documentary sign of Christmas celebration in Rome.",
    "Vetranio proclaims himself Caesar after being encouraged to do so by Constantina, sister of Constantius II.",
    "The Roman usurper Nepotianus, of the Constantinian dynasty, proclaims himself Roman emperor, entering Rome at the head of a group of gladiators.",
    "The Jewish revolt against Constantius Gallus breaks out after his arrival at Antioch."
  ]
}