{
  "years": [
    1952,
    1953,
    1954,
    1951
  ],
  "minYear": 1951,
  "maxYear": 1954,
  "events": [
    "Korean War: Chinese and North Korean forces capture Seoul for the second time.",
    "First Indochina War: The Battle of Vĩnh Yên begins.",
    "Nuclear testing at the Nevada Test Site begins with Operation Ranger.",
    "United Nations Security Council Resolution 90 relating to the Korean War is adopted.",
    "The Canadian Army enters combat in the Korean War.",
    "NBC's long-running morning news program Today debuts, with host Dave Garroway.",
    "Black Saturday in Egypt: rioters burn Cairo's central business district, targeting British and upper-class Egyptian businesses.",
    "Elizabeth II becomes Queen of the United Kingdom and her other Realms and Territories and Head of the Commonwealth upon the death of her father, George VI. At the exact moment of succession, she was in a tree house at the Treetops Hotel in Kenya.",
    "King George VI of the United Kingdom is buried in St George's Chapel, Windsor Castle.",
    "Emmett Ashford becomes the first African-American umpire in organized baseball by being authorized to be a substitute umpire in the Southwestern International League.",
    "The British government, under Winston Churchill, abolishes identity cards in the UK to \"set the people free\".",
    "The Bengali Language Movement protests occur at the University of Dhaka in East Pakistan (now Bangladesh).",
    "Vincent Massey is sworn in as the first Canadian-born Governor General of Canada.",
    "Fulgencio Batista leads a successful coup in Cuba.",
    "Frances P. Bolton and her son, Oliver from Ohio, become the first mother and son to serve simultaneously in the U.S. Congress.",
    "The play Waiting for Godot by Samuel Beckett receives its première in Paris.",
    "An article appears in Pravda accusing some of the most prestigious and prominent doctors, mostly Jews, in the Soviet Union of taking part in a vast plot to poison members of the top Soviet political and military leadership.",
    "Josip Broz Tito is elected the first President of Yugoslavia.",
    "Almost 72 percent of all television sets in the United States are tuned into I Love Lucy to watch Lucy give birth.",
    "The Batepá massacre occurred in São Tomé when the colonial administration and Portuguese landowners unleashed a wave of violence against the native creoles known as forros.",
    "Cold War: U.S. President Dwight D. Eisenhower denies all appeals for clemency for Julius and Ethel Rosenberg.",
    "Israeli-Soviet relations are severed.",
    "Book censorship in the United States: The Georgia Literature Commission is established.",
    "India establishes its highest civilian awards, the Bharat Ratna and the Padma Vibhushan."
  ]
}