{
  "years": [
    1580,
    1581,
    1582,
    1583,
    1584,
    1585
  ],
  "minYear": 1580,
  "maxYear": 1585,
  "events": [
    "One of the largest earthquakes recorded in the history of England, Flanders, or Northern France, takes place.",
    "The Ostrog Bible, one of the early printed Bibles in a Slavic language, is published.",
    "War of the Portuguese Succession: Spanish victory at the Battle of Alcântara brings about the Iberian Union.",
    "Francis Drake finishes his circumnavigation of the Earth in Plymouth, England.",
    "Plakkaat van Verlatinghe (Act of Abjuration): The northern Low Countries declare their independence from the Spanish king, Philip II.",
    "Truce of Yam-Zapolsky: Russia cedes Livonia to the Polish-Lithuanian Commonwealth.",
    "With the papal bull Inter gravissimas, Pope Gregory XIII announces the Gregorian calendar.",
    "Spanish conquistador Hernando de Lerma founds the settlement of Salta, Argentina.",
    "Sengoku period: Oda Nobunaga, the most powerful of the Japanese daimyōs, is forced to commit suicide by his own general Akechi Mitsuhide.",
    "Battle of Yamazaki: Toyotomi Hideyoshi defeats Akechi Mitsuhide.",
    "The Gregorian Calendar is introduced by Pope Gregory XIII.",
    "Adoption of the Gregorian calendar begins, eventually leading to near-universal adoption.",
    "Sir Humphrey Gilbert establishes the first English colony in North America, at what is now St. John's, Newfoundland and Labrador.",
    "Cologne War: Forces under Ernest of Bavaria defeat troops under Gebhard Truchsess von Waldburg at the Siege of Godesberg.",
    "A naval expedition led by Pedro Sarmiento de Gamboa founds Nombre de Jesús, the first of two short-lived Spanish settlements in the Strait of Magellan.",
    "Sir Walter Raleigh is granted a patent to colonize Virginia.",
    "Santiago de Vera becomes sixth Governor-General of the Spanish colony of the Philippines.",
    "Philip Amadas and Arthur Barlowe arrive at Roanoke Island",
    "William I of Orange is assassinated in his home in Delft, Holland, by Balthasar Gérard.",
    "San Lorenzo del Escorial Palace in Madrid is finished.",
    "Walter Raleigh is knighted, shortly after renaming North America region \"Virginia\", in honor of Elizabeth I, Queen of England, sometimes referred to as the \"Virgin Queen\".",
    "The Olympic Theatre, designed by Andrea Palladio, is inaugurated in Vicenza.",
    "The Treaty of Nemours abolishes tolerance to Protestants in France.",
    "John Davis enters Cumberland Sound in search of the Northwest Passage."
  ]
}