{
  "years": [
    135,
    138,
    161,
    180,
    190,
    193,
    73,
    79,
    81,
    211,
    85,
    218,
    221,
    96,
    97,
    98,
    224,
    106,
    118
  ],
  "minYear": 73,
  "maxYear": 224,
  "events": [
    "Masada, a Jewish fortress, falls to the Romans after several months of siege, ending the First Jewish-Roman War.",
    "Mount Vesuvius begins stirring, on the feast day of Vulcan, the Roman god of fire.",
    "Domitian becomes Emperor of the Roman Empire upon the death of his brother Titus.",
    "Nerva, suspected of complicity of the death of Domitian, is declared emperor by Senate. The Senate then annuls laws passed by Domitian and orders his statues to be destroyed.",
    "Nerva is proclaimed Roman emperor after Domitian is assassinated.",
    "Roman emperor Nerva is forced by the Praetorian Guard to adopt general Marcus Ulpius Trajanus as his heir and successor.",
    "Trajan succeeds his adoptive father Nerva as Roman emperor; under his rule the Roman Empire will reach its maximum extent.",
    "On the death of Nerva, Trajan is declared Roman emperor in Cologne, the seat of his government in lower Germany.",
    "Start of the Bostran era, the calendar of the province of Arabia Petraea.",
    "The south-western part of Dacia (modern Romania) becomes a Roman province: Roman Dacia.",
    "Hadrian, who became emperor a year ago on Trajan's death, makes his entry into Rome.",
    "Roman armies enter Betar, slaughtering thousands and ending the Bar Kokhba revolt.",
    "Emperor Hadrian dies of heart failure at his residence on the bay of Naples, Baiae; he is buried at Rome in the Tomb of Hadrian beside his late wife, Vibia Sabina.",
    "Marcus Aurelius and L. Commodus (who changes his name to Lucius Verus) become joint emperors of Rome on the death of Antoninus Pius.",
    "Commodus becomes sole emperor of the Roman Empire at the age of eighteen, following the death of his father, Marcus Aurelius.",
    "Twelve inhabitants of Scillium (near Kasserine, modern-day Tunisia) in North Africa are executed for being Christians. This is the earliest record of Christianity in that part of the world.",
    "Dong Zhuo has his troops evacuate the capital Luoyang and burn it to the ground.",
    "The Senate chooses Pertinax against his will to succeed Commodus as Roman emperor.",
    "After assassinating the Roman Emperor Pertinax, his Praetorian Guards auction off the throne to Didius Julianus.",
    "The distinguished soldier Septimus Severus is proclaimed emperor by the army in Illyricum.",
    "Following the death of the Roman Emperor Septimius Severus at Eboracum (modern York, England) while preparing to lead a campaign against the Caledonians, the empire is left in the control of his two quarrelling sons, Caracalla and Geta, whom he had instructed to make peace.",
    "Battle of Antioch: With the support of the Syrian legions, Elagabalus defeats the forces of emperor Macrinus.",
    "Liu Bei, Chinese warlord, proclaims himself emperor of Shu Han, the successor of the Han dynasty.",
    "The Battle of Hormozdgan is fought. Ardashir I defeats and kills Artabanus V effectively ending the Parthian Empire."
  ]
}