{
  "years": [
    1740,
    1741,
    1742,
    1743,
    1744,
    1745
  ],
  "minYear": 1740,
  "maxYear": 1745,
  "events": [
    "Georgia provincial governor James Oglethorpe begins an unsuccessful attempt to take Spanish Florida during the Siege of St. Augustine.",
    "A combined force of Spanish, free blacks and allied Indians defeat a British garrison at the Siege of Fort Mose near St. Augustine during the War of Jenkins' Ear.",
    "Pope Benedict XIV, previously known as Prospero Lambertini, succeeds Clement XII as the 247th Pope.",
    "France, Prussia, Bavaria and Saxony refuse to honour the Pragmatic Sanction, and the War of the Austrian Succession begins.",
    "The Battle of Cartagena de Indias (part of the War of Jenkins' Ear) begins.",
    "War of the Austrian Succession: Prussia gains control of Silesia at the Battle of Mollwitz.",
    "Maria Theresa is crowned Queen of Hungary.",
    "Aleksei Chirikov sights land in Southeast Alaska. He sends men ashore in a longboat, making them the first Europeans to visit Alaska.",
    "Charles Albert of Bavaria invades Upper Austria and Bohemia.",
    "King Marthanda Varma of Travancore defeats the Dutch East India Company at the Battle of Colachel, effectively bringing about the end of the Dutch colonial rule in India.",
    "George Frideric Handel completes his oratorio Messiah.",
    "Spencer Compton, Earl of Wilmington, becomes British Prime Minister.",
    "Jean-Pierre Christin developed the centigrade temperature scale.",
    "In the Battle of Dettingen, George II becomes the last reigning British monarch to participate in a battle.",
    "The War of the Hats: The Swedish army surrenders to the Russians in Helsinki, ending the war and starting Lesser Wrath.",
    "Great Britain, Austria and the Kingdom of Sardinia sign the Treaty of Worms.",
    "The Treaty of Lancaster, in which the Iroquois cede lands between the Allegheny Mountains and the Ohio River to the British colonies, was signed in Lancaster, Pennsylvania.",
    "Battle of Hohenfriedberg: Frederick the Great's Prussian army decisively defeated an Austrian army under Prince Charles Alexander of Lorraine during the War of the Austrian Succession.",
    "A New England colonial army captures the French fortifications at Louisbourg (New Style).",
    "French victory in the Battle of Melle allows them to capture Ghent in the days after.",
    "The first recorded women's cricket match takes place near Guildford, England.",
    "Prince Charles Edward Stuart raises his standard in Glenfinnan: The start of the Second Jacobite Rebellion, known as \"the 45\".",
    "Ottoman-Persian War: In the Battle of Kars, the Ottoman army is routed by Persian forces led by Nader Shah.",
    "A Hanoverian army is defeated, in ten minutes, by the Jacobite forces of Prince Charles Edward Stuart"
  ]
}