{
  "years": [
    1708,
    1709,
    1710,
    1711,
    1712,
    1713,
    1714
  ],
  "minYear": 1708,
  "maxYear": 1714,
  "events": [
    "Queen Anne withholds Royal Assent from the Scottish Militia Bill, the last time a British monarch vetoes legislation.",
    "A French fleet anchors nears Fife Ness as part of the planned French invasion of Britain.",
    "Charles XII of Sweden stops his march to conquer Moscow outside Smolensk, marking the turning point in the Great Northern War. The army is defeated nine months later in the Battle of Poltava, and the Swedish Empire ceases to be a major power.",
    "Peter the Great defeats the Swedes at the Battle of Lesnaya.",
    "Alexander Selkirk is rescued after being shipwrecked on a desert island, inspiring Daniel Defoe's adventure book Robinson Crusoe.",
    "Peter I of Russia defeats Charles XII of Sweden at the Battle of Poltava, thus effectively ending Sweden's status as a major power in Europe.",
    "Bartolomeu de Gusmão demonstrates the lifting power of hot air in an audience before the king of Portugal in Lisbon, Portugal.",
    "Meidingnu Pamheiba is crowned King of Manipur.",
    "Battle of Malplaquet: Great Britain, Netherlands, and Austria fight against France.",
    "The Statute of Anne, the first law regulating copyright, comes into force in Great Britain.",
    "War of the Spanish Succession: A multinational army led by the Austrian commander Guido Starhemberg defeats the Spanish-Bourbon army commanded by Alexandre Maître, Marquis de Bay in the Battle of Saragossa.",
    "Port Royal, the capital of French Acadia, falls in a siege by British forces.",
    "Rinaldo by George Frideric Handel, the first Italian opera written for the London stage, is premièred.",
    "Britain's Quebec Expedition loses eight ships and almost nine hundred soldiers, sailors and women to rocks at Pointe-aux-Anglais.",
    "The Tuscarora War begins in present-day North Carolina.",
    "Huilliches in Chiloé rebel against Spanish encomenderos.",
    "February 29 is followed by February 30 in Sweden, in a move to abolish the Swedish calendar for a return to the Julian calendar.",
    "The Duke of Montrose issues a warrant for the arrest of Rob Roy MacGregor.",
    "The Kalabalik or Skirmish at Bender results from the Ottoman sultan's order that his unwelcome guest, King Charles XII of Sweden, be seized.",
    "The French residents of Acadia are given one year to declare allegiance to Britain or leave Nova Scotia, Canada.",
    "Great Northern War: Russia defeated Sweden in the Battle of Kostianvirta in Pälkäne.",
    "The Great Northern War: The first significant victory of the Russian Navy in the naval battle of Gangut against the Swedish Navy near the Hanko Peninsula.",
    "George, Elector of Hanover, becomes King George I of Great Britain, marking the beginning of the Georgian era of British history.",
    "The Battle of Gangut: The first important victory of the Russian Navy."
  ]
}