{
  "years": [
    1184,
    1185,
    1186,
    1169,
    1170,
    1172,
    1173,
    1174,
    1176,
    1178,
    1179,
    1180,
    1183
  ],
  "minYear": 1169,
  "maxYear": 1186,
  "events": [
    "Saladin becomes the emir of Egypt.",
    "Norman mercenaries land at Bannow Bay in Leinster, marking the beginning of the Norman invasion of Ireland.",
    "Battle of the Blacks: Uprising by the black African forces of the Fatimid army, along with a number of Egyptian emirs and commoners, against Saladin. The uprising is defeated after two days, consolidating Saladin's position as master of Egypt.",
    "The Kingdom of Dublin falls to Norman invaders.",
    "Thomas Becket, Archbishop of Canterbury, is assassinated inside Canterbury Cathedral by followers of King Henry II; he subsequently becomes a saint and martyr in the Anglican Communion and the Catholic Church.",
    "Henry the Young King and Margaret of France are crowned junior king and queen of England.",
    "Construction of the campanile of the Cathedral of Pisa (now known as the Leaning Tower of Pisa) begins; it will take two centuries to complete.",
    "The widow Stamira sacrifices herself in order to raise the siege of Ancona by the forces of Emperor Frederick Barbarossa.",
    "Baldwin IV, 13, becomes King of Jerusalem, with Raymond III, Count of Tripoli as regent and William of Tyre as chancellor.",
    "The Hashshashin (Assassins) attempt to assassinate Saladin near Aleppo.",
    "The Battle of Myriokephalon is the last attempt by the Byzantine Empire to recover central Anatolia from the Seljuk Turks.",
    "Five Canterbury monks see an event believed to have been the formation of the Giordano Bruno crater on the moon. It is believed that the current oscillations of the Moon's distance from the Earth (on the order of meters) are a result of this collision.",
    "Philip II is crowned as 'King of France'.",
    "Emperor Antoku accedes to the throne of Japan.",
    "First Battle of Uji, starting the Genpei War in Japan.",
    "Genpei War: Battle of Ishibashiyama in Japan.",
    "Philip Augustus becomes king of France at the age of fifteen.",
    "Taira no Munemori and the Taira clan take the young Emperor Antoku and the three sacred treasures and flee to western Japan to escape pursuit by the Minamoto clan.",
    "The naval Battle of Fimreite is won by the Birkebeiner pretender Sverre Sigurdsson. Sigurdsson takes the Norwegian throne and King Magnus V of Norway is killed.",
    "The cave city of Vardzia is consecrated by Queen Tamar of Georgia.",
    "Sack of Thessalonica by the Normans.",
    "Isaac II Angelos kills Stephen Hagiochristophorites and then appeals to the people, resulting in the revolt that deposes Andronikos I Komnenos and places Isaac on the throne of the Byzantine Empire.",
    "The Uprising of Asen and Peter begins on the feast day of St. Demetrius of Thessaloniki and ends with the creation of the Second Bulgarian Empire.",
    "Henry VI, the son and heir of the Holy Roman Emperor Frederick I, marries Constance of Sicily."
  ]
}