{
  "years": [
    1876,
    1877,
    1878,
    1879
  ],
  "minYear": 1876,
  "maxYear": 1879,
  "events": [
    "The first newspaper in Afrikaans, Die Afrikaanse Patriot, is published in Paarl.",
    "The National League of Professional Baseball Clubs of Major League Baseball is formed.",
    "Alexander Graham Bell applies for a patent for the telephone, as does Elisha Gray.",
    "The stage première of Peer Gynt, a play by Henrik Ibsen with incidental music by Edvard Grieg, takes place in Christiania (Oslo), Norway.",
    "Japan and Korea sign the Treaty of Kangwha, which grants Japanese citizens extraterritoriality rights in Korea, opens three Korean ports to Japanese trade, and ends Korea's status as a tributary state of Qing dynasty China.",
    "The Benevolent and Protective Order of Elks is organized.",
    "Catalpa rescue: The rescue of six Fenian prisoners from Fremantle Prison in Western Australia.",
    "The April Uprising begins. Its suppression shocks European opinion, and Bulgarian independence becomes a condition for ending the Russo-Turkish War.",
    "Queen Victoria of the United Kingdom is proclaimed Empress of India.",
    "Crazy Horse and his warriors fight their last battle against the United States Cavalry at Wolf Mountain, Montana Territory.",
    "The last day of the Constantinople Conference results in agreement for political reforms in the Balkans.",
    "Tchaikovsky's ballet Swan Lake receives its premiere at the Bolshoi Theatre in Moscow.",
    "First ever official cricket test match is played: Australia vs England at the MCG Stadium, in Melbourne, Australia.",
    "The United Kingdom annexes the Transvaal.",
    "Russo-Turkish War: Russian Empire declares war on Ottoman Empire.",
    "American Indian Wars: Sitting Bull leads his band of Lakota into Canada to avoid harassment by the United States Army under Colonel Nelson Miles.",
    "Chief Crazy Horse of the Oglala Lakota surrenders to United States troops in Nebraska.",
    "Umberto I becomes King of Italy.",
    "Yale Daily News becomes the first independent daily college newspaper in the United States.",
    "John Tunstall is murdered by outlaw Jesse Evans, sparking the Lincoln County War in Lincoln County, New Mexico.",
    "Thomas Edison patents the phonograph.",
    "The Russo-Turkish War ends with Bulgaria regaining its independence from the Ottoman Empire according to the Treaty of San Stefano.",
    "The Anglo-Zulu War begins.",
    "The Battle of Isandlwana during the Anglo-Zulu War results in a British defeat."
  ]
}