{
  "years": [
    1784,
    1781,
    1782,
    1783
  ],
  "minYear": 1781,
  "maxYear": 1784,
  "events": [
    "In the Battle of Jersey, the British defeat the last attempt by France to invade Jersey in the Channel Islands.",
    "Fourth Anglo-Dutch War: Captain Thomas Shirley opens his expedition against Dutch colonial outposts on the Gold Coast of Africa (present-day Ghana).",
    "The Articles of Confederation goes into effect in the United States.",
    "William Herschel discovers Uranus.",
    "Jack Jouett begins his midnight ride to warn Thomas Jefferson and the Virginia legislature of an impending raid by Banastre Tarleton.",
    "The first American commercial bank, the Bank of North America, opens.",
    "Superintendent of Finance Robert Morris addresses the U.S. Congress to recommend establishment of a national mint and decimal coinage.",
    "Spanish defeat British forces and capture Menorca.",
    "Gnadenhutten massacre: Ninety-six Native Americans in Gnadenhutten, Ohio, who had converted to Christianity, are killed by Pennsylvania militiamen in retaliation for raids carried out by other Indian tribes.",
    "The Second Rockingham ministry assumes office in Great Britain and begins negotiations to end the American War of Independence.",
    "King Buddha Yodfa Chulaloke (Rama I) of Siam (modern day Thailand) establishes the Chakri dynasty.",
    "John Adams secures Dutch recognition of the United States as an independent government. The house which he had purchased in The Hague becomes the first American embassy.",
    "The city of Rattanakosin, now known internationally as Bangkok, is founded on the eastern bank of the Chao Phraya River by King Buddha Yodfa Chulaloke.",
    "Construction begins on the Grand Palace, the royal residence of the King of Siam in Bangkok, at the command of King Buddha Yodfa Chulaloke.",
    "The Kingdom of Great Britain signs preliminary articles of peace with the Kingdom of France, setting the stage for the official end of hostilities in the American Revolutionary War later that year.",
    "Spain-United States relations are first established.",
    "In Calabria, a sequence of strong earthquakes begins.",
    "American Revolutionary War: French and Spanish forces lift the Great Siege of Gibraltar.",
    "In an emotional speech in Newburgh, New York, George Washington asks his officers not to support the Newburgh Conspiracy. The plea is successful and the threatened coup d'état never takes place.",
    "First United Empire Loyalists reach Parrtown (later called Saint John, New Brunswick), Canada, after leaving the United States.",
    "A Great Jubilee Day held at North Stratford, Connecticut, celebrates the end of fighting in the American Revolution.",
    "The Montgolfier brothers publicly demonstrate their montgolfière (hot air balloon).",
    "The signing of the Treaty of Mangalore brings the Second Anglo-Mysore War to an end.",
    "The Emerald Buddha is moved with great ceremony to its current location in Wat Phra Kaew, Thailand."
  ]
}