{
  "years": [
    1912,
    1913,
    1914
  ],
  "minYear": 1912,
  "maxYear": 1914,
  "events": [
    "The Republic of China is established.",
    "The Scout Association is incorporated throughout the British Empire by royal charter.",
    "The sixth All-Russian Conference of the Russian Social Democratic Labour Party (Prague Party Conference) opens. In the course of the conference, Vladimir Lenin and his supporters break from the rest of the party to form the Bolshevik movement.",
    "New Mexico is admitted to the Union as the 47th U.S. state.",
    "German geophysicist Alfred Wegener first presents his theory of continental drift.",
    "The African National Congress is founded, under the name South African Native National Congress (SANNC).",
    "Immigrant textile workers in Lawrence, Massachusetts, go on strike when wages are reduced in response to a mandated shortening of the work week.",
    "British polar explorer Captain Robert Falcon Scott reaches the South Pole, one month after Roald Amundsen.",
    "The International Opium Convention is signed at The Hague.",
    "The Xuantong Emperor, the last Emperor of China, abdicates.",
    "An Atlantic coast storm sets the lowest confirmed barometric pressure reading for a non-tropical system in the continental United States.",
    "First Balkan War: The Battle of Lemnos begins; Greek admiral Pavlos Kountouriotis forces the Turkish fleet to retreat to its base within the Dardanelles, from which it did not venture for the rest of the war.",
    "Grand Central Terminal opens in New York City.",
    "The Sixteenth Amendment to the United States Constitution is ratified, authorizing the Federal government to impose and collect an income tax.",
    "Greek military aviators, Michael Moutoussis and Aristeidis Moraitinis perform the first naval air mission in history, with a Farman MF.7 hydroplane.",
    "A group of meteors is visible across much of the eastern seaboard of the Americas, leading astronomers to conclude the source had been a small, short-lived natural satellite of the Earth.",
    "The 13th Dalai Lama proclaims Tibetan independence following a period of domination by Manchu Qing dynasty and initiated a period of almost four decades of independence.",
    "The Armory Show opens in New York City, displaying works of artists who are to become some of the most influential painters of the early 20th century.",
    "Pedro Lascuráin becomes President of Mexico for 45 minutes; this is the shortest term to date of any person as president of any country.",
    "The SPT Airboat Line becomes the world's first scheduled airline to use a winged aircraft.",
    "The Ford Motor Company announces an eight-hour workday and minimum daily wage of $5 in salary plus bonuses.",
    "The Phi Beta Sigma fraternity is founded by African-American students at Howard University in Washington D.C., United States.",
    "Copyright: In New York City the American Society of Composers, Authors and Publishers is established to protect the copyrighted musical compositions of its members.",
    "HMHS Britannic, sister to the RMS Titanic, is launched at Harland and Wolff shipyard in Belfast."
  ]
}