{
  "years": [
    1897,
    1898,
    1899
  ],
  "minYear": 1897,
  "maxYear": 1899,
  "events": [
    "Shinhan Bank, the oldest bank in South Korea, opens in Seoul.",
    "The Greco-Turkish War is declared between Greece and the Ottoman Empire.",
    "Dracula, a Gothic horror novel by Irish author Bram Stoker, is published.",
    "The original manuscript of William Bradford's history, Of Plymouth Plantation, is returned to the Governor of Massachusetts by the Bishop of London after being taken during the American Revolutionary War.",
    "A treaty annexing the Republic of Hawaii to the United States is signed; the Republic would not be dissolved until a year later.",
    "British colonial officers Charles Walter Rand and Lt. Charles Egerton Ayerst are assassinated in Pune, Maharashtra, India by the Chapekar brothers and Mahadeo Vinayak Ranade, who are later caught and hanged.",
    "British-Italian engineer Guglielmo Marconi obtains a patent for radio in London.",
    "Salomon August Andrée leaves Spitsbergen to attempt to reach the North Pole by balloon.",
    "American author Jack London embarks on a sailing trip to take part in the Klondike's gold rush, from which he wrote his first successful stories.",
    "New York, New York annexes land from surrounding counties, creating the City of Greater New York. The four initial boroughs, Manhattan, Brooklyn, Queens, and The Bronx, are joined on January 25 by Staten Island to create the modern city of five boroughs.",
    "Émile Zola's J'accuse…! exposes the Dreyfus affair.",
    "Dreyfus affair: Émile Zola is brought to trial for libel for publishing J'Accuse…!",
    "King George I of Greece survives an assassination attempt.",
    "In Melbourne, the representatives of five colonies adopt a constitution, which would become the basis of the Commonwealth of Australia.[page needed]",
    "U.S. President William McKinley signed a joint resolution to Congress for declaration of war against Spain, beginning the Spanish-American War.",
    "Spanish-American War: The United States Navy begins a blockade of Cuban ports. When the U.S. Congress issued a declaration of war on April 25, it declared that a state of war had existed from this date.",
    "Spanish rule ends in Cuba.",
    "The United States takes possession of Wake Island in the Pacific Ocean.",
    "Anglo-Egyptian Sudan is formed.",
    "The Malolos Constitution is inaugurated, establishing the First Philippine Republic. Emilio Aguinaldo is sworn in as its first president.",
    "The Australian Premiers' Conference held in Melbourne decides to locate Australia's capital city, Canberra, between Sydney and Melbourne.",
    "The Philippine-American War begins with the Battle of Manila.",
    "Voting machines are approved by the U.S. Congress for use in federal elections.",
    "Tsar Nicholas II of Russia issues a declaration known as the February Manifesto, which reduces the autonomy of the Grand Duchy of Finland, thus beginning the first period of oppression."
  ]
}