{
  "years": [
    897,
    900,
    902,
    903,
    904,
    907,
    908,
    910,
    911,
    912,
    913,
    914,
    915,
    919,
    917,
    887,
    893
  ],
  "minYear": 887,
  "maxYear": 919,
  "events": [
    "Emperor Charles the Fat is deposed by the Frankish magnates in an assembly at Frankfurt, leading his nephew, Arnulf of Carinthia, to declare himself king of the East Frankish Kingdom in late November.",
    "Berengar I is elected as king of Italy by the lords of Lombardy. He is crowned with the Iron Crown of Lombardy at Pavia.",
    "An earthquake destroys the city of Dvin, Armenia.",
    " Al-Hadi ila'l-Haqq Yahya enters Sa'dah and founds the Zaydi Imamate of Yemen.",
    "The Laguna Copperplate Inscription (the earliest known written document found in what is now the Philippines): the Commander-in-Chief of the Kingdom of Tondo, as represented by the Honourable Jayadewa, Lord Minister of Pailah, pardons from all debt the Honourable Namwaran and his relations.",
    "Count Reginar I of Hainault rises against Zwentibold of Lotharingia and slays him near present-day Susteren.",
    "Taormina, the last Byzantine stronghold in Sicily, is captured by the Aghlabid army, concluding the Muslim conquest of Sicily.",
    "The Abbasid army under Muhammad ibn Sulayman al-Katib defeats the Qarmatians at the Battle of Hama.",
    "Sergius III is elected pope, after coming out of retirement to take over the papacy from the deposed antipope Christopher.",
    "Sack of Thessalonica: Saracen raiders under Leo of Tripoli sack Thessaloniki, the Byzantine Empire's second-largest city, after a short siege, and plunder it for a week.",
    "The warlord Zhu Quanzhong kills Emperor Zhaozong, the penultimate emperor of the Tang dynasty, after seizing control of the imperial government.",
    "Abaoji, chieftain of the Yila tribe, is named khagan of the Khitans.",
    "Zhu Wen forces Emperor Ai into abdicating, ending the Tang dynasty after nearly three hundred years of rule.",
    "Battle of Eisenach: An invading Hungarian force defeats an East Frankish army under Duke Burchard of Thuringia.",
    "The last major Danish army to raid England for nearly a century is defeated at the Battle of Tettenhall by the allied forces of Mercia and Wessex, led by King Edward the Elder and Æthelred, Lord of the Mercians.",
    "Signing of the Treaty of Saint-Clair-sur-Epte between Charles the Simple and Rollo of Normandy.",
    "Rollo lays siege to Chartres.",
    "Alexander becomes Emperor of the Byzantine Empire.",
    "Abd ar-Rahman III becomes the eighth Emir of Córdoba.",
    "Constantine VII, the 8-year-old illegitimate son of Leo VI the Wise, becomes nominal ruler of the Byzantine Empire under the regency of a seven-man council headed by Patriarch Nicholas Mystikos, appointed by Constantine's uncle Alexander III on his deathbed.",
    "Start of the First Fatimid invasion of Egypt.",
    "Pope John X crowns Berengar I of Italy as Holy Roman Emperor (probable date).",
    "Liu Yan declares himself emperor, establishing the Southern Han state in southern China, at his capital of Panyu.",
    "Romanos Lekapenos seizes the Boukoleon Palace in Constantinople and becomes regent of the Byzantine emperor Constantine VII."
  ]
}