{
  "years": [
    1229,
    1230,
    1232,
    1236,
    1237,
    1238,
    1240,
    1241,
    1242
  ],
  "minYear": 1229,
  "maxYear": 1242,
  "events": [
    "The Sixth Crusade: Frederick II, Holy Roman Emperor, signs a ten-year truce with al-Kamil, regaining Jerusalem, Nazareth, and Bethlehem with neither military engagements nor support from the papacy.",
    "Frederick II, Holy Roman Emperor, declares himself King of Jerusalem in the Sixth Crusade.",
    "Battle of Portopí: The Aragonese army under the command of James I of Aragon disembarks at Santa Ponça, Majorca, with the purpose of conquering the island.",
    "Ögedei Khan is proclaimed Khagan of the Mongol Empire in Kodoe Aral, Khentii: Mongolia.",
    "James I the Conqueror, King of Aragon, enters Medina Mayurqa (now known as Palma, Spain), thus consummating the Christian reconquest of the island of Majorca.",
    "Bulgarian Tsar Ivan Asen II defeats Theodore of Epirus in the Battle of Klokotnitsa.",
    "William de Braose is hanged by Prince Llywelyn the Great.",
    "The Siege of Jaén begins, in the context of the Spanish Reconquista.",
    "Mongol-Jin War: The Mongols begin their siege on Kaifeng, the capital of the Jin dynasty.",
    "The Spanish town of Arjona declares independence and names its native Muhammad ibn Yusuf as ruler. This marks the Muhammad's first rise to prominence; he would later establish the Nasrid Emirate of Granada, the last independent Muslim state in Spain.",
    "King Henry III of England marries Eleanor of Provence.",
    "The Samogitians defeat the Livonian Brothers of the Sword in the Battle of Saule.",
    "Spanish Reconquista: The Battle of the Puig between the Moorish forces of Taifa of Valencia against the Kingdom of Aragon culminates in an Aragonese victory.",
    "England and Scotland sign the Treaty of York, establishing the location of their common border.",
    "The city of Ryazan is sacked by the Mongol army of Batu Khan.",
    "The Mongols burn the Russian city of Vladimir.",
    "The Battle of the Sit River is fought in the northern part of the present-day Yaroslavl Oblast of Russia between the Mongol hordes of Batu Khan and the Russians under Yuri II of Vladimir-Suzdal during the Mongol invasion of Rus'.",
    "King James I of Aragon conquers Valencia from the Moors. Shortly thereafter, he proclaims himself king of Valencia.",
    "At the instigation of Louis IX of France, an inter-faith debate, known as the Disputation of Paris, starts between a Christian monk and four rabbis.",
    "Swedish-Novgorodian Wars: A Novgorodian army led by Alexander Nevsky defeats the Swedes in the Battle of the Neva.",
    "Mongol invasion of Rus': Kyiv under Daniel of Galicia and Voivode Dmytro falls to the Mongols under Batu Khan.",
    "First Mongol invasion of Poland: Mongols overwhelm Polish armies in Kraków in the Battle of Chmielnik and plunder the city.",
    "Batu Khan defeats Béla IV of Hungary at the Battle of Mohi.",
    "During the Battle on the Ice of Lake Peipus, Russian forces, led by Alexander Nevsky, rebuff an invasion attempt by the Teutonic Knights."
  ]
}