{
  "years": [
    404,
    406,
    409,
    410,
    413,
    418,
    421,
    425,
    428,
    435,
    438,
    439,
    447,
    451,
    452,
    455,
    456,
    457,
    461
  ],
  "minYear": 404,
  "maxYear": 461,
  "events": [
    "Saint Telemachus tries to stop a gladiatorial fight in a Roman amphitheatre, and is stoned to death by the crowd. This act impresses the Christian Emperor Honorius, who issues a historic ban on gladiatorial fights.",
    "Byzantine Empress Eudoxia dies from the miscarriage of her seventh pregnancy.",
    "Vandals, Alans and Suebians cross the Rhine, beginning an invasion of Gaul.",
    "Vandals and Alans cross the Pyrenees and appear in Hispania.",
    "The Visigoths under king Alaric I begin to pillage Rome.",
    "The sacking of Rome by the Visigoths ends after three days.",
    "Emperor Honorius signs an edict providing tax relief for the Italian provinces Tuscia, Campania, Picenum, Samnium, Apulia, Lucania and Calabria, which were plundered by the Visigoths.",
    "A papal conclave begins, resulting in the election of Pope Boniface I.",
    "Constantius III becomes co-Emperor of the Western Roman Empire.",
    "Italian city Venice is founded with the dedication of the first church, that of San Giacomo di Rialto on the islet of Rialto.",
    "The University of Constantinople is founded by Emperor Theodosius II at the urging of his wife Aelia Eudocia.",
    "Valentinian III is elevated as Roman emperor at the age of six.",
    "Nestorius becomes the Patriarch of Constantinople. Three years later, he would be deposed due to alleged heresy.",
    "Deposed Ecumenical Patriarch of Constantinople Nestorius, considered the originator of Nestorianism, is exiled by Roman Emperor Theodosius II to a monastery in Egypt.",
    "Roman emperor Theodosius II publishes the law codex Codex Theodosianus",
    "The Vandals, led by King Gaiseric, take Carthage in North Africa.",
    "A powerful earthquake destroys large portions of the Walls of Constantinople, including 57 towers.",
    "Attila the Hun captures Metz in France, killing most of its inhabitants and burning most of the town.",
    "Battle of Avarayr between Armenian rebels and the Sasanian Empire takes place. The Sasanids defeat the Armenians militarily but guarantee them freedom to openly practice Christianity.",
    "The first session of the Council of Chalcedon begins.",
    "The Chalcedonian Creed, regarding the divine and human nature of Jesus, is adopted by the Council of Chalcedon, an ecumenical council.",
    "Severianus, Bishop of Scythopolis, is martyred in Palestine.",
    "Attila leads a Hun army in the invasion of Italy, devastating the northern provinces as he heads for Rome.",
    "Sack of Aquileia: After an earlier defeat on the Catalaunian Plains, Attila lays siege to the metropolis of Aquileia and eventually destroys it.",
    "Petronius Maximus becomes, with support of the Roman Senate, emperor of the Western Roman Empire; he forces Licinia Eudoxia, the widow of his predecessor, Valentinian III, to marry him.",
    "Ricimer defeats Avitus at Piacenza and becomes master of the Western Roman Empire.",
    "Leo I becomes the Eastern Roman emperor.",
    "Majorian is acclaimed as Western Roman emperor.",
    "Roman Emperor Majorian is beheaded near the river Iria in north-west Italy following his arrest and deposition by the magister militum Ricimer.",
    "Libius Severus is declared emperor of the Western Roman Empire. The real power is in the hands of the magister militum Ricimer."
  ]
}