{
  "years": [
    1896,
    1897,
    1895
  ],
  "minYear": 1895,
  "maxYear": 1897,
  "events": [
    "Dreyfus affair: French army officer Alfred Dreyfus is stripped of his rank and sentenced to life imprisonment on Devil's Island.",
    "The National Trust is founded in the United Kingdom.",
    "First Italo-Ethiopian War: The war's opening battle, the Battle of Coatit, occurs; it is an Italian victory.",
    "Fountains Valley, Pretoria, the oldest nature reserve in Africa, is proclaimed by President Paul Kruger.",
    "William G. Morgan creates a game called Mintonette, which soon comes to be referred to as volleyball.",
    "Auguste and Louis Lumière record their first footage using their newly patented cinematograph.",
    "Before the Société pour L'Encouragement à l'Industrie, brothers Auguste and Louis Lumière demonstrate movie film technology publicly for the first time.",
    "The trial in the libel case brought by Oscar Wilde begins, eventually resulting in his imprisonment on charges of homosexuality.",
    "In Pollock v. Farmers' Loan & Trust Co. the Supreme Court of the United States declares unapportioned income tax to be unconstitutional.",
    "Utah is admitted as the 45th U.S. state.",
    "An X-ray generating machine is exhibited for the first time by H. L. Smith.",
    "Walter Arnold of East Peckham, Kent, becomes the first person to be convicted of speeding. He was fined one shilling, plus costs, for speeding at 8 mph (13 km/h), thereby exceeding the contemporary speed limit of 2 mph (3.2 km/h).",
    "La bohème premieres in Turin at the Teatro Regio (Turin), conducted by the young Arturo Toscanini.",
    "Battle of Adwa: An Ethiopian army defeats an outnumbered Italian force, ending the First Italo-Ethiopian War.",
    "Henri Becquerel discovers radioactive decay.",
    "With the approval of Emperor Guangxu, the Qing dynasty post office is opened, marking the beginning of a postal service in China.",
    "Charilaos Vasilakos wins the first modern Olympic marathon race with a time of three hours and 18 minutes.",
    "An explosion at the Brunner Mine near Greymouth, New Zealand kills 65 coal miners in the country's worst industrial accident.",
    "Shinhan Bank, the oldest bank in South Korea, opens in Seoul.",
    "The Greco-Turkish War is declared between Greece and the Ottoman Empire.",
    "Dracula, a Gothic horror novel by Irish author Bram Stoker, is published.",
    "The original manuscript of William Bradford's history, Of Plymouth Plantation, is returned to the Governor of Massachusetts by the Bishop of London after being taken during the American Revolutionary War.",
    "A treaty annexing the Republic of Hawaii to the United States is signed; the Republic would not be dissolved until a year later.",
    "British colonial officers Charles Walter Rand and Lt. Charles Egerton Ayerst are assassinated in Pune, Maharashtra, India by the Chapekar brothers and Mahadeo Vinayak Ranade, who are later caught and hanged."
  ]
}