{
  "years": [
    768,
    769,
    771,
    775,
    781,
    783,
    786,
    787,
    789,
    792,
    793,
    794,
    796,
    797,
    799,
    760,
    762,
    763,
    766
  ],
  "minYear": 760,
  "maxYear": 799,
  "events": [
    "Fourteenth recorded perihelion passage of Halley's Comet.",
    "Baghdad is founded.",
    "Led by Muhammad al-Nafs al-Zakiyya, the Hasanid branch of the Alids begins the Alid Revolt against the Abbasid Caliphate.",
    "During the An Shi Rebellion, the Tang dynasty, with the help of Huihe tribe, recaptures Luoyang from the rebels.",
    "Following the Battle of Bakhamra between Alids and Abbasids near Kufa, the Alid rebellion ends with the death of Ibrahim, brother of Isa ibn Musa.",
    "The Byzantine army of emperor Constantine V defeats the Bulgarian forces in the Battle of Anchialus.",
    "Emperor Constantine V humiliates nineteen high-ranking officials, after discovering a plot against him. He executes the leaders, Constantine Podopagouros and his brother Strategios.",
    "Pope Stephen III is elected to office, and quickly seeks Frankish protection against the Lombard threat, since the Byzantine Empire is no longer able to help.",
    "Carloman I and Charlemagne are crowned kings of the Franks.",
    "The Lateran Council condemns the Council of Hieria and anathematizes its iconoclastic rulings.",
    "Austrasian king Carloman I dies, leaving his brother Charlemagne king of the now complete Frankish Kingdom.",
    "The Battle of Bagrevand puts an end to an Armenian rebellion against the Abbasid Caliphate. Muslim control over the South Caucasus is solidified and its Islamization begins, while several major Armenian nakharar families lose power and their remnants flee to the Byzantine Empire.",
    "The oldest recorded eruption of Mount Fuji (Traditional Japanese date: Sixth day of the seventh month of the first year of the Ten'o (天応) era).",
    "The Asturian queen Adosinda is held at a monastery to prevent her king from retaking the throne from Mauregatus.",
    "A Hasanid Alid uprising in Mecca is crushed by the Abbasids at the Battle of Fakhkh.",
    "\"Night of the three Caliphs\": Harun al-Rashid becomes the Abbasid caliph upon the death of his brother al-Hadi. Birth of Harun's son al-Ma'mun.",
    "Second Council of Nicaea: The council assembles at the church of Hagia Sophia.",
    "Idris I reaches Volubilis and founds the Idrisid dynasty, marking the secession of Morocco from the Abbasid caliphate and founding the first Moroccan state.",
    "Kardam of Bulgaria defeats Byzantine Emperor Constantine VI at the Battle of Marcellae.",
    "Vikings raid the abbey at Lindisfarne in Northumbria, commonly accepted as the beginning of Norse activity in the British Isles.",
    "While visiting the royal Mercian court at Sutton Walls with a view to marrying princess Ælfthryth, King Æthelberht II of East Anglia is taken captive and beheaded.",
    "King Æthelred I of Northumbria is murdered in Corbridge by a group led by his ealdormen, Ealdred and Wada. The patrician Osbald is crowned, but abdicates within 27 days.",
    "Empress Irene organizes a conspiracy against her son, the Byzantine emperor Constantine VI. He is deposed and blinded. Shortly after, Constantine dies of his wounds; Irene proclaims herself basileus.",
    "After mistreatment and disfigurement by the citizens of Rome, pope Leo III flees to the Frankish court of king Charlemagne at Paderborn for protection."
  ]
}