{
  "years": [
    1317,
    1319,
    1320,
    1322,
    1323,
    1325,
    1327,
    1328,
    1329,
    1330
  ],
  "minYear": 1317,
  "maxYear": 1330,
  "events": [
    "The \"Nyköping Banquet\": King Birger of Sweden treacherously seizes his two brothers Valdemar, Duke of Finland and Eric, Duke of Södermanland, who were subsequently starved to death in the dungeon of Nyköping Castle.",
    "A Knights Hospitaller fleet scores a crushing victory over an Aydinid fleet off Chios.",
    "Duke Wladyslaw Lokietek becomes king of Poland.",
    "The Scots reaffirm their independence by signing the Declaration of Arbroath.",
    "In the Battle of Saint George, the Byzantines under Andronikos Asen ambush and defeat the forces of the Principality of Achaea, securing possession of Arcadia.",
    "Stephen Uroš III is crowned King of Serbia, having defeated his half-brother Stefan Konstantin in battle. His son is crowned \"young king\" in the same ceremony.",
    "The central tower of Ely Cathedral falls on the night of 12th–13th.",
    "Louis IV, Holy Roman Emperor, defeats Frederick I of Austria in the Battle of Mühldorf.",
    "Mladen II Šubić of Bribir is deposed as the Croatian Ban after the Battle of Bliska.",
    "Robert the Bruce of Scotland defeats King Edward II of England at the Battle of Old Byland, forcing Edward to accept Scotland's independence.",
    "The Treaty of Nöteborg between Sweden and Novgorod Republic is signed, regulating the border between the two countries for the first time.",
    "Alfonso IV becomes King of Portugal.",
    "Ibn Battuta begins his travels, leaving his home in Tangiers to travel to Mecca (gone 24 years).",
    "The teenaged Edward III is crowned King of England, but the country is ruled by his mother Queen Isabella and her lover Roger Mortimer.",
    "First War of Scottish Independence: James Douglas leads a raid into Weardale and almost kills Edward III of England.",
    "Wars of Scottish Independence end: By the Treaty of Edinburgh-Northampton, England recognises Scotland as an independent state.",
    "Antipope Nicholas V, a claimant to the papacy, is consecrated in Rome by the Bishop of Venice.",
    "William of Ockham, the Franciscan Minister-General Michael of Cesena, and two other Franciscan leaders secretly leave Avignon, fearing a death sentence from Pope John XXII.",
    "Philip VI is crowned King of France.",
    "Battle of Cassel: French troops stop an uprising of Flemish farmers.",
    "Pope John XXII issues his In Agro Dominico condemning some writings of Meister Eckhart as heretical.",
    "The Battle of Pelekanon results in a Byzantine defeat by the Ottoman Empire.",
    "Quilon, the first Indian Christian Diocese, is erected by Pope John XXII; the French-born Jordanus is appointed the first Bishop.",
    "At the Battle of Posada, Basarab I of Wallachia defeats the Hungarian army of Charles I Robert."
  ]
}