{
  "years": [
    1977,
    1978,
    1979,
    1980
  ],
  "minYear": 1977,
  "maxYear": 1980,
  "events": [
    "Apple Computer is incorporated.",
    "Capital punishment in the United States resumes after a ten-year hiatus, as convicted murderer Gary Gilmore is executed by firing squad in Utah.",
    "Scientists identify a previously unknown bacterium as the cause of the mysterious Legionnaires' disease.",
    "SFR Yugoslavia's Prime minister, Džemal Bijedić, his wife and six others are killed in a plane crash in Bosnia and Herzegovina.",
    "President Gerald Ford pardons Iva Toguri D'Aquino (a.k.a. \"Tokyo Rose\").",
    "The Atocha massacre occurs in Madrid during the Spanish transition to democracy.",
    "United States Food and Drug Administration requires all blood donations to be labeled \"paid\" or \"volunteer\" donors.",
    "The European Court of Human Rights finds the United Kingdom's government guilty of mistreating prisoners in Northern Ireland, but not guilty of torture.",
    "The Crown of St. Stephen (also known as the Holy Crown of Hungary) goes on public display after being returned to Hungary from the United States, where it was held after World War II.",
    "Proceedings of the United States Senate are broadcast on radio for the first time.",
    "Normal diplomatic relations are established between the People's Republic of China and the United States.",
    "Third Indochina War: Cambodian-Vietnamese War: Phnom Penh falls to the advancing Vietnamese troops, driving out Pol Pot and the Khmer Rouge.",
    "Iranian Revolution: The last Iranian Shah flees Iran with his family for good and relocates to Egypt.",
    "Pope John Paul II starts his first official papal visits outside Italy to The Bahamas, Dominican Republic, and Mexico.",
    "Pluto moves inside Neptune's orbit for the first time since either was discovered.",
    "The Iranian Revolution establishes an Islamic theocracy under the leadership of Ayatollah Ruhollah Khomeini.",
    "An intense windstorm strikes western Washington and sinks a 0.5-mile (0.80 km) long section of the Hood Canal Bridge.",
    "In Kabul, Setami Milli militants kidnap the American ambassador to Afghanistan, Adolph Dubs who is later killed during a gunfight between his kidnappers and police.",
    "U.S. President Jimmy Carter authorizes legislation giving $1.5 billion in loans to bail out the Chrysler Corporation.",
    "Mother Teresa is honored with India's highest civilian award, the Bharat Ratna.",
    "Through cooperation between the U.S. and Canadian governments, six American diplomats secretly escape hostilities in Iran in the culmination of the Canadian Caper.",
    "The Rubik's Cube makes its international debut at the Ideal Toy Corp. in Earl's Court, London.",
    "Reports surface that the FBI is targeting allegedly corrupt Congressmen in the Abscam operation.",
    "First winter ascent of Mount Everest by Krzysztof Wielicki and Leszek Cichy."
  ]
}