{
  "years": [
    1577,
    1578,
    1579,
    1580,
    1581,
    1582,
    1583
  ],
  "minYear": 1577,
  "maxYear": 1583,
  "events": [
    "The Treaty of Bergerac is signed between King Henry III of France and the Huguenots.",
    "Courtiers Christopher Hatton and Thomas Heneage are knighted by Queen Elizabeth I of England.",
    "Sir Francis Drake sets sail from Plymouth, England, on his round-the-world voyage.",
    "Eighty Years' War and Anglo-Spanish War: The Battle of Gembloux is a victory for Spanish forces led by Don John of Austria over a rebel army of Dutch, Flemish, English, Scottish, German, French and Walloons.",
    "King Henry III lays the first stone of the Pont Neuf (New Bridge), the oldest bridge of Paris, France.",
    "Battle of Al Kasr al Kebir: The Moroccans defeat the Portuguese. King Sebastian of Portugal is killed in the battle, leaving his elderly uncle, Cardinal Henry, as his heir. This initiates a succession crisis in Portugal.",
    "Spanish colonization of the Americas: Tegucigalpa, capital city of Honduras, is claimed by the Spaniards.",
    "The Union of Arras unites the southern Netherlands under the Duke of Parma (Ottavio Farnese), governor in the name of King Philip II of Spain.",
    "The Archdiocese of Manila is made a diocese by a papal bull with Domingo de Salazar being its first bishop.",
    "Start of the Siege of Maastricht, part of the Eighty Years' War.",
    "Livonian campaign of Stephen Báthory begins.",
    "Our Lady of Kazan, a holy icon of the Russian Orthodox Church, is discovered underground in the city of Kazan, Tatarstan.",
    "Francis Drake, the English explorer, discovers a major bay on the coast of California (San Francisco). ",
    "James VI of Scotland is celebrated as an adult ruler by a festival in Edinburgh.",
    "One of the largest earthquakes recorded in the history of England, Flanders, or Northern France, takes place.",
    "The Ostrog Bible, one of the early printed Bibles in a Slavic language, is published.",
    "War of the Portuguese Succession: Spanish victory at the Battle of Alcântara brings about the Iberian Union.",
    "Plakkaat van Verlatinghe (Act of Abjuration): The northern Low Countries declare their independence from the Spanish king, Philip II.",
    "Truce of Yam-Zapolsky: Russia cedes Livonia to the Polish-Lithuanian Commonwealth.",
    "With the papal bull Inter gravissimas, Pope Gregory XIII announces the Gregorian calendar.",
    "Sengoku period: Oda Nobunaga, the most powerful of the Japanese daimyōs, is forced to commit suicide by his own general Akechi Mitsuhide.",
    "The Gregorian Calendar is introduced by Pope Gregory XIII.",
    "Adoption of the Gregorian calendar begins, eventually leading to near-universal adoption.",
    "Sir Humphrey Gilbert establishes the first English colony in North America, at what is now St. John's, Newfoundland and Labrador."
  ]
}