{
  "years": [
    582,
    583,
    553,
    554,
    587,
    557,
    558,
    589,
    529,
    561,
    531,
    532,
    533,
    534,
    536,
    537,
    538
  ],
  "minYear": 529,
  "maxYear": 589,
  "events": [
    "First Corpus Juris Civilis, a fundamental work in jurisprudence, is issued by Eastern Roman Emperor Justinian I.",
    "Battle of Callinicum: A Byzantine army under Belisarius is defeated by the Persians at Raqqa (northern Syria).",
    "Nika riots in Constantinople: A quarrel between supporters of different chariot teams—the Blues and the Greens—in the Hippodrome escalates into violence.",
    "The Nika riots break out, during the racing season at the Hippodrome in Constantinople, as a result of discontent with the rule of the Emperor Justinian I.",
    "Byzantine emperor Justinian I lays the foundation stone of a new Orthodox Christian basilica in Constantinople – the Hagia Sophia.",
    "Mercurius becomes Pope John II, the first pope to adopt a new name upon elevation to the papacy.",
    "A Byzantine expeditionary fleet under Belisarius sails from Constantinople to attack the Vandals in Africa, via Greece and Sicily (approximate date).",
    "Belisarius of the Byzantine Empire defeats Gelimer and the Vandals at the Battle of Ad Decimum, near Carthage, North Africa.",
    "Vandalic War: Byzantine general Belisarius defeats the Vandals, commanded by King Gelimer, at the Battle of Tricamarum.",
    "The second and final edition of the Code of Justinian comes into effect in the Byzantine Empire.",
    "Gothic War: The Byzantine general Belisarius enters Rome unopposed; the Gothic garrison flees the capital.",
    "Siege of Rome: The Ostrogoth army under king Vitiges begins the siege of the capital. Belisarius conducts a delaying action outside the Flaminian Gate; he and a detachment of his bucellarii are almost cut off.",
    "Vitiges, king of the Ostrogoths ends his siege of Rome and retreats to Ravenna, leaving the city to the victorious Byzantine general, Belisarius.",
    "The Second Council of Constantinople begins.",
    "Emperor Justinian I rewards Liberius for his service in the Pragmatic Sanction, granting him extensive estates in Italy.",
    "Constantinople is severely damaged by an earthquake, which cracks the dome of Hagia Sophia.",
    "In Constantinople, the dome of the Hagia Sophia collapses, twenty years after its construction. Justinian I immediately orders that the dome be rebuilt.",
    "Chlothar I is crowned King of the Franks.",
    "Following the death of King Chlothar I at Compiègne, his four sons, Charibert I, Guntram, Sigebert I and Chilperic I, divide the Frankish Kingdom.",
    "Maurice becomes Emperor of the Byzantine Empire.",
    "Maya queen Yohl Ik'nal is crowned ruler of Palenque.",
    "Treaty of Andelot: King Guntram of Burgundy recognizes Childebert II as his heir.",
    "Reccared I opens the Third Council of Toledo, marking the entry of Visigothic Spain into the Catholic Church.",
    "King Authari marries Theodelinda, daughter of the Bavarian duke Garibald I. A Catholic, she has great influence among the Lombard nobility."
  ]
}