{
  "years": [
    1292,
    1293,
    1294,
    1295,
    1296,
    1297,
    1298,
    1299,
    1300,
    1301,
    1302,
    1303
  ],
  "minYear": 1292,
  "maxYear": 1303,
  "events": [
    "John Balliol becomes King of Scotland.",
    "King Sancho IV of Castile creates the Estudio de Escuelas de Generales in Alcalá de Henares.",
    "Mongol invasion of Java was a punitive expedition against King Kertanegara of Singhasari, who had refused to pay tribute to the Yuan and maimed one of its ministers. However, it ended with failure for the Mongols. Regarded as establish City of Surabaya",
    "Raden Wijaya is crowned as the first monarch of Majapahit kingdom of Java, taking the throne name Kertarajasa Jayawardhana.",
    "Temür, grandson of Kublai, is elected Khagan of the Mongols and Emperor of the Yuan dynasty with the reigning titles Oljeitu and Chengzong.",
    "Saint Celestine V resigns the papacy after only five months to return to his previous life as an ascetic hermit.",
    "Pope Boniface VIII is elected, replacing St. Celestine V, who had resigned.",
    "Przemysł II crowned king of Poland, following Ducal period. The white eagle is added to the Polish coat of arms.",
    "The first treaty forming the Auld Alliance between Scotland and France against England is signed in Paris.",
    "Edward I sacks Berwick-upon-Tweed, during armed conflict between Scotland and England.",
    "First War of Scottish Independence: John Balliol's Scottish army is defeated by an English army commanded by John de Warenne, 6th Earl of Surrey at the Battle of Dunbar.",
    "François Grimaldi, disguised as a monk, leads his men to capture the fortress protecting the Rock of Monaco, establishing his family as the rulers of Monaco.",
    "Battle of Stirling Bridge: Scots jointly led by William Wallace and Andrew Moray defeat the English.",
    "Residents of Riga and Grand Duchy of Lithuania defeated the Livonian Order in the Battle of Turaida.",
    "The Battle of Göllheim is fought between Albert I of Habsburg and Adolf of Nassau-Weilburg.",
    "Wars of Scottish Independence: Battle of Falkirk: King Edward I of England and his longbowmen defeat William Wallace and his Scottish schiltrons outside the town of Falkirk.",
    "According to Edward Gibbon, Osman I invades the territory of Nicomedia for the first time, usually considered to be the founding day of the Ottoman state.",
    "The city of Bilbao is founded.",
    "Andrew III of Hungary dies, ending the Árpád dynasty in Hungary.",
    "Edward of Caernarvon (later king Edward II of England) becomes the first English Prince of Wales.",
    "Dante Alighieri is condemned in absentia and exiled from Florence.",
    "Bruges Matins, the nocturnal massacre of the French garrison in Bruges by members of the local Flemish militia.",
    "The Byzantine-Venetian War comes to an end.",
    "The English are defeated at the Battle of Roslin, in the First War of Scottish Independence."
  ]
}