{
  "years": [
    1905,
    1906,
    1907,
    1908
  ],
  "minYear": 1905,
  "maxYear": 1908,
  "events": [
    "In Mexico, the General Hospital of Mexico is inaugurated, started with four basic specialties.",
    "The U.S. Supreme Court upholds the constitutionality of Massachusetts's mandatory smallpox vaccination program in Jacobson v. Massachusetts.",
    "Chicago attorney Paul Harris and three other businessmen meet for lunch to form the Rotary Club, the world's first service club.",
    "Eleftherios Venizelos calls for Crete's union with Greece, and begins what is to be known as the Theriso revolt.",
    "Kaiser Wilhelm II of Germany declares his support for Moroccan independence in Tangier, beginning the First Moroccan Crisis.",
    "The Supreme Court of the United States decides Lochner v. New York, which holds that the \"right to free contract\" is implicit in the due process clause of the Fourteenth Amendment to the United States Constitution.",
    "Albert Einstein completes his doctoral thesis at the University of Zurich.",
    "HMS Dreadnought, the first of a revolutionary new breed of battleships, is christened.",
    "Pope Pius X publishes the encyclical Vehementer Nos.",
    "Édouard de Laveleye forms the Belgian Olympic Committee in Brussels.",
    "Moro Rebellion: United States Army troops bring overwhelming force against the native Moros in the First Battle of Bud Dajo, leaving only six survivors.",
    "The first England vs France rugby union match is played at Parc des Princes in Paris.",
    "The Intercollegiate Athletic Association of the United States (later the National Collegiate Athletic Association) is established to set rules for college sports in the United States.",
    "Mount Vesuvius erupts and devastates Naples.",
    "The Algeciras Conference gives France and Spain control over Morocco.",
    "Maria Montessori opens her first school and daycare center for working class children in Rome, Italy.",
    "Charles Curtis of Kansas becomes the first Native American U.S. Senator.",
    "Belgian chemist Leo Baekeland announces the creation of Bakelite, the world's first synthetic plastic.",
    "The Mud March is the first large procession organised by the National Union of Women's Suffrage Societies (NUWSS).",
    "The unicameral Parliament of Finland gathers for its first plenary session.",
    "The National Association for Women's Suffrage succeeds in getting Norwegian women the right to vote in parliamentary elections.",
    "Grand Canyon National Monument is created.",
    "The Alpha Kappa Alpha sorority becomes the first Greek-letter organization founded and established by African American college women.",
    "New York City passes the Sullivan Ordinance, making it illegal for women to smoke in public, only to have the measure vetoed by the mayor."
  ]
}