{
  "years": [
    1344,
    1345,
    1346,
    1348,
    1335,
    1336,
    1337,
    1338,
    1339,
    1340,
    1342,
    1343
  ],
  "minYear": 1335,
  "maxYear": 1348,
  "events": [
    "At the congress of Visegrád Charles I of Hungary mediates a reconciliation between two neighboring monarchs, John of Bohemia and Casimir III of Poland. ",
    "Four thousand defenders of Pilenai commit mass suicide rather than be taken captive by the Teutonic Knights.",
    "Francesco Petrarca (Petrarch) ascends Mont Ventoux.",
    "Edward, the Black Prince is made Duke of Cornwall, the first Duchy in England.",
    "The Battle of Arnemuiden, in which a French force defeats the English, is the first naval battle of the Hundred Years' War and the first naval battle in which gunpowder artillery is used.",
    "The Milanese army and the St. George's (San Giorgio) Mercenaries of Lodrisio Visconti clash in the Battle of Parabiago; Visconti is defeated.",
    "Hundred Years' War: Battle of Sluys: The French fleet is almost completely destroyed by the English fleet commanded in person by King Edward III.",
    "Reconquista: Portuguese and Castilian forces halt a Muslim invasion at the Battle of Río Salado.",
    "St. Mary Magdalene's flood is the worst such event on record for central Europe.",
    "The Siege of Algeciras commences during the Spanish Reconquista.",
    "St. George's Night Uprising commences in the Duchy of Estonia.",
    "After the execution of her husband, Jeanne de Clisson sells her estates and raises a force of men with which to attack French shipping and ports.",
    "A tsunami, caused by an earthquake in the Tyrrhenian Sea, devastates Naples and the Maritime Republic of Amalfi, among other places.",
    "The lower town of Smyrna is captured by Crusaders in response to Aydınid piracy.",
    "The megas doux Alexios Apokaukos, chief minister of the Byzantine Empire, is lynched by political prisoners.",
    "Friso-Hollandic Wars: Frisians defeat Holland in the Battle of Warns.",
    "Stefan Dušan, \"the Mighty\", is crowned Emperor of the Serbs at Skopje, his empire occupying much of the Balkans.",
    "Charles IV, Count of Luxembourg and King of Bohemia, is elected King of the Romans.",
    "Jaume Ferrer sets out from Majorca for the \"River of Gold\", the Senegal River.",
    "At the Battle of Crécy, an English army easily defeats a French one twice its size.",
    "The English capture King David II of Scotland at Neville's Cross and imprison him for eleven years.",
    "A strong earthquake strikes the South Alpine region of Friuli in modern Italy, causing considerable damage to buildings as far away as Rome.",
    "Holy Roman Emperor Charles IV charters Prague University.",
    "The founding of the Order of the Garter by King Edward III is announced on St. George's Day."
  ]
}