{
  "years": [
    1263,
    1264,
    1265,
    1266,
    1267,
    1268,
    1269,
    1270,
    1271,
    1272,
    1274
  ],
  "minYear": 1263,
  "maxYear": 1274,
  "events": [
    "The Battle of Largs is fought between Norwegians and Scots.",
    "In the conflict between King Henry III of England and his rebellious barons led by Simon de Montfort, King Louis IX of France issues the Mise of Amiens, a one-sided decision in favour of Henry that later leads to the Second Barons' War.",
    "Battle of Lewes: Henry III of England is captured and forced to sign the Mise of Lewes, making Simon de Montfort the effective ruler of England.",
    "The Parliament of Ireland meets at Castledermot in County Kildare, the first definitively known meeting of this Irish legislature.",
    "Mudéjar revolt: Muslim rebel forces took the Alcázar of Jerez de la Frontera after defeating the Castilian garrison.",
    "After tricking the Venetian galley fleet into sailing east to the Levant, the Genoese capture an entire Venetian trade convoy at the Battle of Saseno.",
    "The Statute of Kalisz, guaranteeing Jews safety and personal liberties and giving battei din jurisdiction over Jewish matters, is promulgated by Bolesław the Pious, Duke of Greater Poland.",
    "The first English parliament to include not only Lords but also representatives of the major towns holds its first meeting in the Palace of Westminster, now commonly known as the \"Houses of Parliament\".",
    "A draft Byzantine-Venetian treaty is concluded between Venetian envoys and Emperor Michael VIII Palaiologos, but is not ratified by Doge Reniero Zeno.",
    "War of Saint Sabas: In the Battle of Trapani, the Venetians defeat a larger Genoese fleet, capturing all its ships.",
    "The Treaty of Montgomery recognises Llywelyn ap Gruffudd as Prince of Wales, but only as a vassal of King Henry III.",
    "A five-year Byzantine-Venetian peace treaty is concluded between Venetian envoys and Emperor Michael VIII Palaiologos.",
    "The Principality of Antioch, a crusader state, falls to the Mamluk Sultan Baibars in the Siege of Antioch.",
    "Conradin is executed along with his companion Frederick I, Margrave of Baden by Charles I of Sicily.",
    "The present church building at Westminster Abbey is consecrated.",
    "Grand Duchy of Lithuania defeats the Livonian Order in the Battle of Karuse.",
    "Philip III, although suffering from dysentery, becomes King of France following the death of his father Louis IX, during the Eighth Crusade. His uncle, Charles I of Naples, is forced to begin peace negotiations with Muhammad I al-Mustansir, Hafsid Sultan of Tunis.",
    "The Eighth Crusade ends by an agreement between Charles I of Anjou (replacing his deceased brother King Louis IX of France) and the Hafsid dynasty of Tunis, Tunisia.",
    "The Nizari Ismaili garrison of Gerdkuh, Persia surrender after 17 years to the Mongols.",
    "In Syria, sultan Baibars conquers the Krak des Chevaliers.",
    "Kublai Khan renames his empire \"Yuan\" (元 yuán), officially marking the start of the Yuan dynasty of Mongolia and China.",
    "While travelling during the Ninth Crusade, Prince Edward becomes King of England upon Henry III of England's death, but he will not return to England for nearly two years to assume the throne.",
    "In France, the Second Council of Lyon opens to regulate the election of the Pope.",
    "Edward I of England returns from the Ninth Crusade and is crowned King seventeen days later."
  ]
}