{
  "years": [
    1678,
    1679,
    1680,
    1681,
    1682,
    1683,
    1684
  ],
  "minYear": 1678,
  "maxYear": 1684,
  "events": [
    "Venetian Elena Cornaro Piscopia is the first woman awarded a doctorate of philosophy when she graduates from the University of Padua.",
    "Robert LaSalle builds the Le Griffon, the first known ship built on the Great Lakes.",
    "Trunajaya rebellion: After a long and logistically challenging march, the allied Mataram and Dutch troops successfully assaulted the rebel stronghold of Kediri.",
    "King Charles II of England dissolves the Cavalier Parliament.",
    "The Scottish Covenanters defeat John Graham of Claverhouse at the Battle of Drumclog.",
    "The brigantine Le Griffon, commissioned by René-Robert Cavelier, Sieur de La Salle, is towed to the south-eastern end of the Niagara River, to become the first ship to sail the upper Great Lakes of North America.",
    "The Pueblo Revolt begins in New Mexico.",
    "Pueblo Indians capture Santa Fe from the Spanish during the Pueblo Revolt.",
    "Charles II grants a land charter to William Penn for the area that will later become Pennsylvania.",
    "Robert Cavelier de La Salle discovers the mouth of the Mississippi River, claims it for France and names it Louisiana.",
    "Louis XIV of France moves his court to the Palace of Versailles.",
    "William Penn receives the area that is now the state of Delaware, and adds it to his colony of Pennsylvania.",
    "Bishop Gore School, one of the oldest schools in Wales, is founded.",
    "Philadelphia is founded in the Commonwealth of Pennsylvania.",
    "The Ashmolean Museum in Oxford, England, opens as the world's first university museum.",
    "Manchu Qing dynasty naval forces under traitorous commander Shi Lang defeat the Kingdom of Tungning in the Battle of Penghu near the Pescadores Islands.",
    "Battle of Vienna: Coalition forces, including the famous winged Hussars, led by Polish King John III Sobieski lift the siege laid by Ottoman forces.",
    "Austro-Ottoman War: Battle of Vienna: Several European armies join forces to defeat the Ottoman Empire.",
    "Antonie van Leeuwenhoek writes a letter to the Royal Society describing \"animalcules\", later known as protozoa.",
    "Qing dynasty naval commander Shi Lang receives the surrender of the Tungning kingdom on Taiwan after the Battle of Penghu.",
    "Immigrant families found Germantown, Pennsylvania in the first major immigration of German people to America.",
    "The British Crown colony of New York is subdivided into 12 counties.",
    "The charter of the Massachusetts Bay Colony is revoked via a scire facias writ issued by an English court.",
    "Isaac Newton's derivation of Kepler's laws from his theory of gravity, contained in the paper De motu corporum in gyrum, is read to the Royal Society by Edmond Halley."
  ]
}