{
  "years": [
    1152,
    1153,
    1154,
    1156,
    1157,
    1158,
    1159,
    1161,
    1167,
    1169,
    1147,
    1148,
    1149
  ],
  "minYear": 1147,
  "maxYear": 1169,
  "events": [
    "Seljuk Turks defeat German crusaders under Conrad III at the Battle of Dorylaeum.",
    "Reconquista: After a siege of four months, crusader knights reconquer Lisbon.",
    "Louis VII of France lays siege to Damascus during the Second Crusade.",
    "The Siege of Damascus ends in a decisive crusader defeat and leads to the disintegration of the Second Crusade.",
    "Pope Eugene III takes refuge in the castle of Ptolemy II of Tusculum.",
    "Raymond of Poitiers is defeated and killed at the Battle of Inab by Nur ad-Din Zangi.",
    "The reconstructed Church of the Holy Sepulchre is consecrated in Jerusalem.",
    "Frederick I Barbarossa is elected King of Germany.",
    "Annulment of the marriage of King Louis VII of France and Queen Eleanor of Aquitaine.",
    "The future Henry II of England marries Eleanor of Aquitaine. He would become king two years later, after the death of his cousin once removed King Stephen of England.",
    "Malcolm IV becomes King of Scotland.",
    "Baldwin III of Jerusalem takes control of the Kingdom of Jerusalem from his mother Melisende, and also captures Ascalon.",
    "Henry II of England is crowned at Westminster Abbey.",
    "Finnish peasant Lalli kills English clergyman Henry, the Bishop of Turku, on the ice of Lake Köyliö.",
    "Albert I of Brandenburg, also called The Bear (Ger: Albrecht der Bär), becomes the founder of the Margraviate of Brandenburg, Germany and the first margrave.",
    "The Battle of Grathe Heath ends the Danish Civil War.",
    "Vladislaus II, Duke of Bohemia becomes King of Bohemia.",
    "German city Munich (München) is first mentioned as forum apud Munichen in the Augsburg arbitration by Holy Roman Emperor Friedrich I.",
    "The city of Munich is founded by Henry the Lion on the banks of the river Isar.",
    "Pope Alexander III is chosen.",
    "Battle of Caishi: A Song dynasty fleet fights a naval engagement with Jin dynasty ships on the Yangtze river during the Jin-Song Wars.",
    "Jin-Song wars: Military officers conspire against the emperor Wanyan Liang of the Jin dynasty after a military defeat at the Battle of Caishi, and assassinate the emperor at his camp.",
    "Sicilian Chancellor Stephen du Perche moves the royal court to Messina to prevent a rebellion.",
    "Saladin becomes the emir of Egypt."
  ]
}