{
  "years": [
    1472,
    1473,
    1475,
    1476,
    1477,
    1478,
    1480,
    1482,
    1483,
    1484,
    1486
  ],
  "minYear": 1472,
  "maxYear": 1486,
  "events": [
    "Orkney and Shetland are pawned by Norway to Scotland in lieu of a dowry for Margaret of Denmark.",
    "The Battle of Otlukbeli: Mehmed the Conqueror of the Ottoman Empire decisively defeats Uzun Hassan of Aq Qoyunlu.",
    "Stephen III of Moldavia defeats the Ottoman Empire at the Battle of Vaslui.",
    "The Treaty of Picquigny ends a brief war between  the kingdoms of France and England.",
    "Forces of the Catholic Monarchs engage the combined Portuguese-Castilian armies of Afonso V and Prince John at the Battle of Toro.",
    "Burgundian Wars: The Old Swiss Confederacy hands Charles the Bold, Duke of Burgundy, a major defeat in the Battle of Grandson in Canton of Neuchâtel.",
    "Giuliano della Rovere is appointed bishop of Coutances.",
    "Vlad the Impaler defeats Basarab Laiota with the help of Stephen the Great and Stephen V Báthory and becomes the ruler of Wallachia for the third time.",
    "Battle of Nancy: Charles the Bold is defeated and killed in a conflict with René II, Duke of Lorraine;  Burgundy subsequently becomes part of France.",
    "Uppsala University is inaugurated after receiving its corporate rights from Pope Sixtus IV in February the same year.",
    "George, Duke of Clarence, convicted of treason against his older brother Edward IV of England, is executed in private at the Tower of London.",
    "The Pazzi family attack on Lorenzo de' Medici kills his brother Giuliano during High Mass in Florence Cathedral.",
    "The Great Stand on the Ugra River puts an end to Tartar rule over Moscow",
    "Muhammad XII is crowned the twenty-second and last Nasrid king of Granada.",
    "The town and castle of Berwick upon Tweed is captured from Scotland by an English army.",
    "Gran Canaria, the main island of the Canary Islands, is conquered by the Kingdom of Castile.",
    "Richard III becomes King of England.",
    "Pope Sixtus IV consecrates the Sistine Chapel.",
    "The College of Arms is formally incorporated by Royal Charter signed by King Richard III of England.",
    "William Caxton prints his translation of Aesop's Fables.",
    "Portuguese sea captain Diogo Cão finds the mouth of the Congo River.",
    "Pope Innocent VIII succeeds Pope Sixtus IV.",
    "King Henry VII of England marries Elizabeth of York, daughter of Edward IV, uniting the House of Lancaster and the House of York.",
    "Christopher Columbus presents his plans discovering a western route to the Indies to the Spanish Queen Isabella I of Castile."
  ]
}