{
  "years": [
    1673,
    1674,
    1675,
    1676,
    1677
  ],
  "minYear": 1673,
  "maxYear": 1677,
  "events": [
    "English lord John Berkeley sold his half of New Jersey to the Quakers",
    "Louis Jolliet and Jacques Marquette begin exploring the Mississippi River.",
    "French explorers Jacques Marquette and Louis Jolliet reach the Mississippi River and become the first Europeans to make a detailed account of its course.",
    "Second Battle of Khotyn in Ukraine: Polish-Lithuanian Commonwealth forces under the command of Jan Sobieski defeat the Ottoman army. In this battle, rockets made by Kazimierz Siemienowicz are successfully used.",
    "England and the Netherlands sign the Treaty of Westminster, ending the Third Anglo-Dutch War. A provision of the agreement transfers the Dutch colony of New Amsterdam to England.",
    "The nobility elect John Sobieski King of Poland and Grand Duke of Lithuania.",
    "Second Tantrik Coronation of Shivaji.",
    "Third Anglo-Dutch War: As provided in the Treaty of Westminster, Netherlands cedes New Netherland to England.",
    "Battle of Colmar: The French army beats Brandenburg.",
    "John Flamsteed is appointed the first Astronomer Royal of England.",
    "The foundation stone of the Royal Greenwich Observatory in London, England is laid.",
    "Franco-Dutch War: Forces of the Holy Roman Empire defeat the French in the Battle of Konzer Brücke.",
    "Leibniz makes the first use of the long s (∫) as a symbol of the integral in calculus.",
    "Plymouth Colony governor Josiah Winslow leads a colonial militia against the Narragansett during King Philip's War.",
    "Gottfried Leibniz demonstrates integral calculus for the first time to find the area under the graph of y = ƒ(x).",
    "Antonio de Vea expedition enters San Rafael Lake in western Patagonia.",
    "The Great Swamp Fight, a pivotal battle in King Philip's War, gives the English settlers a bitterly won victory.",
    "Sixteen men of Pascual de Iriate's expedition are lost at Evangelistas Islets at the western end of the Strait of Magellan.",
    "Nathaniel Bacon issues the \"Declaration of the People of Virginia\", beginning Bacon's Rebellion against the rule of Governor William Berkeley.",
    "Praying Indian John Alderman shoots and kills Metacomet, the Wampanoag war chief, ending King Philip's War.",
    "Jamestown is burned to the ground by the forces of Nathaniel Bacon during Bacon's Rebellion.",
    "The Danish astronomer Ole Rømer presents the first quantitative measurements of the speed of light.",
    "The Royal Danish Army under the command of King Christian V engages the Swedish Army commanded by the Swedish king Charles XI at the Battle of Lund, to this day it is counted as the bloodiest battle in Scandinavian history and a turning point in the Scanian War.",
    "The French army captures the town of Cambrai held by Spanish troops."
  ]
}