{
  "years": [
    1592,
    1593,
    1594,
    1595,
    1596,
    1597
  ],
  "minYear": 1592,
  "maxYear": 1597,
  "events": [
    "During the first Japanese invasion of Korea, Japanese forces led by Toyotomi Hideyoshi captured Pyongyang, although they were ultimately unable to hold it.",
    "The first sighting of the Falkland Islands by John Davis.",
    "Imjin War: At the Battle of Hansan Island, the Korean Navy, led by Yi Sun-sin, Yi Eok-gi, and Won Gyun, decisively defeats the Japanese Navy, led by Wakisaka Yasuharu.",
    "The Dutch city of Coevorden held by the Spanish, falls to a Dutch and English force.",
    "London playwright Thomas Kyd is arrested and tortured by the Privy Council for libel.",
    "Playwright Thomas Kyd's accusations of heresy lead to an arrest warrant for Christopher Marlowe.",
    "Battle of Sisak: Allied Christian troops defeat the Ottomans.",
    "Henry IV of France publicly converts from Protestantism to Roman Catholicism.",
    "Pierre Barrière failed an attempt to assassinate Henry IV of France.",
    "Philip II recognizes the rights and privileges of the local nobles and chieftains in the Philippines, which paved way to the stabilization of the rule of the Principalía (an elite ruling class of native nobility in Spanish Philippines).",
    "Portuguese forces under the command of Pedro Lopes de Sousa begin an unsuccessful invasion of the Kingdom of Kandy during the Campaign of Danture in Sri Lanka.",
    "King James of Scotland holds a masque at the baptism of Prince Henry.",
    "Troops of the Portuguese Empire are defeated on Sri Lanka, bringing an end to the Campaign of Danture.",
    "The relics of Saint Sava are incinerated in Belgrade on the Vračar plateau by Ottoman Grand Vizier Sinan Pasha; the site of the incineration is now the location of the Church of Saint Sava, one of the largest Orthodox churches in the world",
    "Nomenclator of Leiden University Library appears, the first printed catalog of an institutional library.",
    "Long Turkish War: Wallachian prince Michael the Brave confronts the Ottoman army in the Battle of Călugăreni and achieves a tactical victory.",
    "Willem Barents and Jacob van Heemskerk discover Bear Island.",
    "Anglo-Spanish War: English and Dutch troops sack the Spanish city of Cádiz before leaving the next day.",
    "The Spanish ship San Felipe runs aground on the coast of Japan and its cargo is confiscated by local authorities",
    "The second Spanish armada sets sail to strike against England, but is smashed by storms off Cape Finisterre forcing a retreat to port.",
    "The Cudgel War begins in Finland (at the time part of Sweden), when peasants rebel against the imposition of taxes by the nobility.",
    "A group of early Japanese Christians are killed by the new government of Japan for being seen as a threat to Japanese society.",
    "The last battle of the Cudgel War was fought on the Santavuori Hill in Ilmajoki, Ostrobothnia.",
    "Islands Voyage: Robert Devereux, 2nd Earl of Essex, and Sir Walter Raleigh set sail on an expedition to the Azores."
  ]
}