{
  "years": [
    1312,
    1313,
    1314,
    1315,
    1316,
    1306,
    1307,
    1308,
    1309,
    1310,
    1311
  ],
  "minYear": 1306,
  "maxYear": 1316,
  "events": [
    "In front of the high altar of Greyfriars Church in Dumfries, Robert the Bruce murders John Comyn, sparking the revolution in the Wars of Scottish Independence.",
    "Robert the Bruce becomes King of Scots (Scotland).",
    "The Earl of Pembroke's army defeats Bruce's Scottish army at the Battle of Methven.",
    "Külüg Khan is enthroned as Khagan of the Mongols and Wuzong of the Yuan.",
    "Hundreds of the Knights Templar in France are arrested at dawn by King Philip the Fair, and later confess under torture to heresy.",
    "Pope Clement V issues the papal bull Pastoralis Praeeminentiae which instructed all Christian monarchs in Europe to arrest all Templars and seize their assets.",
    "The reign of Emperor Hanazono of Japan begins.",
    "Henry VII is recognized King of the Romans by Pope Clement V.",
    "The First Siege of Gibraltar takes place in the context of the Spanish Reconquista pitting the forces of the Kingdom of Castile against the Emirate of Granada resulting in a Castilian victory.",
    "The city of Rhodes surrenders to the forces of the Knights of St. John, completing their conquest of Rhodes. The knights establish their headquarters on the island and rename themselves the Knights of Rhodes.",
    "Battle of Halmyros: The Catalan Company defeats Walter V, Count of Brienne to take control of the Duchy of Athens, a Crusader state in Greece.",
    "Duccio's Maestà, a seminal artwork of the early Italian Renaissance, is unveiled and installed in Siena Cathedral in Siena, Italy.",
    "The Council of Vienne convenes for the first time.",
    "Vox in excelso: Pope Clement V dissolves the Order of the Knights Templar.",
    "At the Battle of Rozgony, King Charles I of Hungary wins a decisive victory over the family of Palatine Amade Aba.",
    "King Thihathu founds the Pinya Kingdom as the de jure successor state of the Pagan Kingdom.",
    "Louis the Bavarian defeats his cousin Frederick I of Austria at the Battle of Gammelsdorf.",
    "Jacques de Molay, the 23rd and final Grand Master of the Knights Templar, is burned at the stake.",
    "First War of Scottish Independence: The Battle of Bannockburn (south of Stirling) begins.",
    "King Haakon V of Norway moves the capital from Bergen to Oslo.",
    "Enguerrand de Marigny is hanged at the instigation of Charles, Count of Valois.",
    "The Great Famine of Europe becomes so dire that even the king of England has difficulties buying bread for himself and his entourage.",
    "Growth of the Old Swiss Confederacy: The Schweizer Eidgenossenschaft ambushes the army of Leopold I in the Battle of Morgarten.",
    "The Battle of Picotin, between Ferdinand of Majorca and the forces of Matilda of Hainaut, ends in victory for Ferdinand."
  ]
}