{
  "years": [
    1568,
    1565,
    1566,
    1567
  ],
  "minYear": 1565,
  "maxYear": 1568,
  "events": [
    "Cebu is established becoming the first Spanish settlement in the Philippines.",
    "The Great Siege of Malta begins, in which Ottoman forces attempt and fail to conquer Malta.",
    "Matsunaga Hisahide assassinates the 13th Ashikaga shōgun, Ashikaga Yoshiteru.",
    "Dragut, commander of the Ottoman navy, dies during the Great Siege of Malta.",
    "The widowed Mary, Queen of Scots marries Henry Stuart, Lord Darnley, Duke of Albany, at Holyrood Palace, Edinburgh, Scotland.",
    "Pedro Menéndez de Avilés sights land near St. Augustine, Florida and founds the oldest continuously occupied European-established city in the continental United States.",
    "St. Augustine, Florida is founded by Spanish admiral and Florida's first governor, Pedro Menéndez de Avilés.",
    "The Knights of Malta lift the Ottoman siege of Malta that began on May 18.",
    "Ottoman forces retreat from Malta ending the Great Siege of Malta.",
    "Ships belonging to the Matsura clan of Japan fail to capture the Portuguese trading carrack in the Battle of Fukuda Bay, the first recorded naval battle between Japan and the West.",
    "The foundation stone of Valletta, Malta's capital city, is laid by Jean Parisot de Valette, Grand Master of the Sovereign Military Order of Malta.",
    "Two hundred Dutch noblemen, led by Hendrick van Brederode, force themselves into the presence of Margaret of Parma and present the Petition of Compromise, denouncing the Spanish Inquisition in the Seventeen Provinces.",
    "Battle of Rio de Janeiro: Portuguese forces under the command of Estácio de Sá definitively drive the French out of Rio de Janeiro.",
    "Lord Darnley, second husband of Mary, Queen of Scots, is found strangled following an explosion at the Kirk o' Field house in Edinburgh, Scotland, a suspected assassination.",
    "The Battle of Oosterweel, traditionally regarded as the start of the Eighty Years' War.",
    "Erik XIV of Sweden and his guards murder five incarcerated Swedish nobles.",
    "Mary, Queen of Scots, is forced to abdicate and replaced by her one-year-old son James VI.",
    "Don Diego de Losada founds the city of Santiago de Leon de Caracas, modern-day Caracas, the capital city of Venezuela.",
    "The infant James VI is crowned King of Scotland at Stirling.",
    "The Edict of Torda prohibits the persecution of individuals on religious grounds in John Sigismund Zápolya's Eastern Hungarian Kingdom.",
    "The Peace of Longjumeau is signed, ending the second phase of the French Wars of Religion.",
    "Angered by the brutal onslaught of Spanish troops at Fort Caroline, a French force has burned the San Mateo fort and massacred hundreds of Spaniards.",
    "Mary Queen of Scots is defeated at Battle of Langside, part of Civil war between Queen Mary and Regent Moray.",
    "Dutch rebels led by Louis of Nassau, defeat Jean de Ligne, Duke of Arenberg, and his loyalist troops in the Battle of Heiligerlee, opening the Eighty Years' War."
  ]
}