{
  "years": [
    1248,
    1236,
    1237,
    1238,
    1240,
    1241,
    1242,
    1243,
    1244,
    1245,
    1246
  ],
  "minYear": 1236,
  "maxYear": 1248,
  "events": [
    "King Henry III of England marries Eleanor of Provence.",
    "The Samogitians defeat the Livonian Brothers of the Sword in the Battle of Saule.",
    "Spanish Reconquista: The Battle of the Puig between the Moorish forces of Taifa of Valencia against the Kingdom of Aragon culminates in an Aragonese victory.",
    "England and Scotland sign the Treaty of York, establishing the location of their common border.",
    "The city of Ryazan is sacked by the Mongol army of Batu Khan.",
    "The Mongols burn the Russian city of Vladimir.",
    "The Battle of the Sit River is fought in the northern part of the present-day Yaroslavl Oblast of Russia between the Mongol hordes of Batu Khan and the Russians under Yuri II of Vladimir-Suzdal during the Mongol invasion of Rus'.",
    "King James I of Aragon conquers Valencia from the Moors. Shortly thereafter, he proclaims himself king of Valencia.",
    "James I of Aragon founds the Kingdom of Valencia.",
    "At the instigation of Louis IX of France, an inter-faith debate, known as the Disputation of Paris, starts between a Christian monk and four rabbis.",
    "Swedish-Novgorodian Wars: A Novgorodian army led by Alexander Nevsky defeats the Swedes in the Battle of the Neva.",
    "Mongol invasion of Rus': Kyiv under Daniel of Galicia and Voivode Dmytro falls to the Mongols under Batu Khan.",
    "First Mongol invasion of Poland: Mongols overwhelm Polish armies in Kraków in the Battle of Chmielnik and plunder the city.",
    "Battle of Liegnitz: Mongol forces defeat the Polish and German armies.",
    "Batu Khan defeats Béla IV of Hungary at the Battle of Mohi.",
    "During the Battle on the Ice of Lake Peipus, Russian forces, led by Alexander Nevsky, rebuff an invasion attempt by the Teutonic Knights.",
    "Following the Disputation of Paris, twenty-four carriage loads of Jewish religious manuscripts were burnt in Paris.",
    "Mongols defeat the Seljuk Turks at the Battle of Köse Dağ.",
    "Siege of Jerusalem: The city's citadel, the Tower of David, surrenders to Khwarezmian Empire.",
    "Pope Innocent IV arrives at Lyon for the First Council of Lyon.",
    "Thomas, the first known Bishop of Finland, is granted resignation after confessing to torture and forgery.",
    "Henry Raspe is elected anti-king of the Kingdom of Germany in opposition to Conrad IV.",
    "With the death of Frederick II, Duke of Austria, the Babenberg dynasty ends in Austria.",
    "The Dutch city of Ommen receives city rights and fortification rights from Otto III, the Archbishop of Utrecht."
  ]
}