{
  "years": [
    1440,
    1441,
    1443,
    1445,
    1446,
    1448,
    1449,
    1450,
    1451,
    1452,
    1453
  ],
  "minYear": 1440,
  "maxYear": 1453,
  "events": [
    "The Prussian Confederation is formed.",
    "Gilles de Rais, one of the earliest known serial killers, is taken into custody upon an accusation brought against him by  Jean de Malestroit, Bishop of Nantes.",
    "The Peace of Cremona ends the war between the Republic of Venice and the Duchy of Milan, after the victorious Venetian enterprise of military engineering of the Galeas per montes.",
    "Battle of St. Jakob an der Sihl in the Old Zürich War.",
    "Skanderbeg and his forces liberate Kruja in central Albania and raise the Albanian flag.",
    "John II of Castile defeats the Infantes of Aragon at the First Battle of Olmedo.",
    "The Hangul alphabet is published in Korea.",
    "An Ottoman army defeats a Hungarian army at the Second Battle of Kosovo.",
    "Constantine XI is crowned Byzantine Emperor at Mystras.",
    "Felix V abdicates his claim to the papacy, ending the reign of the final Antipope.",
    "The Battle of Alfarrobeira is fought, establishing the House of Braganza as a principal royal family of Portugal.",
    "Tumu Crisis: The Mongols capture the Emperor of China.",
    "Christian I is crowned king of Denmark.",
    "Kentishmen revolt against King Henry VI.",
    "'Abd al-Latif (Timurid monarch) is assassinated.",
    "Louis IX, Duke of Bavaria expels Jews from his jurisdiction.",
    "Sultan Mehmed II inherits the throne of the Ottoman Empire.",
    "Jacques Cœur is arrested by order of Charles VII of France.",
    "Frederick III of Habsburg is the last Holy Roman Emperor crowned by medieval tradition in Rome by Pope Nicholas V",
    "Mehmed II begins his siege of Constantinople. The city falls on May 29, and is renamed Istanbul.",
    "Three Genoese galleys and a Byzantine blockade runner fight their way through an Ottoman blockading fleet a few weeks before the fall of Constantinople.",
    "Fall of Constantinople: Ottoman armies under Sultan Mehmed II Fatih capture Constantinople after a 53-day siege, ending the Byzantine Empire.",
    "Hundred Years' War: Three months after the Battle of Castillon, England loses its last possessions in southern France.",
    "Ladislaus the Posthumous is crowned king of Bohemia in Prague."
  ]
}