{
  "years": [
    1764,
    1765,
    1766,
    1767,
    1768
  ],
  "minYear": 1764,
  "maxYear": 1768,
  "events": [
    "John Wilkes is expelled from the British House of Commons for seditious libel.",
    "Bolle Willum Luxdorph records in his diary that a mail bomb, possibly the world's first, has severely injured the Danish Colonel Poulsen, residing at Børglum Abbey.",
    "The city of St. Louis is established in Spanish Louisiana (now in Missouri, USA).",
    "Election of Stanisław August Poniatowski as the last ruler of the Polish-Lithuanian Commonwealth.",
    "Port Egmont, the first British settlement in the Falkland Islands near the southern tip of South America, is founded.",
    "The British Parliament passes the Stamp Act that introduces a tax to be levied directly on its American colonies.",
    "Great Britain passes the Quartering Act, which requires the Thirteen Colonies to house British troops.",
    "Treaty of Allahabad is signed. The Treaty marks the political and constitutional involvement and the beginning of Company rule in India.",
    "Antonio de Ulloa, the first Spanish governor of Louisiana, arrives in New Orleans.",
    "American Revolution: The British Parliament repeals the Stamp Act.",
    "A large earthquake causes heavy damage and loss of life in Istanbul and the Marmara region.",
    "François-Jean de la Barre, a young French nobleman, is tortured and beheaded before his body is burnt on a pyre along with a copy of Voltaire's Dictionnaire philosophique nailed to his torso for the crime of not saluting a Roman Catholic religious procession in Abbeville, France.",
    "The last colonial governor of New Jersey, William Franklin, signs the charter of Queen's College (later renamed Rutgers University).",
    "Swedish parliament approves the Swedish Freedom of the Press Act and implements it as a ground law, thus being first in the world with freedom of speech.",
    "In London, auctioneer James Christie holds his first sale.",
    "Samuel Wallis, a British sea captain, sights Tahiti and is considered the first European to reach the island.",
    "Pitcairn Island is discovered by Midshipman Robert Pitcairn on an expeditionary voyage commanded by Philip Carteret.",
    "Norway's oldest newspaper still in print, Adresseavisen, is founded and the first edition is published.",
    "Jesuits all over Chile are arrested as the Spanish Empire suppresses the Society of Jesus.",
    "Surveying for the Mason-Dixon line separating Maryland from Pennsylvania is completed.",
    "Polish nobles form the Bar Confederation.",
    "The Royal Academy of Arts hosts its first art opening.",
    "Rioting occurs in London after John Wilkes is imprisoned for writing an article for The North Briton severely criticizing King George III.",
    "James Otis Jr. offends the King and Parliament in a speech to the Massachusetts General Court."
  ]
}