{
  "years": [
    864,
    868,
    869,
    870,
    871,
    841,
    842,
    843,
    844,
    845,
    876,
    877,
    851,
    852,
    853,
    856,
    861,
    863
  ],
  "minYear": 841,
  "maxYear": 877,
  "events": [
    "In the Battle of Fontenay-en-Puisaye, forces led by Charles the Bald and Louis the German defeat the armies of Lothair I of Italy and Pepin II of Aquitaine.",
    "Charles the Bald and Louis the German swear the Oaths of Strasbourg in the French and German languages.",
    "Triumph of Orthodoxy: Empress Theodora II restores the veneration of icons in the Orthodox churches in the Byzantine Empire.",
    "The Vikings sack French city of Nantes.",
    "Louis II is crowned as king of Italy at Rome by pope Sergius II.",
    "The 42 Martyrs of Amorium are killed after refusing to convert to Islam.",
    "Paris is sacked by Viking raiders, probably under Ragnar Lodbrok, who collects a huge ransom in exchange for leaving.",
    "The first duke of Brittany, Nominoe, defeats the Frankish king Charles the Bald at the Battle of Ballon near Redon.",
    "Battle of Jengland: Erispoe defeats Charles the Bald near the Breton town of Jengland.",
    "Croatian Knez Trpimir I issues a statute, a document with the first known written mention of the Croats name in Croatian sources.",
    "A Byzantine fleet sacks and destroys undefended Damietta in Egypt.",
    "Michael III, emperor of the Byzantine Empire, overthrows the regency of his mother, empress Theodora (wife of Theophilos) with support of the Byzantine nobility.",
    "Assassination of the Abbasid caliph al-Mutawakkil by the Turkish guard, who raise al-Muntasir to the throne. Start of the \"Anarchy at Samarra\".",
    "Major Byzantine victory at the Battle of Lalakaon against an Arab raid.",
    "The Edict of Pistres of Charles the Bald orders defensive measures against the Vikings.",
    "A copy of the Diamond Sutra is printed in China, making it the oldest known dated printed book.",
    "The 8.4-9.0 Mw  Sanriku earthquake strikes the area around Sendai in northern Honshu, Japan. Inundation from the tsunami extended several kilometers inland.",
    "The Fourth Council of Constantinople is convened to depose patriarch Photios I.",
    "Treaty of Meerssen: King Louis the German and his half-brother Charles the Bald partition the Middle Frankish Kingdom into two larger east and west divisions.",
    "The city of Melite surrenders to an Aghlabid army following a siege, putting an end to Byzantine Malta.",
    "Æthelred I and Alfred the Great lead a West Saxon army to repel an invasion by Danelaw Vikings.",
    "The Battle of Dayr al-'Aqul saves Baghdad from the Saffarids.",
    "Frankish forces led by Louis the Younger prevent a West Frankish invasion and defeat emperor Charles II (\"the Bald\").",
    "Louis the Stammerer (son of Charles the Bald) is crowned king of the West Frankish Kingdom at Compiègne."
  ]
}