{
  "years": [
    451,
    452,
    455,
    456,
    457,
    461,
    467,
    437,
    438,
    439,
    472,
    473,
    474,
    475,
    447
  ],
  "minYear": 437,
  "maxYear": 475,
  "events": [
    "Emperor Valentinian III begins his reign over the Western Roman Empire. His mother Galla Placidia ends her regency, but continues to exercise political influence at the court in Rome.",
    "Valentinian III, Western Roman Emperor, marries Licinia Eudoxia, daughter of his cousin Theodosius II, Eastern Roman Emperor in Constantinople unifying the two branches of the House of Theodosius.",
    "Roman emperor Theodosius II publishes the law codex Codex Theodosianus",
    "The Vandals, led by King Gaiseric, take Carthage in North Africa.",
    "A powerful earthquake destroys large portions of the Walls of Constantinople, including 57 towers.",
    "Battle of Avarayr between Armenian rebels and the Sasanian Empire takes place. The Sasanids defeat the Armenians militarily but guarantee them freedom to openly practice Christianity.",
    "The first session of the Council of Chalcedon begins.",
    "The Chalcedonian Creed, regarding the divine and human nature of Jesus, is adopted by the Council of Chalcedon, an ecumenical council.",
    "Severianus, Bishop of Scythopolis, is martyred in Palestine.",
    "Attila leads a Hun army in the invasion of Italy, devastating the northern provinces as he heads for Rome.",
    "Sack of Aquileia: After an earlier defeat on the Catalaunian Plains, Attila lays siege to the metropolis of Aquileia and eventually destroys it.",
    "Petronius Maximus becomes, with support of the Roman Senate, emperor of the Western Roman Empire; he forces Licinia Eudoxia, the widow of his predecessor, Valentinian III, to marry him.",
    "Ricimer defeats Avitus at Piacenza and becomes master of the Western Roman Empire.",
    "Leo I becomes the Eastern Roman emperor.",
    "Majorian is acclaimed as Western Roman emperor.",
    "Roman Emperor Majorian is beheaded near the river Iria in north-west Italy following his arrest and deposition by the magister militum Ricimer.",
    "Libius Severus is declared emperor of the Western Roman Empire. The real power is in the hands of the magister militum Ricimer.",
    "Anthemius is elevated to Emperor of the Western Roman Empire.",
    "After being besieged in Rome by his own generals, Western Roman Emperor Anthemius is captured in St. Peter's Basilica and put to death.",
    "Gundobad (nephew of Ricimer) nominates Glycerius as emperor of the Western Roman Empire.",
    "Seven-year-old Leo II succeeds his maternal grandfather Leo I as Byzantine emperor. He dies ten months later.",
    "Zeno is crowned as co-emperor of the Byzantine Empire.",
    "Julius Nepos forces Roman usurper Glycerius to abdicate the throne and proclaims himself Emperor of the Western Roman Empire.",
    "Byzantine Emperor Zeno is forced to flee his capital at Constantinople, and his general, Basiliscus gains control of the empire."
  ]
}