{
  "years": [
    1801,
    1802,
    1803,
    1804
  ],
  "minYear": 1801,
  "maxYear": 1804,
  "events": [
    "The legislative union of Kingdom of Great Britain and Kingdom of Ireland is completed, and the United Kingdom of Great Britain and Ireland is proclaimed.",
    "Ceres, the largest and first known object in the Asteroid belt, is discovered by Giuseppe Piazzi.",
    "John Marshall is sworn in as Chief Justice of the United States.",
    "War of the Second Coalition: At the Battle of Abukir, a British force under Sir Ralph Abercromby lands in Egypt with the aim of ending the French campaign in Egypt and Syria.",
    "The Battle of Alexandria is fought between British and French forces near the ruins of Nicopolis near Alexandria in Egypt.",
    "Tsar Paul I of Russia is struck with a sword, then strangled, and finally trampled to death inside his bedroom at St. Michael's Castle.",
    "Treaty of Florence is signed, ending the war between the French Republic and the Kingdom of Naples.",
    "French Revolutionary Wars: In the Battle of Copenhagen a British Royal Navy squadron defeats a hastily-assembled, smaller, mostly-volunteer Dano-Norwegian Navy at high cost, forcing Denmark out of the Second League of Armed Neutrality.",
    "The Army Corps of Engineers is established to found and operate the United States Military Academy at West Point.",
    "The Treaty of Amiens is signed as a \"Definitive Treaty of Peace\" between France and the United Kingdom.",
    "Heinrich Wilhelm Matthäus Olbers discovers 2 Pallas, the second asteroid ever to be discovered.",
    "Napoleon Bonaparte signs a general amnesty to allow all but about one thousand of the most notorious émigrés of the French Revolution to return to France.",
    "Washington, D.C. is incorporated as a city after Congress abolishes the Board of Commissioners, the District's founding government. The \"City of Washington\" is given a mayor-council form of government.",
    "King Charles Emmanuel IV of Sardinia abdicates his throne in favor of his brother, Victor Emmanuel.",
    "In Marbury v. Madison, the Supreme Court of the United States establishes the principle of judicial review.",
    "Thousands of meteor fragments fall from the skies of L'Aigle, France; the event convinces European scientists that meteors exist.",
    "Louisiana Purchase: The United States purchases the Louisiana Territory from France for $15 million, more than doubling the size of the young nation.",
    "Haitian Revolution: The Royal Navy led by Rear-Admiral John Thomas Duckworth commence the blockade of Saint-Domingue against French forces.",
    "The Louisiana Purchase is announced to the American people.",
    "The Convention of Artlenburg is signed, leading to the French occupation of the Electorate of Hanover (which had been ruled by the British king).",
    "The Surrey Iron Railway, arguably the world's first public railway, opens in south London, United Kingdom.",
    "British scientist John Dalton begins using symbols to represent the atoms of different elements.",
    "Battle of Delhi, during the Second Anglo-Maratha War, between British troops under General Lake, and Marathas of Scindia's army under General Louis Bourquin.",
    "French rule ends in Haiti. Haiti becomes the first black-majority republic and second independent country in North America after the United States."
  ]
}