{
  "years": [
    1514,
    1515,
    1516,
    1517,
    1518,
    1519,
    1520
  ],
  "minYear": 1514,
  "maxYear": 1520,
  "events": [
    "The Battle of Chaldiran ends with a decisive victory for the Sultan Selim I, Ottoman Empire, over the Shah Ismail I, founder of the Safavid dynasty.",
    "Battle of Orsha: In one of the biggest battles of the century, Lithuanians and Poles defeat the Russian army.",
    "Twenty-year-old Francis, Duke of Brittany, succeeds to the French throne following the death of his father-in-law, Louis XII.",
    "Coronation of Francis I of France takes place at Reims Cathedral, where the new monarch is anointed with the oil of Clovis and girt with the sword of Charlemagne.",
    "Thomas Wolsey is invested as a Cardinal.",
    "The Munich Reinheitsgebot (regarding the ingredients of beer) takes effect in all of Bavaria.",
    "A group of imperial guards, led by Trịnh Duy Sản, murdered Emperor Lê Tương Dực and fled, leaving the capital Thăng Long undefended.",
    "The Treaty of Noyon between France and Spain is signed. Francis I of France recognizes Charles's claim to Naples, and Charles V, Holy Roman Emperor, recognizes Francis's claim to Milan.",
    "The Ottoman Empire under Selim I defeats the Mamluk Sultanate and captures present-day Syria at the Battle of Marj Dabiq.",
    "Second Ottoman-Mamluk War: Mamluks fail to stop the Ottoman advance towards Egypt at the Battle of Yaunis Khan.",
    "Seven Portuguese armed vessels led by Fernão Pires de Andrade meet Chinese officials at the Pearl River estuary.",
    "Protestant Reformation: Martin Luther posts his 95 Theses on the door of the Castle Church in Wittenberg.",
    "Bona Sforza is crowned as queen consort of Poland.",
    "Hernán Cortés arrives in Mexico in search of the Aztec civilization and its wealth.",
    "Hernando Cortes, entering province of Tabasco, defeats Tabascan Indians.",
    "Spanish conquistador Hernán Cortés establishes a settlement at Veracruz, Mexico.",
    "Charles V is elected Emperor of the Holy Roman Empire.",
    "Zhu Chenhao declares the Ming dynasty's Zhengde Emperor a usurper, beginning the Prince of Ning rebellion, and leads his army north in an attempt to capture Nanjing.",
    "Ferdinand Magellan's five ships set sail from Seville to circumnavigate the globe. The Basque second-in-command Juan Sebastián Elcano will complete the expedition after Magellan's death in the Philippines.",
    "Panama City, Panama is founded.",
    "Philosopher and general Wang Yangming defeats Zhu Chenhao, ending the Prince of Ning rebellion against the reign of the Ming dynasty's Zhengde Emperor.",
    "Sten Sture the Younger, the Regent of Sweden, is mortally wounded at the Battle of Bogesund and dies on February 3.",
    "The Revolt of the Comuneros begins in Spain against the rule of Charles V.",
    "The massacre at the festival of Tóxcatl takes place during the Fall of Tenochtitlan, resulting in turning the Aztecs against the Spanish."
  ]
}