{
  "years": [
    1536,
    1537,
    1538,
    1534,
    1535
  ],
  "minYear": 1534,
  "maxYear": 1538,
  "events": [
    "Henry VIII of England is recognized as supreme head of the Church of England.",
    "Jacques Cartier begins his first voyage to what is today the east coast of Canada, Newfoundland and Labrador.",
    "Christian III is elected King of Denmark and Norway in the town of Rye.",
    "French explorer Jacques Cartier plants a cross on the Gaspé Peninsula and takes possession of the territory in the name of Francis I of France.",
    "Anti-Catholic posters appear in Paris and other cities supporting Huldrych Zwingli's position on the Mass.",
    "Following the Affair of the Placards, the French king leads an anti-Protestant procession through Paris.",
    "Spaniard Fray Tomás de Berlanga, the fourth Bishop of Panama, discovers the Galápagos Islands by chance on his way to Peru.",
    "The sun dog phenomenon is observed over Stockholm, as later depicted in the famous painting Vädersolstavlan.",
    "Combined forces loyal to Charles V attack and expel the Ottomans from Tunis during the Conquest of Tunis.",
    "The Anabaptist state of Münster is conquered and disbanded.",
    "Sir Thomas More is executed for treason against King Henry VIII of England.",
    "Pope Paul III excommunicates English King Henry VIII from the church. He drew up a papal bull of excommunication which began Eius qui immobilis.",
    "The Coverdale Bible is printed, with translations into English by William Tyndale and Myles Coverdale.",
    "The first European school of higher learning in the Americas, Colegio de Santa Cruz de Tlatelolco, is founded by Viceroy Antonio de Mendoza and Bishop Juan de Zumárraga in Mexico City.",
    "King Henry VIII of England suffers an accident while jousting, leading to a brain injury that historians say may have influenced his later erratic behaviour and possible impotence.",
    "Charles V makes a Royal Entry into Rome, demolishing a swath of the city to re-enact a Roman triumph.",
    "Anne Boleyn, Queen of England, is arrested and imprisoned on charges of adultery, incest, treason and witchcraft.",
    "The Siege of Cuzco commences, in which Incan forces attempt to retake the city of Cuzco from the Spanish.",
    "George Boleyn, 2nd Viscount Rochford and four other men are executed for treason.",
    "Bigod's Rebellion, an armed insurrection attempting to resist the English Reformation, begins.",
    "Asunción, Paraguay is founded.",
    "The Honourable Artillery Company, the oldest surviving regiment in the British Army, and the second most senior, is formed.",
    "Treaty of Nagyvárad between Holy Roman Emperor Ferdinand I and King John Zápolya of Hungary and Croatia.",
    "Geneva expels John Calvin and his followers from the city. Calvin lives in exile in Strasbourg for the next three years."
  ]
}