{
  "years": [
    1734,
    1735,
    1736,
    1737,
    1738,
    1739
  ],
  "minYear": 1734,
  "maxYear": 1739,
  "events": [
    "In Montreal in New France, a  slave known by the French name of Marie-Joseph Angélique is put to death, having been convicted of setting the fire that destroyed much of the city.",
    "The premiere of George Frideric Handel's Ariodante takes place at the Royal Opera House, Covent Garden.",
    "The ballad opera called Flora, or Hob in the Well went down in history as the first opera of any kind to be produced in North America (Charleston, S.C.)",
    "An agreement between Nader Shah and Russia is signed near Ganja, Azerbaijan and Russian troops are withdrawn from occupied territories.",
    "Freedom of the press: New York Weekly Journal writer John Peter Zenger is acquitted of seditious libel against the royal governor of New York, on the basis that what he had published was true.",
    "Nader Shah, founder of the Afsharid dynasty, is crowned Shah of Iran.",
    "Foundation of the Kingdom of Corsica.",
    "The Battle of Ackia is fought near the present site of Tupelo, Mississippi. British and Chickasaw soldiers repel a French and Choctaw attack on the then-Chickasaw village of Ackia.",
    "Mathematician William Whiston's predicted comet fails to strike the Earth.",
    "The Teatro di San Carlo, the oldest working opera house in Europe, is inaugurated in Naples, Italy.",
    "The Marathas defeat the combined forces of the Mughal Empire, Rajputs of Jaipur, Nizam of Hyderabad, Nawab of Awadh and Nawab of Bengal in the Battle of Bhopal.",
    "A peace treaty is signed between Peshwa Bajirao and Jai Singh II following Maratha victory in the Battle of Bhopal.",
    "Serse, an Italian opera by George Frideric Handel, receives its premiere performance in London, England.",
    "Real Academia de la Historia (\"Royal Academy of History\") is founded in Madrid.",
    "John Wesley is converted, essentially launching the Methodist movement; the day is celebrated annually by Methodists as Aldersgate Day and a church service is generally held on the preceding Sunday.",
    "A treaty between Pennsylvania and Maryland ends the Conojocular War with settlement of a boundary dispute and exchange of prisoners.",
    "Baruch Laibov and Alexander Voznitzin are burned alive in St. Petersburg, Russia. Vonitzin had converted to Judaism with Laibov's help, with the consent of Empress Anna Ivanovna.",
    "Canadian explorer Pierre Gaultier de Varennes et de La Vérendrye reaches the western shore of Lake Michigan.",
    "Bouvet Island, the world's remotest island, is discovered by French explorer Jean-Baptiste Charles Bouvet de Lozier.",
    "Battle of Karnal: The army of Iranian ruler Nader Shah defeats the forces of the Mughal emperor of India, Muhammad Shah.",
    "Stono Rebellion, the largest slave uprising in Britain's mainland North American colonies prior to the American Revolution, erupts near Charleston, South Carolina.",
    "The Treaty of Belgrade is signed, whereby Austria cedes lands south of the Sava and Danube rivers to the Ottoman Empire.",
    "The War of Jenkins' Ear begins with the first attack on La Guaira.",
    "Start of the Battle of Porto Bello between British and Spanish forces during the War of Jenkins' Ear."
  ]
}