{
  "years": [
    1728,
    1729,
    1730,
    1732,
    1733,
    1734,
    1735,
    1726,
    1727
  ],
  "minYear": 1726,
  "maxYear": 1735,
  "events": [
    "The Supreme Privy Council is established in Russia.",
    "Five men arrested during a raid on Mother Clap's molly house in London are executed at Tyburn.",
    "The novel Gulliver's Travels is published.",
    "Premiere of Johann Sebastian Bach's St Matthew Passion BWV 244b at the St. Thomas Church, Leipzig",
    "Anne, eldest daughter of King George II of Great Britain, is given the title Princess Royal.",
    "A barn fire during a puppet show in the village of Burwell in Cambridgeshire, England kills 78 people, many of whom are children.",
    "The foundation stone to the Jerusalem Church in Berlin is laid.",
    "The city of Nuuk in Greenland is founded as the fort of Godt-Haab by the royal governor Claus Paarss.",
    "Founding of Baltimore, Maryland.",
    "Spain, France and Great Britain sign the Treaty of Seville.",
    "Shearith Israel, the first synagogue in New York City, is dedicated.",
    "Ahmed III is forced to abdicate as the Ottoman sultan.",
    "Construction of the Ladoga Canal is completed.",
    "The future Frederick the Great of Prussia is granted a pardon by his father and is released from confinement.",
    "James Oglethorpe is granted a royal charter for the colony of the future U.S. state of Georgia.",
    "The Royal Opera House opens at Covent Garden, London, England.",
    "Georgia Day: Englishman James Oglethorpe founds Georgia, the 13th colony of the Thirteen Colonies, by settling at Savannah.",
    "The right of settlers in New France to enslave natives is upheld at Quebec City.",
    "The first Masonic Grand Lodge in the future United States is constituted in Massachusetts.",
    "In Montreal in New France, a  slave known by the French name of Marie-Joseph Angélique is put to death, having been convicted of setting the fire that destroyed much of the city.",
    "The premiere of George Frideric Handel's Ariodante takes place at the Royal Opera House, Covent Garden.",
    "The ballad opera called Flora, or Hob in the Well went down in history as the first opera of any kind to be produced in North America (Charleston, S.C.)",
    "An agreement between Nader Shah and Russia is signed near Ganja, Azerbaijan and Russian troops are withdrawn from occupied territories.",
    "Freedom of the press: New York Weekly Journal writer John Peter Zenger is acquitted of seditious libel against the royal governor of New York, on the basis that what he had published was true."
  ]
}