{
  "years": [
    1223,
    1225,
    1226,
    1227,
    1228,
    1229,
    1230,
    1232,
    1236,
    1237
  ],
  "minYear": 1223,
  "maxYear": 1237,
  "events": [
    "Mongol invasion of the Cumans: Battle of the Kalka River: Mongol armies of Genghis Khan led by Subutai defeat Kievan Rus' and Cumans.",
    "Louis VIII becomes King of France upon the death of his father, Philip II.",
    "Treaty of San Germano is signed at San Germano between Holy Roman Emperor Frederick II and Pope Gregory IX. A Dominican named Guala is responsible for the negotiations.",
    "Khwarazmian sultan Jalal ad-Din conquers the Georgian capital of Tbilisi.",
    "The first recorded instance of the Catholic practice of perpetual Eucharistic adoration formally begins in Avignon, France.",
    "Investiture Controversy: Frederick II, Holy Roman Emperor, is excommunicated by Pope Gregory IX for his failure to participate in the Crusades.",
    "Gąsawa massacre: At an assembly of Piast dukes at Gąsawa, Polish Prince Leszek the White,  Duke Henry the Bearded and others are attacked by assassins while bathing.",
    "The canonization of Saint Francis of Assisi",
    "Holy Roman Emperor Frederick II lands in Acre, Israel, and starts the Sixth Crusade, which results in a peaceful restoration of the Kingdom of Jerusalem.",
    "The Sixth Crusade: Frederick II, Holy Roman Emperor, signs a ten-year truce with al-Kamil, regaining Jerusalem, Nazareth, and Bethlehem with neither military engagements nor support from the papacy.",
    "Frederick II, Holy Roman Emperor, declares himself King of Jerusalem in the Sixth Crusade.",
    "Battle of Portopí: The Aragonese army under the command of James I of Aragon disembarks at Santa Ponça, Majorca, with the purpose of conquering the island.",
    "Ögedei Khan is proclaimed Khagan of the Mongol Empire in Kodoe Aral, Khentii: Mongolia.",
    "James I the Conqueror, King of Aragon, enters Medina Mayurqa (now known as Palma, Spain), thus consummating the Christian reconquest of the island of Majorca.",
    "Bulgarian Tsar Ivan Asen II defeats Theodore of Epirus in the Battle of Klokotnitsa.",
    "William de Braose is hanged by Prince Llywelyn the Great.",
    "The Siege of Jaén begins, in the context of the Spanish Reconquista.",
    "Mongol-Jin War: The Mongols begin their siege on Kaifeng, the capital of the Jin dynasty.",
    "The Spanish town of Arjona declares independence and names its native Muhammad ibn Yusuf as ruler. This marks the Muhammad's first rise to prominence; he would later establish the Nasrid Emirate of Granada, the last independent Muslim state in Spain.",
    "King Henry III of England marries Eleanor of Provence.",
    "The Samogitians defeat the Livonian Brothers of the Sword in the Battle of Saule.",
    "Spanish Reconquista: The Battle of the Puig between the Moorish forces of Taifa of Valencia against the Kingdom of Aragon culminates in an Aragonese victory.",
    "England and Scotland sign the Treaty of York, establishing the location of their common border.",
    "The city of Ryazan is sacked by the Mongol army of Batu Khan."
  ]
}