{
  "years": [
    439,
    418,
    451,
    421,
    425,
    395,
    428,
    401,
    402,
    435,
    404,
    406,
    438,
    409,
    410,
    447
  ],
  "minYear": 395,
  "maxYear": 451,
  "events": [
    "Emperor Arcadius marries Aelia Eudoxia, daughter of the Frankish general Flavius Bauto. She becomes one of the more powerful Roman empresses of Late Antiquity.",
    "Rufinus, praetorian prefect of the East, is murdered by Gothic mercenaries under Gainas.",
    "Later Yan is defeated by its former vassal Northern Wei at the Battle of Canhe Slope.",
    "The Visigoths, led by king Alaric I, cross the Alps and invade northern Italy.",
    "Pope Innocent I is elected, the only pope to succeed his father in the office.",
    "Stilicho defeats the Visigoths under Alaric in the Battle of Pollentia.",
    "Saint Telemachus tries to stop a gladiatorial fight in a Roman amphitheatre, and is stoned to death by the crowd. This act impresses the Christian Emperor Honorius, who issues a historic ban on gladiatorial fights.",
    "Byzantine Empress Eudoxia dies from the miscarriage of her seventh pregnancy.",
    "Vandals, Alans and Suebians cross the Rhine, beginning an invasion of Gaul.",
    "Vandals and Alans cross the Pyrenees and appear in Hispania.",
    "The sacking of Rome by the Visigoths ends after three days.",
    "A papal conclave begins, resulting in the election of Pope Boniface I.",
    "Constantius III becomes co-Emperor of the Western Roman Empire.",
    "Italian city Venice is founded with the dedication of the first church, that of San Giacomo di Rialto on the islet of Rialto.",
    "The University of Constantinople is founded by Emperor Theodosius II at the urging of his wife Aelia Eudocia.",
    "Valentinian III is elevated as Roman emperor at the age of six.",
    "Nestorius becomes the Patriarch of Constantinople. Three years later, he would be deposed due to alleged heresy.",
    "Deposed Ecumenical Patriarch of Constantinople Nestorius, considered the originator of Nestorianism, is exiled by Roman Emperor Theodosius II to a monastery in Egypt.",
    "Roman emperor Theodosius II publishes the law codex Codex Theodosianus",
    "The Vandals, led by King Gaiseric, take Carthage in North Africa.",
    "A powerful earthquake destroys large portions of the Walls of Constantinople, including 57 towers.",
    "Battle of Avarayr between Armenian rebels and the Sasanian Empire takes place. The Sasanids defeat the Armenians militarily but guarantee them freedom to openly practice Christianity.",
    "The first session of the Council of Chalcedon begins.",
    "The Chalcedonian Creed, regarding the divine and human nature of Jesus, is adopted by the Council of Chalcedon, an ecumenical council."
  ]
}