{
  "years": [
    484,
    489,
    490,
    491,
    461,
    467,
    472,
    473,
    474,
    475,
    476
  ],
  "minYear": 461,
  "maxYear": 491,
  "events": [
    "Majorian is arrested near Tortona (northern Italy) and deposed by the Suebian general Ricimer as puppet emperor.",
    "Roman Emperor Majorian is beheaded near the river Iria in north-west Italy following his arrest and deposition by the magister militum Ricimer.",
    "Libius Severus is declared emperor of the Western Roman Empire. The real power is in the hands of the magister militum Ricimer.",
    "Anthemius is elevated to Emperor of the Western Roman Empire.",
    "After being besieged in Rome by his own generals, Western Roman Emperor Anthemius is captured in St. Peter's Basilica and put to death.",
    "Gundobad (nephew of Ricimer) nominates Glycerius as emperor of the Western Roman Empire.",
    "Emperor Leo I acclaims his grandson Leo II as Caesar of the East Roman Empire.",
    "Seven-year-old Leo II succeeds his maternal grandfather Leo I as Byzantine emperor. He dies ten months later.",
    "Zeno is crowned as co-emperor of the Byzantine Empire.",
    "Julius Nepos forces Roman usurper Glycerius to abdicate the throne and proclaims himself Emperor of the Western Roman Empire.",
    "Byzantine Emperor Zeno is forced to flee his capital at Constantinople, and his general, Basiliscus gains control of the empire.",
    "The Roman general Orestes forces western Roman Emperor Julius Nepos to flee his capital city, Ravenna.",
    "Romulus Augustulus is proclaimed Western Roman Emperor.",
    "Odoacer, chieftain of the Germanic tribes (Herulic - Scirian foederati), is proclaimed rex Italiae (\"King of Italy\") by his troops.",
    "King Huneric of the Vandals replaces Nicene bishops with Arian ones, and banishes some to Corsica.",
    "Leontius, Roman usurper, is crowned Eastern emperor at Tarsus (modern Turkey). He is recognized in Antioch and makes it his capital.",
    "The Arian Vandal Kingdom ceases its persecution of Nicene Christianity.",
    "Alaric II succeeds his father Euric and becomes king of the Visigoths. He establishes his capital at Aire-sur-l'Adour (Southern Gaul).",
    "Theodoric, king of the Ostrogoths, defeats Odoacer at the Battle of Isonzo, forcing his way into Italy.",
    "The Ostrogoths under Theoderic the Great defeat the forces of Odoacer for the second time.",
    "Battle of Adda: The Goths under Theodoric the Great and his ally Alaric II defeat the forces of Odoacer on the Adda River, near Milan.",
    "Flavius Anastasius becomes Byzantine emperor, with the name of Anastasius I.",
    "Empress Ariadne marries Anastasius I. The widowed Augusta is able to choose her successor for the Byzantine throne, after Zeno (late emperor) dies of dysentery.",
    "Odoacer makes a night assault with his Heruli guardsmen, engaging Theoderic the Great in Ad Pinetam. Both sides suffer heavy losses, but in the end Theodoric forces Odoacer back into Ravenna."
  ]
}