{
  "years": [
    535,
    536,
    537,
    538,
    552,
    553,
    554,
    557,
    558,
    561,
    582,
    583,
    587,
    589,
    590,
    598,
    599,
    610,
    613
  ],
  "minYear": 535,
  "maxYear": 613,
  "events": [
    "Byzantine general Belisarius completes the conquest of Sicily, defeating the Gothic garrison of Palermo (Panormos), and ending his consulship for the year.",
    "Gothic War: The Byzantine general Belisarius enters Rome unopposed; the Gothic garrison flees the capital.",
    "Siege of Rome: The Ostrogoth army under king Vitiges begins the siege of the capital. Belisarius conducts a delaying action outside the Flaminian Gate; he and a detachment of his bucellarii are almost cut off.",
    "The second Hagia Sophia in Constantinople is consecrated.",
    "Vitiges, king of the Ostrogoths ends his siege of Rome and retreats to Ravenna, leaving the city to the victorious Byzantine general, Belisarius.",
    "Battle of Taginae: Byzantine forces under Narses defeat the Ostrogoths in Italy, and the Ostrogoth king, Totila, is mortally wounded.",
    "The Second Council of Constantinople begins.",
    "Emperor Justinian I rewards Liberius for his service in the Pragmatic Sanction, granting him extensive estates in Italy.",
    "Constantinople is severely damaged by an earthquake, which cracks the dome of Hagia Sophia.",
    "In Constantinople, the dome of the Hagia Sophia collapses, twenty years after its construction. Justinian I immediately orders that the dome be rebuilt.",
    "Chlothar I is crowned King of the Franks.",
    "Following the death of King Chlothar I at Compiègne, his four sons, Charibert I, Guntram, Sigebert I and Chilperic I, divide the Frankish Kingdom.",
    "Maurice becomes Emperor of the Byzantine Empire.",
    "Maya queen Yohl Ik'nal is crowned ruler of Palenque.",
    "Treaty of Andelot: King Guntram of Burgundy recognizes Childebert II as his heir.",
    "Reccared I opens the Third Council of Toledo, marking the entry of Visigothic Spain into the Catholic Church.",
    "King Authari marries Theodelinda, daughter of the Bavarian duke Garibald I. A Catholic, she has great influence among the Lombard nobility.",
    "Khosrau II is crowned king of Persia.",
    "Consecration of Pope Gregory I (Gregory the Great).",
    "Balkan Campaign: The Avars lift the siege at the Byzantine stronghold of Tomis. Their leader Bayan I retreats north of the Danube River after the Avaro-Slavic hordes are decimated by the plague.",
    "Goguryeo-Sui War: Emperor Wéndi of Sui orders his youngest son, Yang Liang (assisted by the co-prime minister Gao Jiong), to conquer Goguryeo (Korea) during the Manchurian rainy season, with a Chinese army and navy.",
    "Maya king Uneh Chan of Calakmul attacks rival city-state Palenque in southern Mexico, defeating queen Yohl Ik'nal and sacking the city.",
    "Heraclius arrives at Constantinople, kills Byzantine Emperor Phocas, and becomes emperor.",
    "Eight-month-old Constantine is crowned as co-emperor (Caesar) by his father Heraclius at Constantinople."
  ]
}