{
  "years": [
    1760,
    1761,
    1762,
    1763
  ],
  "minYear": 1760,
  "maxYear": 1763,
  "events": [
    "Ahmad Shah Durrani defeats the Marathas in the Battle of Barari Ghat.",
    "French forces commence the siege of Quebec which is held by the British.",
    "Great Upheaval: New England planters arrive to claim land in Nova Scotia, Canada, taken from the Acadians.",
    "French and Indian War: Robert Rogers and his Rangers surprise French held Fort Sainte Thérèse on the Richelieu River near Lake Champlain. The fort is raided and burned.",
    "Seven Years' War: Battle of Landeshut: Austria defeats Prussia.",
    "Anglo-Cherokee War: Cherokee warriors defeat British forces at the Battle of Echoee near present-day Otto, North Carolina.",
    "British forces defeat French forces in the last naval battle in New France.",
    "The Third Battle of Panipat is fought in India between the Afghans under Ahmad Shah Durrani and the Marathas.",
    "Marriage of King George III of the United Kingdom to Duchess Charlotte of Mecklenburg-Strelitz.",
    "George III and Charlotte of Mecklenburg-Strelitz are crowned King and Queen, respectively, of the Kingdom of Great Britain.",
    "Great Britain declares war on Spain, which meant the entry of Spain into the Seven Years' War.",
    "Russia and Prussia sign the Treaty of St. Petersburg.",
    "Sweden and Prussia sign the Treaty of Hamburg.",
    "Trevi Fountain is officially completed and inaugurated in Rome.",
    "In the Seven Years' War, British forces begin the Siege of Havana and temporarily capture the city.",
    "Battle of Wilhelmsthal: The British-Hanoverian army of Ferdinand of Brunswick defeats French forces in Westphalia.",
    "Catherine the Great becomes Empress of Russia following the coup against her husband, Peter III.",
    "Former emperor Peter III of Russia is murdered.",
    "The Sultanate of Sulu ceded Balambangan Island to the British East India Company",
    "Berbice slave uprising in Guyana: The first major slave revolt in South America.",
    "Pontiac's War begins with Pontiac's attempt to seize Fort Detroit from the British.",
    "Odawa Chief Pontiac's forces defeat British troops at the Battle of Bloody Run during Pontiac's War.",
    "Seneca warriors defeat British forces at the Battle of Devil's Hole during Pontiac's War.",
    "Dedication of the Touro Synagogue, in Newport, Rhode Island, the first synagogue in what will become the United States."
  ]
}