{
  "years": [
    1611,
    1612,
    1613,
    1614,
    1615,
    1616
  ],
  "minYear": 1611,
  "maxYear": 1616,
  "events": [
    "Establishment of the Pontifical and Royal University of Santo Tomas, The Catholic University of the Philippines, the largest Catholic university in the world.",
    "The King James Version of the Bible is published for the first time in London, England, by printer Robert Barker.",
    "The mutinous crew of Henry Hudson's fourth voyage sets Henry, his son and seven loyal crew members adrift in an open boat in what is now Hudson Bay; they are never heard from again.",
    "Russian homage to the King of Poland, Sigismund III Vasa.",
    "Shakespeare's play The Tempest is performed for the first time, at Whitehall Palace in London.",
    "Miyamoto Musashi defeats Sasaki Kojirō at Funajima island.",
    "Famous sword duel between Miyamoto Musashi and Sasaki Kojiro on the shores of Ganryū Island. Kojiro dies at the end.",
    "The trial of the Pendle witches, one of England's most famous witch trials, begins at Lancaster Assizes.",
    "The \"Samlesbury witches\", three women from the Lancashire village of Samlesbury, England, are put on trial, accused of practicing witchcraft, one of the most famous witch trials in British history.",
    "During the Time of Troubles, Polish troops are expelled from Moscow's Kitay-gorod by Russian troops under the command of Dmitry Pozharsky (22 October O.S.).",
    "The Battle of Swally takes place, which loosens the Portuguese Empire's hold on India.",
    "Wedding of Princess Elizabeth and Frederick V of the Palatinate at Whitehall Palace, London.",
    "Mikhail I is unanimously elected Tsar by a national assembly, beginning the Romanov dynasty of Imperial Russia.",
    "Samuel Argall, having captured Pocahontas in Passapatanzy, Virginia, sets off with her to Jamestown with the intention of exchanging her for English prisoners held by her father.",
    "The Globe Theatre in London, built by William Shakespeare's playing company, the Lord Chamberlain's Men, burns to the ground.",
    "The first English expedition (from Virginia) against Acadia led by Samuel Argall takes place.",
    "In Virginia, Native American Pocahontas marries English colonist John Rolfe.",
    "Raid on Żejtun: The south east of Malta, and the town of Żejtun, suffer a raid from Ottoman forces. This was the last unsuccessful attempt by the Ottomans to conquer the island of Malta.",
    "Fettmilch Uprising: Jews are expelled from Frankfurt, Holy Roman Empire, following the plundering of the Judengasse.",
    "The New Netherland Company applies to the States General of the Netherlands for exclusive trading rights in what is now the northeastern United States.",
    "Japanese daimyō Dom Justo Takayama is exiled to the Philippines by shōgun Tokugawa Ieyasu for being Christian.",
    "The Wignacourt Aqueduct is inaugurated in Malta.",
    "Siege of Osaka: Forces under Tokugawa Ieyasu take Osaka Castle in Japan.",
    "The city of Belém, Brazil is founded on the Amazon River delta, by Portuguese captain Francisco Caldeira Castelo Branco."
  ]
}