{
  "years": [
    1120,
    1122,
    1124,
    1126,
    1127,
    1128,
    1130,
    1135,
    1105,
    1106,
    1108,
    1110,
    1111,
    1112,
    1113,
    1118
  ],
  "minYear": 1105,
  "maxYear": 1135,
  "events": [
    "Maginulfo is elected the Antipope as Sylvester IV.",
    "Holy Roman Emperor Henry IV is forced to abdicate in favor of his son, Henry V, in Ingelheim.",
    "King Henry I of England defeats his brother Robert Curthose at the Battle of Tinchebray.",
    "Battle of Uclés: Almoravid troops under the command of Tamim ibn Yusuf defeat a Castile and León alliance under the command of Prince Sancho Alfónsez.",
    "The Kingdom of Jerusalem captures Sidon.",
    "Henry V is crowned Holy Roman Emperor.",
    "Highest Galician nobility led by Pedro Fróilaz de Traba and the bishop Diego Gelmírez crown Alfonso VII as \"King of Galicia\".",
    "Ramon Berenguer III, Count of Barcelona, and Douce I, Countess of Provence, marry, uniting the fortunes of those two states.",
    "Pope Paschal II issues Pie Postulatio Voluntatis, recognizing the Order of Hospitallers.",
    "Roger of Salerno, Prince of Antioch, captures Azaz from the Seljuk Turks.",
    "Crusades: The Council of Nablus is held, establishing the earliest surviving written laws of the Crusader Kingdom of Jerusalem.",
    "Richard III of Capua is anointed as Prince two weeks before his untimely death.",
    "Jordan II of Capua is anointed as prince after his infant nephew's death.",
    "The White Ship sinks in the English Channel, drowning William Adelin, son and heir of Henry I of England.",
    "Pope Callixtus II and Holy Roman Emperor Henry V agree to the Concordat of Worms to put an end to the Investiture Controversy.",
    "The city of Tyre falls to the Venetian Crusade after a siege of nineteen weeks.",
    "Pope Honorius II is consecrated, having been elected after the controversial dethroning of Pope Celestine II.",
    "Emperor Huizong abdicates the Chinese throne in favour of his son Emperor Qinzong.",
    "Following the death of his mother, queen Urraca of León, Alfonso VII is proclaimed king of León.",
    "Jin-Song Wars: Invading Jurchen soldiers from the Jin dynasty besiege and sack Bianjing (Kaifeng), the capital of the Song dynasty of China, and abduct Emperor Qinzong of Song and others, ending the Northern Song dynasty.",
    "Geoffrey V of Anjou, known as Plantagenet, marries Matilda, daughter of Henry I, King of England, and widow of the Emperor Henry V.",
    "Count Roger II of Sicily is crowned the first king of Sicily.",
    "Alfonso VII of León and Castile is crowned in León Cathedral as Imperator totius Hispaniae (Emperor of all of Spain).",
    "Three weeks after the death of King Henry I of England, Stephen of Blois claims the throne and is privately crowned King of England, beginning the English Anarchy."
  ]
}