{
  "years": [
    1697,
    1698,
    1699,
    1700,
    1701,
    1695
  ],
  "minYear": 1695,
  "maxYear": 1701,
  "events": [
    "French forces end the bombardment of Brussels.",
    "Henry Every perpetrates one of the most profitable pirate raids in history with the capture of the Grand Mughal ship Ganj-i-Sawai. In response, Emperor Aurangzeb threatens to end all English trading in India.",
    "Zumbi, the last of the leaders of Quilombo dos Palmares in early Brazil, is executed by the forces of Portuguese bandeirante Domingos Jorge Velho.",
    "Nojpetén, capital of the last independent Maya kingdom, falls to Spanish conquistadors, the final step in the Spanish conquest of Guatemala.",
    "Safavid government troops take control of Basra.",
    "Stockholm's royal castle (dating back to medieval times) is destroyed by fire. It is replaced in the 18th century by the current Royal Palace.",
    "War of the Grand Alliance : A French warship commanded by Captain Pierre Le Moyne d'Iberville defeated an English squadron at the Battle of Hudson's Bay.",
    "The Treaty of Ryswick is signed by France, England, Spain, the Holy Roman Empire and the Dutch Republic, ending the Nine Years' War.",
    "St Paul's Cathedral, rebuilt to the design of Sir Christopher Wren following the Great Fire of London, is consecrated.",
    "Thomas Savery patents the first steam engine.",
    "In an effort to Westernize his nobility, Tsar Peter I of Russia imposes a tax on beards for all men except the clergy and peasantry.",
    "For the first time, the Ottoman Empire permanently cedes territory to the Christian powers.",
    "First Leopoldine Diploma is issued by the Holy Roman Emperor, recognizing the Greek Catholic clergy enjoyed the same privileges as Roman Catholic priests in the Principality of Transylvania.",
    "Guru Gobind Singh establishes the Khalsa in Anandpur Sahib, Punjab.",
    "The Sikh religion was formalised as the Khalsa – the brotherhood of Warrior-Saints – by Guru Gobind Singh in northern India, in accordance with the Nanakshahi calendar.",
    "Russia begins using the Anno Domini era instead of the Anno Mundi era of the Byzantine Empire.",
    "The 8.7-9.2 Mw Cascadia earthquake takes place off the west coast of North America, as evidenced by Japanese records.",
    "William Dampier is the first European to circumnavigate New Britain, discovering it is an island (which he names Nova Britannia) rather than part of New Guinea.",
    "Frederick I crowns himself King of Prussia in Königsberg.",
    "A Bourbon force under Nicolas Catinat withdraws from a smaller Habsburg force under Prince Eugene of Savoy in the Battle of Carpi.",
    "Representatives of the Iroquois Confederacy sign the Nanfan Treaty, ceding a large territory north of the Ohio River to England.",
    "Antoine de la Mothe Cadillac founds the trading post at Fort Pontchartrain, which later becomes the city of Detroit.",
    "Great Peace of Montreal between New France and First Nations is signed.",
    "James Francis Edward Stuart, sometimes called the \"Old Pretender\", becomes the Jacobite claimant to the thrones of England and Scotland."
  ]
}