{
  "years": [
    64,
    33,
    65,
    36,
    37,
    38,
    68,
    8,
    9,
    41,
    14,
    17,
    19,
    51,
    55,
    23,
    25,
    62
  ],
  "minYear": 8,
  "maxYear": 68,
  "events": [
    "Roman Empire general Tiberius defeats the Dalmatae on the river Bosna.",
    "The Western Han dynasty ends when Wang Mang claims that the divine Mandate of Heaven called for the end of the dynasty and the beginning of his own, the Xin dynasty.",
    "Arminius' alliance of six Germanic tribes ambushes and annihilates three Roman legions of Publius Quinctilius Varus in the Battle of the Teutoburg Forest.",
    "The Battle of the Teutoburg Forest ends: The Roman Empire suffers the greatest defeat of its history and the Rhine is established as the border between the Empire and the so-called barbarians for the next four hundred years.",
    "Agrippa Postumus, maternal grandson of the late Roman emperor Augustus, is executed by his guards under mysterious circumstances while in exile.",
    "Germanicus celebrates a triumph in Rome for his victories over the Cherusci, Chatti, and other German tribes west of the Elbe.",
    "The Roman general Germanicus dies near Antioch. He was convinced that the mysterious illness that ended in his death was a result of poisoning by the Syrian governor Gnaeus Calpurnius Piso, whom he had ordered to leave the province.",
    "Rebels sack the Chinese capital Chang'an during a peasant rebellion.",
    "Rebels decapitate Wang Mang two days after his capital was sacked during a peasant rebellion.",
    "Guangwu claims the throne as Emperor of China, restoring the Han dynasty after the collapse of the short-lived Xin dynasty.",
    "Luoyang is declared capital of the Eastern Han dynasty by Emperor Guangwu of Han.",
    "According to one historian's account, Jesus Christ's Last Supper is held.",
    "Forces of Emperor Guangwu of the Eastern Han, under the command of Wu Han, conquer the separatist Chengjia empire, reuniting China.",
    "Roman Senate annuls Tiberius' will and proclaims Gaius Julius Caesar Augustus Germanicus (aka Caligula = Little Boots) emperor.",
    "Roman emperor Caligula accepts the titles of the Principate, bestowed on him by the Senate.",
    "Drusilla, Caligula's sister who died in June, with whom the emperor is said to have an incestuous relationship, is deified.",
    "Claudius is proclaimed Roman emperor by the Praetorian Guard after they assassinate the previous emperor, his nephew Caligula.",
    "After a night of negotiation, Claudius is accepted as Roman emperor by the Senate.",
    "Nero, later to become Roman emperor, is given the title princeps iuventutis (head of the youth).",
    "The death under mysterious circumstances of Tiberius Claudius Caesar Britannicus, heir to the Roman empire, on the eve of his coming of age clears the way for Nero to become Emperor.",
    "Earthquake in Pompeii, Italy.",
    "The Great Fire of Rome causes widespread devastation and rages on for six days, destroying half of the city.",
    "The freedman Milichus betrays Piso's plot to kill the Emperor Nero and all the conspirators are arrested.",
    "Nero commits suicide, after quoting Vergil's Aeneid, thus ending the Julio-Claudian dynasty and starting the civil war known as the Year of the Four Emperors."
  ]
}