{
  "years": [
    1856,
    1857,
    1858
  ],
  "minYear": 1856,
  "maxYear": 1858,
  "events": [
    "First Battle of Seattle: Marines from the USS Decatur drive off American Indian attackers after all-day battle with settlers.",
    "Queen Victoria issues a Warrant under the Royal sign-manual that establishes the Victoria Cross to recognise acts of valour by British military personnel during the Crimean War.",
    "The Kingdom of Awadh is annexed by the British East India Company and Wajid Ali Shah, the king of Awadh, is deposed.",
    "The United States Republican Party opens its first national convention in Pittsburgh.",
    "The Treaty of Paris is signed, ending the Crimean War.",
    "Second Battle of Rivas: Juan Santamaría burns down the hostel where William Walker's filibusters are holed up.",
    "Australian labour movement: Stonemasons and building workers on building sites around Melbourne march from the University of Melbourne to Parliament House to achieve an eight-hour day.",
    "Lawrence, Kansas is captured and burned by pro-slavery forces.",
    "Congressman Preston Brooks of South Carolina severely beats Senator Charles Sumner of Massachusetts with a cane in the hall of the United States Senate for a speech Sumner had made regarding  Southerners and slavery.",
    "John Brown and his men kill five slavery supporters at Pottawatomie Creek, Kansas.",
    "The 7.9 Mw  Fort Tejon earthquake shakes Central and Southern California with a maximum Mercalli intensity of IX (Violent).",
    "The University of Calcutta is formally founded as the first fully fledged university in South Asia.",
    "Second Opium War: France and the United Kingdom declare war on China.",
    "The Supreme Court of the United States rules 7-2 in the Dred Scott v. Sandford case that the Constitution does not confer citizenship on black people.",
    "\"The Spirits Book\" by Allan Kardec is published, marking the birth of Spiritualism in France.",
    "The East India Company disbands the 34th Regiment of Bengal Native Infantry whose sepoy Mangal Pandey had earlier revolted against the British in the lead up to the War of Indian Independence.",
    "British forces finally defeat Rajab Ali Khan of Chittagong",
    "Napoleon III of France escapes an assassination attempt made by Felice Orsini and his accomplices in Paris.",
    "The Wedding March by Felix Mendelssohn is played at the marriage of Queen Victoria's daughter, Victoria, and Friedrich of Prussia, and becomes a popular wedding processional.",
    "The first Hallé concert is given in Manchester, England, marking the official founding of The Hallé orchestra as a full-time, professional orchestra.",
    "Bernadette Soubirous's first vision of the Blessed Virgin Mary occurs in Lourdes, France.",
    "The Wernerian Natural History Society, a former Scottish learned society, is wound up.",
    "Minnesota is admitted as the 32nd state of the United States.",
    "Abraham Lincoln delivers his House Divided speech in Springfield, Illinois."
  ]
}