{
  "years": [
    1560,
    1561,
    1562,
    1563,
    1564,
    1565
  ],
  "minYear": 1560,
  "maxYear": 1565,
  "events": [
    "The Treaty of Berwick is signed by England and the Lords of the Congregation of Scotland, establishing the terms under which English armed forces were to be permitted in Scotland in order to expel occupying French troops.",
    "The Catholic Church is overthrown and Protestantism is established as the national religion in Scotland.",
    "Charles IX becomes king of France.",
    "A celestial phenomenon is reported over Nuremberg, described as an aerial battle.",
    "The steeple of St Paul's, the medieval cathedral of London, is destroyed in a fire caused by lightning and is never rebuilt.",
    "Menas, emperor of Ethiopia, defeats a revolt in Emfraz.",
    "Mary, Queen of Scots, aged 18, returns to Scotland after spending 13 years in France.",
    "Willem of Orange marries duchess Anna of Saxony.",
    "Entry of Mary, Queen of Scots into Edinburgh, a spectacular civic celebration for the Queen of Scotland, marred by religious controversy.",
    "The ultimately unsuccessful Colloquy of Poissy opens in an effort to reconcile French Catholics and Protestants.",
    "Fourth Battle of Kawanakajima: Takeda Shingen defeats Uesugi Kenshin in the climax of their ongoing conflicts.",
    "King Philip II of Spain issues cedula, ordering halt to colonizing efforts in Florida.",
    "In Japan the fourth Battle of Kawanakajima is fought between the forces of Uesugi Kenshin and Takeda Shingen, resulting in a draw.",
    "France grants religious toleration to the Huguenots in the Edict of Saint-Germain.",
    "Pope Pius IV reopens the Council of Trent for its third and final session.",
    "Sixty-three Huguenots are massacred in Wassy, France, marking the start of the French Wars of Religion.",
    "Fray Diego de Landa, acting Bishop of Yucatán, burns the sacred idols and books of the Maya.",
    "The Battle of Dreux takes place during the French Wars of Religion.",
    "The Edict of Amboise is signed, ending the first phase of the French Wars of Religion and granting certain freedoms to the Huguenots.",
    "The Council of Trent establishes an official distinction between Roman Catholicism and Protestantism.",
    "The Grand Duchy of Lithuania defeats the Tsardom of Russia in the Battle of Ula during the Livonian War.",
    "Mughal Emperor Akbar abolishes the jizya tax on non-Muslim subjects.",
    "Playwright William Shakespeare is baptized in Stratford-upon-Avon, Warwickshire, England (date of birth is unknown).",
    "Cebu is established becoming the first Spanish settlement in the Philippines."
  ]
}