{
  "years": [
    1666,
    1667,
    1669,
    1670,
    1671,
    1672,
    1673,
    1674
  ],
  "minYear": 1666,
  "maxYear": 1674,
  "events": [
    "The Royal Exchange burns down in the Great Fire of London.",
    "In London, England, the most destructive damage from the Great Fire occurs.",
    "Great Fire of London ends: Ten thousand buildings, including Old St Paul's Cathedral, are destroyed, but only six people are known to have died.",
    "Blind and impoverished, John Milton sells Paradise Lost to a printer for £10, so that it could be entered into the Stationers' Register.",
    "The French Royal Army crosses the border into the Spanish Netherlands, starting the War of Devolution opposing France to the Spanish Empire and the Triple Alliance.",
    "The Raid on the Medway by the Dutch fleet in the Second Anglo-Dutch War ends. It had lasted for five days and resulted in the worst ever defeat of the Royal Navy.",
    "The first human blood transfusion is administered by Dr. Jean-Baptiste Denys.",
    "An English fleet completes the destruction of a French merchant fleet off Fort St Pierre, Martinique during the Second Anglo-Dutch War.",
    "Citing poor eyesight as a reason, Samuel Pepys records the last event in his diary.",
    "The Venetians surrender the fortress of Candia to the Ottomans, thus ending the 21-year-long Siege of Candia.",
    "Henry Morgan captures Panama.",
    "King Charles II of England grants a permanent charter to the Hudson's Bay Company to open up the fur trade in North America.",
    "In Dover, England, Charles II of England and Louis XIV of France sign the Secret Treaty of Dover, which will force England into the Third Anglo-Dutch War.",
    "The expedition of John Narborough leaves Corral Bay, having surveyed the coast and lost four hostages to the Spanish.",
    "Thomas Blood, disguised as a clergyman, attempts to steal England's Crown Jewels from the Tower of London.",
    "Former Grand Pensionary Johan de Witt and his brother Cornelis are lynched by an angry mob in The Hague.",
    "English lord John Berkeley sold his half of New Jersey to the Quakers",
    "Louis Jolliet and Jacques Marquette begin exploring the Mississippi River.",
    "French explorers Jacques Marquette and Louis Jolliet reach the Mississippi River and become the first Europeans to make a detailed account of its course.",
    "Second Battle of Khotyn in Ukraine: Polish-Lithuanian Commonwealth forces under the command of Jan Sobieski defeat the Ottoman army. In this battle, rockets made by Kazimierz Siemienowicz are successfully used.",
    "England and the Netherlands sign the Treaty of Westminster, ending the Third Anglo-Dutch War. A provision of the agreement transfers the Dutch colony of New Amsterdam to England.",
    "The nobility elect John Sobieski King of Poland and Grand Duke of Lithuania.",
    "Second Tantrik Coronation of Shivaji.",
    "Third Anglo-Dutch War: As provided in the Treaty of Westminster, Netherlands cedes New Netherland to England."
  ]
}