{
  "years": [
    1124,
    1126,
    1127,
    1128,
    1130,
    1135,
    1137,
    1138,
    1139,
    1140,
    1141,
    1142,
    1143
  ],
  "minYear": 1124,
  "maxYear": 1143,
  "events": [
    "The city of Tyre falls to the Venetian Crusade after a siege of nineteen weeks.",
    "Pope Honorius II is consecrated, having been elected after the controversial dethroning of Pope Celestine II.",
    "Emperor Huizong abdicates the Chinese throne in favour of his son Emperor Qinzong.",
    "Following the death of his mother, queen Urraca of León, Alfonso VII is proclaimed king of León.",
    "Jin-Song Wars: Invading Jurchen soldiers from the Jin dynasty besiege and sack Bianjing (Kaifeng), the capital of the Song dynasty of China, and abduct Emperor Qinzong of Song and others, ending the Northern Song dynasty.",
    "Geoffrey V of Anjou, known as Plantagenet, marries Matilda, daughter of Henry I, King of England, and widow of the Emperor Henry V.",
    "Battle of São Mamede, near Guimarães: Forces led by Afonso I defeat forces led by his mother Teresa of León and her lover Fernando Pérez de Traba.",
    "Count Roger II of Sicily is crowned the first king of Sicily.",
    "Alfonso VII of León and Castile is crowned in León Cathedral as Imperator totius Hispaniae (Emperor of all of Spain).",
    "Three weeks after the death of King Henry I of England, Stephen of Blois claims the throne and is privately crowned King of England, beginning the English Anarchy.",
    "Eleanor of Aquitaine marries Prince Louis, later King Louis VII of France, at the Cathedral of Saint-André in Bordeaux.",
    "Ranulf of Apulia defeats Roger II of Sicily at the Battle of Rignano, securing his position as duke until his death two years later.",
    "Konrad III von Hohenstaufen was elected king of Germany at Coblenz in the presence of the papal legate Theodwin.",
    "A massive earthquake strikes Aleppo; it is one of the most destructive earthquakes ever.",
    "Lý Anh Tông is enthroned as emperor of Vietnam at the age of two, beginning a 37-year reign.",
    "Roger II of Sicily is excommunicated by Innocent II for supporting Anacletus II as pope for seven years, even though Roger had already publicly recognized Innocent's claim to the papacy.",
    "The French scholar Peter Abelard is found guilty of heresy.",
    "Song dynasty general Yue Fei defeats an army led by Jin dynasty general Wuzhu at the Battle of Yancheng during the Jin-Song Wars.",
    "After a siege of several weeks, the city of Weinsberg and its castle surrender to Conrad III of Germany.",
    "The Battle of Lincoln, at which Stephen, King of England is defeated and captured by the allies of Empress Matilda.",
    "Empress Matilda becomes the first female ruler of England, adopting the title 'Lady of the English'.",
    "Yelü Dashi, the Liao dynasty general who founded the Qara Khitai, defeats the Seljuq and Kara-Khanid forces at the Battle of Qatwan.",
    "A peace treaty ends the Jin-Song wars.",
    "With the signing of the Treaty of Zamora, King Alfonso VII of León and Castile recognises Portugal as a Kingdom."
  ]
}