{
  "years": [
    1312,
    1313,
    1314,
    1315,
    1316,
    1317,
    1319,
    1320,
    1322
  ],
  "minYear": 1312,
  "maxYear": 1322,
  "events": [
    "Vox in excelso: Pope Clement V dissolves the Order of the Knights Templar.",
    "At the Battle of Rozgony, King Charles I of Hungary wins a decisive victory over the family of Palatine Amade Aba.",
    "King Thihathu founds the Pinya Kingdom as the de jure successor state of the Pagan Kingdom.",
    "Louis the Bavarian defeats his cousin Frederick I of Austria at the Battle of Gammelsdorf.",
    "Jacques de Molay, the 23rd and final Grand Master of the Knights Templar, is burned at the stake.",
    "First War of Scottish Independence: The Battle of Bannockburn (south of Stirling) begins.",
    "King Haakon V of Norway moves the capital from Bergen to Oslo.",
    "Enguerrand de Marigny is hanged at the instigation of Charles, Count of Valois.",
    "The Great Famine of Europe becomes so dire that even the king of England has difficulties buying bread for himself and his entourage.",
    "Battle of Montecatini: The army of the Republic of Pisa, commanded by Uguccione della Faggiuola, wins a decisive victory against the joint forces of the Kingdom of Naples and the Republic of Florence despite being outnumbered.",
    "Growth of the Old Swiss Confederacy: The Schweizer Eidgenossenschaft ambushes the army of Leopold I in the Battle of Morgarten.",
    "The Battle of Picotin, between Ferdinand of Majorca and the forces of Matilda of Hainaut, ends in victory for Ferdinand.",
    "The Burgundian and Majorcan claimants of the Principality of Achaea meet in the Battle of Manolada.",
    "The Second Battle of Athenry takes place near Athenry during the Bruce campaign in Ireland.",
    "The \"Nyköping Banquet\": King Birger of Sweden treacherously seizes his two brothers Valdemar, Duke of Finland and Eric, Duke of Södermanland, who were subsequently starved to death in the dungeon of Nyköping Castle.",
    "A Knights Hospitaller fleet scores a crushing victory over an Aydinid fleet off Chios.",
    "Duke Wladyslaw Lokietek becomes king of Poland.",
    "The Scots reaffirm their independence by signing the Declaration of Arbroath.",
    "In the Battle of Saint George, the Byzantines under Andronikos Asen ambush and defeat the forces of the Principality of Achaea, securing possession of Arcadia.",
    "Stephen Uroš III is crowned King of Serbia, having defeated his half-brother Stefan Konstantin in battle. His son is crowned \"young king\" in the same ceremony.",
    "The central tower of Ely Cathedral falls on the night of 12th–13th.",
    "Louis IV, Holy Roman Emperor, defeats Frederick I of Austria in the Battle of Mühldorf.",
    "Mladen II Šubić of Bribir is deposed as the Croatian Ban after the Battle of Bliska.",
    "Robert the Bruce of Scotland defeats King Edward II of England at the Battle of Old Byland, forcing Edward to accept Scotland's independence."
  ]
}