{
  "years": [
    1848,
    1849,
    1846,
    1847
  ],
  "minYear": 1846,
  "maxYear": 1849,
  "events": [
    "Slavery in Tunisia is abolished.",
    "The Battle of Aliwal, India, is won by British troops commanded by Sir Harry Smith.",
    "After the Milwaukee Bridge War, the United States towns of Juneautown and Kilbourntown unify to create the City of Milwaukee.",
    "The first Mormon pioneers make their exodus from Nauvoo, Illinois, westward towards Salt Lake Valley.",
    "First Anglo-Sikh War: Battle of Sobraon: British defeat Sikhs in the final battle of the war.",
    "In Austin, Texas the newly formed Texas state government is officially installed. The Republic of Texas government officially transfers power to the State of Texas government following the annexation of Texas by the United States.",
    "Polish insurgents lead an uprising in Kraków to incite a fight for national independence.",
    "Thornton Affair: Open conflict begins over the disputed border of Texas, triggering the Mexican-American War.",
    "The few remaining Mormons left in Nauvoo, Illinois, formally dedicate the Nauvoo Temple.",
    "The Cambridge Chronicle, America's oldest surviving weekly newspaper, is published for the first time in Cambridge, Massachusetts.",
    "The world's first \"Mercy\" Hospital is founded in Pittsburgh, United States, by a group of Sisters of Mercy from Ireland; the name will go on to grace over 30 major hospitals throughout the world.",
    "Samuel Colt obtains his first contract for the sale of revolver pistols to the United States government.",
    "The Treaty of Cahuenga ends the Mexican-American War in California.",
    "Westward expansion of the United States: John C. Frémont is appointed Governor of the new California Territory.",
    "Yerba Buena, California is renamed San Francisco, California.",
    "Joseph Jenkins Roberts is sworn in as the first president of Liberia.",
    "The Palermo rising takes place in Sicily against the Bourbon Kingdom of the Two Sicilies.",
    "California Gold Rush: James W. Marshall finds gold at Sutter's Mill near Sacramento.",
    "John C. Frémont is court-martialed for mutiny and disobeying orders.",
    "Mexican-American War: The Treaty of Guadalupe Hidalgo is signed.",
    "Karl Marx and Friedrich Engels publish The Communist Manifesto.",
    "King Louis-Philippe of France abdicates the throne.",
    "Carlo Alberto di Savoia signs the Statuto Albertino that will later represent the first constitution of the Regno d'Italia.",
    "Establishment of the Colony of Vancouver Island."
  ]
}